{
  "deficiencies": {
    "N": {
      "element": "Nitrogen",
      "symptoms": "Feuilles âgées jaunes, croissance ralentie, tiges fines, faible développement foliaire.",
      "effects": {
        "deficiency": "Réduction du rendement, faible croissance végétative, floraison et fructification limitées.",
        "excess": "Croissance excessive des feuilles au détriment des fruits, sensibilité accrue aux maladies."
      },
      "correction": "Appliquer des engrais azotés (urée, nitrate d'ammonium), éviter les excès, fractionner les apports selon les stades.",
      "translations": {
        "en": {
          "symptoms": "Older leaves yellow, slow growth, thin stems, poor leaf development.",
          "deficiency": "Reduced yield, poor vegetative growth, limited flowering and fruiting.",
          "excess": "Excessive leaf growth to the detriment of fruit, increased susceptibility to disease.",
          "correction": "Apply nitrogen fertilizers (urea, ammonium nitrate), avoid excess, divide the contributions according to the stages."
        },
        "zh": {
          "symptoms": "老叶发黄，生长缓慢，茎细，叶片发育不良。",
          "deficiency": "产量下降，营养生长不良，开花结果受限。",
          "excess": "叶片过度生长会损害果实，增加患病的可能性。",
          "correction": "施用氮肥（尿素、硝酸铵），避免过量，按阶段分次施用。"
        },
        "hi": {
          "symptoms": "पुरानी पत्तियां पीली, धीमी वृद्धि, पतले तने, खराब पत्ती विकास।",
          "deficiency": "कम उपज, खराब वनस्पति विकास, सीमित फूल और फलन।",
          "excess": "पत्तियों की अत्यधिक वृद्धि से फलों को नुकसान पहुंचता है, तथा रोग की संभावना बढ़ जाती है।",
          "correction": "नाइट्रोजन उर्वरक (यूरिया, अमोनियम नाइट्रेट) का प्रयोग करें, अधिक मात्रा से बचें, चरणों के अनुसार योगदान को विभाजित करें।"
        },
        "es": {
          "symptoms": "Hojas más viejas amarillas, crecimiento lento, tallos delgados, desarrollo deficiente de las hojas.",
          "deficiency": "Rendimiento reducido, crecimiento vegetativo deficiente, floración y fructificación limitadas.",
          "excess": "Crecimiento excesivo de hojas en detrimento del fruto, mayor susceptibilidad a enfermedades.",
          "correction": "Aplicar fertilizantes nitrogenados (urea, nitrato de amonio), evitar el exceso, dividir los aportes según las etapas."
        },
        "fr": {
          "symptoms": "Feuilles âgées jaunes, croissance ralentie, tiges fines, faible développement foliaire.",
          "deficiency": "Réduction du rendement, faible croissance végétative, floraison et fructification limitées.",
          "excess": "Croissance excessive des feuilles au détriment des fruits, sensibilité accrue aux maladies.",
          "correction": "Appliquer des engrais azotés (urée, nitrate d'ammonium), éviter les excès, fractionner les apports selon les stades."
        },
        "sw": {
          "symptoms": "Majani ya zamani ya manjano, ukuaji wa polepole, shina nyembamba, ukuaji duni wa majani.",
          "deficiency": "Kupungua kwa mavuno, ukuaji duni wa mimea, maua machache na matunda.",
          "excess": "Ukuaji wa majani kupita kiasi kwa madhara ya matunda, kuongezeka kwa uwezekano wa magonjwa.",
          "correction": "Omba mbolea za nitrojeni (urea, nitrati ya ammoniamu), epuka kupita kiasi, ugawanye michango kulingana na hatua."
        },
        "ha": {
          "symptoms": "Manya-manyan ganye rawaya, jinkirin girma, mai tushe na bakin ciki, ƙarancin ci gaban ganye.",
          "deficiency": "Rage yawan amfanin ƙasa, ƙarancin ci gaban ciyayi, ƙarancin fure da 'ya'yan itace.",
          "excess": "Girman ganye mai yawa don lalata 'ya'yan itace, ƙara yawan kamuwa da cuta.",
          "correction": "Aiwatar da takin nitrogen (urea, ammonium nitrate), kauce wa wuce haddi, raba gudummawar bisa ga matakai."
        },
        "yo": {
          "symptoms": "Agbalagba ewe ofeefee, o lọra idagbasoke, tinrin stems, ko dara bunkun idagbasoke.",
          "deficiency": "Idinku ti o dinku, idagbasoke ewe ti ko dara, aladodo lopin ati eso.",
          "excess": "Idagba ewe ti o pọ si ipalara ti eso, ifaragba si arun.",
          "correction": "Waye awọn ajile nitrogen (urea, iyọ ammonium), yago fun apọju, pin awọn ifunni ni ibamu si awọn ipele."
        },
        "ig": {
          "symptoms": "Ochie epupụta edo edo, ngwa ngwa ibu, mkpa ị ga, ogbenye akwukwo mmepe.",
          "deficiency": "Mbelata nke mkpụrụ osisi, uto ahịhịa na-adịghị mma, obere ifuru na ịmị mkpụrụ.",
          "excess": "Oke akwukwo uto na-emebi mkpụrụ osisi, enwekwu ike ibute ọrịa.",
          "correction": "Tinye nitrogen fatịlaịza (urea, ammonium nitrate), zere ngafe, kesaa onyinye dị ka usoro."
        },
        "am": {
          "symptoms": "የቆዩ ቅጠሎች ቢጫ, ዘገምተኛ እድገት, ቀጭን ግንዶች, ደካማ ቅጠል እድገት.",
          "deficiency": "ዝቅተኛ ምርት, ደካማ የእፅዋት እድገት, ውስን አበባ እና ፍራፍሬ.",
          "excess": "ፍራፍሬን ለመጉዳት ከመጠን በላይ የቅጠል እድገት, ለበሽታ ተጋላጭነት ይጨምራል.",
          "correction": "የናይትሮጅን ማዳበሪያዎችን (ዩሪያ, አሚዮኒየም ናይትሬትን) ይተግብሩ, ከመጠን በላይ ያስወግዱ, መዋጮዎችን በደረጃዎች ይከፋፍሉ."
        },
        "om": {
          "symptoms": "Baaloonni dullooman keelloo, guddina suuta, hidda haphii, guddina baala gaarii hin qabne.",
          "deficiency": "Omishni hir’achuu, guddinni biqiltootaa gaarii hin taane, daraaraa fi firii daangeffame.",
          "excess": "Guddinni baala garmalee firii miidhuu, saaxilamummaa dhukkuba dabaluu.",
          "correction": "Xaa’oo naayitiroojiinii (yuriyaa, amooniyeemii naayitreetii) dibachuu, garmalee irraa fagaachuu, gumaacha sadarkaa sadarkaan qooduu."
        },
        "rw": {
          "symptoms": "Amababi ashaje akura umuhondo, gukura gahoro, ibiti bito, gukura nabi kwamababi.",
          "deficiency": "Kugabanya umusaruro, gukura nabi kw'ibimera, indabyo nke n'imbuto.",
          "excess": "Gukura kwamababi menshi kwangiza imbuto, kongera kwandura indwara.",
          "correction": "Koresha ifumbire ya azote (urea, nitrati ya amonium), irinde ibirenze, ugabanye imisanzu ukurikije ibyiciro."
        },
        "ln": {
          "symptoms": "Nkasa ya kala ezali jaune, ekolaka malembe, matiti ya mikemike, nkasa ekola malamu te.",
          "deficiency": "Bokiti ya mbuma, bokoli ya mabe ya banzete, bokasi ya fololo mpe mbuma.",
          "excess": "Kokola ya nkasa mingi na kobebisa mbuma, ebakisaki susceptibilité ya bokono.",
          "correction": "Pakola ba engrais azote (urée, nitrate d’ammonium), koboya kolekisa ndelo, kabola ba contributions selon ba étapes."
        },
        "sn": {
          "symptoms": "Mashizha akakura eyero, kukura zvishoma nezvishoma, madzinde matete, kusakura zvakanaka kweshizha.",
          "deficiency": "Kuderera kwegoho, kusakura kwezvinomera, maruva mashoma uye fruiting.",
          "excess": "Kuwedzera kwemashizha kukura kune kukanganisa kwezvibereko, kuwedzera kubatwa nechirwere.",
          "correction": "Isa nitrogen fertilizer (urea, ammonium nitrate), dzivisa kuwandisa, patsanura mipiro maererano nematanho."
        },
        "tn": {
          "symptoms": "Matlhare a kgale a bosetlha, kgolo e e bonya, dikutu tse di sesane, kgolo e e bokoa ya matlhare.",
          "deficiency": "Thobo e e fokotsegileng, kgolo e e bokoa ya dimela, go thunya go go lekanyeditsweng le go ungwa ga maungo.",
          "excess": "Kgolo e e feteletseng ya matlhare go gobatsa maungo, go oketsega ga go tlhaselega ga malwetse.",
          "correction": "Dirisa menontsha ya naeterojene (urea, ammonium nitrate), tila go feta selekanyo, arola meneelo go ya ka dikgato."
        },
        "st": {
          "symptoms": "Makhasi a khale a mosehla, kholo e liehang, lithupa tse tšesaane, tsoelo-pele e mpe ea makhasi.",
          "deficiency": "Kotulo e fokotsehileng, kholo e fokolang ea limela, lipalesa tse fokolang le litholoana.",
          "excess": "Ho hola ho feteletseng ha makhasi ho senya litholoana, ho ba le monyetla oa ho kula.",
          "correction": "Sebelisa menontsha ea naetrojene (urea, ammonium nitrate), qoba ho feteletseng, arola menehelo ho ea ka mekhahlelo."
        },
        "mg": {
          "symptoms": "Ny raviny efa antitra dia mavomavo, miadana ny fitomboana, manify ny tahony, ratsy ny fivoaran'ny ravina.",
          "deficiency": "Mihena ny vokatra, mahantra ny fitomboan'ny zavamaniry, voafetra ny voninkazo sy ny voankazo.",
          "excess": "Ny fitomboan'ny ravina be loatra ka manimba ny voankazo, mihamitombo ny mety hisian'ny aretina.",
          "correction": "Ampiharo zezika azota (urea, ammonium nitrate), misoroka ny tafahoatra, zarao ny anjara araka ny dingana."
        },
        "wo": {
          "symptoms": "Xob yu màgget yi dañu mboq, màgg ndànk, yaram yu sew yi, xob yi duñu màgg bu baax.",
          "deficiency": "Ndax lu néew, màggug vegetatif bu baaxul, tóor-tóor ak meññeef yu néew.",
          "excess": "Màgg xob yu bari te mën na gàllankoor meññeef yi, gëna yomba am feebar.",
          "correction": "Defal fertilisan te am azot (urée, nitrate d'ammonium), moytu lu ëpp, xaaj li ngay joxe ci etape yi."
        },
        "bm": {
          "symptoms": "A bulu kɔrɔw bɛ jɛ, u bɛ falen dɔɔni dɔɔni, u buluw ka fin, u buluw tɛ yiriwa.",
          "deficiency": "Sɛnɛfɛnw sɔrɔli dɔgɔyali, jiriw falenbaliya, falenfɛnw ni den sɔrɔli danma.",
          "excess": "Furaw falen kojugu ka jiridenw tiɲɛ, o bɛ dɔ fara banaw sɔrɔli kan.",
          "correction": "Aw bɛ azote bagajiw (urea, amonium nitrate) kɛ, aw bɛ aw yɛrɛ tanga kojugu ma, ka bolomafaraw tila ka kɛɲɛ ni taabolo ye."
        },
        "ts": {
          "symptoms": "Matluka ya khale yava yotshuka, ya kula hiku nonoka, swirhabyani swo olova, kukula kahle ka matluka.",
          "deficiency": "Kuhunguteka ka mbuyelo, kukula kahle ka swimilani, ku pfumaleka ka swiluva na mihandzu.",
          "excess": "Kukula ngopfu ka matluka kuva swi onha mihandzu, swiendla leswaku kuva na mavabyi lawa yanga khomiwa hi mavabyi.",
          "correction": "Chela manyoro ya nitrogen (urea, ammonium nitrate), papalata ku tlula mpimo, avanyisa minyikelo kuya hi switeji."
        }
      }
    },
    "P": {
      "element": "Phosphorus",
      "symptoms": "Feuilles vert foncé avec teinte pourpre, racines peu développées, croissance lente.",
      "effects": {
        "deficiency": "Retard de croissance, faible enracinement, réduction du rendement.",
        "excess": "Blocage de l’absorption du zinc et du fer, déséquilibre nutritionnel."
      },
      "correction": "Utiliser du superphosphate ou du phosphate naturel, ajuster le pH du sol pour améliorer la disponibilité.",
      "translations": {
        "en": {
          "symptoms": "Dark green leaves with purple tint, poorly developed roots, slow growth.",
          "deficiency": "Stunted growth, poor rooting, reduced yield.",
          "excess": "Blockage of zinc and iron absorption, nutritional imbalance.",
          "correction": "Use superphosphate or rock phosphate, adjust soil pH to improve availability."
        },
        "zh": {
          "symptoms": "叶片深绿色，带紫色，根部发育不良，生长缓慢。",
          "deficiency": "生长不良，生根不良，产量降低。",
          "excess": "锌、铁吸收受阻，营养不平衡。",
          "correction": "使用过磷酸钙或磷矿，调节土壤pH值以提高可用性。"
        },
        "hi": {
          "symptoms": "बैंगनी रंग के साथ गहरे हरे पत्ते, खराब विकसित जड़ें, धीमी वृद्धि।",
          "deficiency": "अवरुद्ध विकास, खराब जड़ें, कम उपज।",
          "excess": "जिंक और आयरन के अवशोषण में रुकावट, पोषण असंतुलन।",
          "correction": "सुपरफॉस्फेट या रॉक फॉस्फेट का प्रयोग करें, उपलब्धता में सुधार के लिए मिट्टी का पीएच समायोजित करें।"
        },
        "es": {
          "symptoms": "Hojas de color verde oscuro con tinte púrpura, raíces poco desarrolladas, crecimiento lento.",
          "deficiency": "Crecimiento atrofiado, enraizamiento deficiente, rendimiento reducido.",
          "excess": "Bloqueo de la absorción de zinc y hierro, desequilibrio nutricional.",
          "correction": "Utilice superfosfato o fosfato de roca y ajuste el pH del suelo para mejorar la disponibilidad."
        },
        "fr": {
          "symptoms": "Feuilles vert foncé avec teinte pourpre, racines peu développées, croissance lente.",
          "deficiency": "Retard de croissance, faible enracinement, réduction du rendement.",
          "excess": "Blocage de l’absorption du zinc et du fer, déséquilibre nutritionnel.",
          "correction": "Utiliser du superphosphate ou du phosphate naturel, ajuster le pH du sol pour améliorer la disponibilité."
        },
        "sw": {
          "symptoms": "Majani ya kijani kibichi na tint ya zambarau, mizizi isiyokua vizuri, ukuaji wa polepole.",
          "deficiency": "Ukuaji uliodumaa, mizizi duni, kupungua kwa mavuno.",
          "excess": "Uzuiaji wa ngozi ya zinki na chuma, usawa wa lishe.",
          "correction": "Tumia superfosfati au fosfati ya mawe, rekebisha pH ya udongo ili kuboresha upatikanaji."
        },
        "ha": {
          "symptoms": "Dark kore ganye tare da purple tint, talauci raya tushen, jinkirin girma.",
          "deficiency": "Rashin girma, rashin tushen tushe, rage yawan amfanin ƙasa.",
          "excess": "Toshewar zinc da jan ƙarfe, rashin daidaituwa na abinci.",
          "correction": "Yi amfani da superphosphate ko dutse phosphate, daidaita ƙasa pH don inganta samuwa."
        },
        "yo": {
          "symptoms": "Awọn ewe alawọ ewe dudu pẹlu tint eleyi ti, awọn gbongbo ti ko ni idagbasoke, idagbasoke ti o lọra.",
          "deficiency": "Idagba ti ko dara, rutini ti ko dara, ikore ti o dinku.",
          "excess": "Idilọwọ ti sinkii ati gbigba irin, aiṣedeede ijẹẹmu.",
          "correction": "Lo superphosphate tabi apata fosifeti, ṣatunṣe pH ile lati mu ilọsiwaju sii."
        },
        "ig": {
          "symptoms": "Ọchịchịrị green epupụta na-acha odo odo tint, emezighituri mepụtara mgbọrọgwụ, ngwa ngwa ibu.",
          "deficiency": "Ntọhapụ nke uto, mgbọrọgwụ dara ogbenye, mbelata mkpụrụ.",
          "excess": "Mgbochi nke zinc na absorption nke ígwè, enweghị nri na-edozi ahụ.",
          "correction": "Jiri superphosphate ma ọ bụ nkume phosphate, dozie ala pH iji melite nnweta."
        },
        "am": {
          "symptoms": "ጥቁር አረንጓዴ ቅጠሎች ከሐምራዊ ቀለም ፣ በደንብ ያልዳበሩ ሥሮች ፣ ዘገምተኛ እድገት።",
          "deficiency": "የተዳከመ እድገት, ደካማ ሥር, የምርት መቀነስ.",
          "excess": "የዚንክ እና የብረት መሳብ መዘጋት, የተመጣጠነ ምግብ አለመመጣጠን.",
          "correction": "ሱፐርፎፌት ወይም ሮክ ፎስፌት ይጠቀሙ፣ ተገኝነትን ለማሻሻል የአፈርን ፒኤች ያስተካክሉ።"
        },
        "om": {
          "symptoms": "Baalli magariisa dukkanaa’aa kan ta’ee fi halluu diimaa kan qabu, hundeen isaa haala gaarii hin taane kan guddate, suuta kan guddatu dha.",
          "deficiency": "Guddinni isaa duubatti deebi’uu, hiddi isaa gaarii hin taane, oomishni hir’achuu.",
          "excess": "Xuuxamuu ziinkii fi ayirenii cufuu, madaallii soorataa dhabuu.",
          "correction": "Superphosphate ykn rock phosphate fayyadamuu, pH biyyee sirreessuun argama fooyyessuu."
        },
        "rw": {
          "symptoms": "Amababi yicyatsi yijimye afite ibara ryijimye, imizi idakuze neza, gukura buhoro.",
          "deficiency": "Gukura guhagarara, gushinga imizi nabi, kugabanya umusaruro.",
          "excess": "Guhagarika zinc hamwe no kwinjiza fer, kutagira imirire.",
          "correction": "Koresha superphosifate cyangwa fosifate y'urutare, hindura ubutaka pH kugirango utezimbere kuboneka."
        },
        "ln": {
          "symptoms": "Nkasa ya vert foncé na teinte violet, misisa oyo ekoli malamu te, ekolaka malembe.",
          "deficiency": "Bokoli ya kokita, misisa ya mabe, mbuma ekiti.",
          "excess": "Blocage ya absorption ya zinc na fer, déséquilibre nutritionnel.",
          "correction": "Salelá superphosphate to phosphate ya mabanga, bongisa pH ya mabele mpo na kobongisa bozali."
        },
        "sn": {
          "symptoms": "Mashizha akasvibira ane ruvara rwepepuru, midzi isina kukura, inononoka kukura.",
          "deficiency": "Kuremara kukura, kusadzika kwemidzi, kuderera kwegoho.",
          "excess": "Kuvharika kwe zinc uye kunyura kwesimbi, kusaenzana kwehutano.",
          "correction": "Shandisa superphosphate kana rock phosphate, gadzirisa ivhu pH kuti uvandudze kuwanikwa."
        },
        "tn": {
          "symptoms": "Makhasi a matala a lefifi a nang le mmala wa pherese, metso e sa ntshetswa pele hantle, kgolo e bonya.",
          "deficiency": "Kgolo e e fokotsegileng, medi e e bokoa, thobo e e fokotsegileng.",
          "excess": "Thibelo ya zinki le tshipi monyelo, phepo e nepahetseng ho se lekalekane.",
          "correction": "Dirisa superphosphate kgotsa phosphate ya letlapa, baakanya pH ya mmu go tokafatsa go nna teng."
        },
        "st": {
          "symptoms": "Makhasi a matala a lefifi a nang le tint e pherese, metso e sa ntlafatsoang hantle, kholo e liehang.",
          "deficiency": "Khōlo e tsitsitseng, metso e fokolang, chai e fokotsehileng.",
          "excess": "Ho thibela ho kenngoa ha zinki le tšepe, ho se leka-lekane ha phepo e nepahetseng.",
          "correction": "Sebelisa superphosphate kapa rock phosphate, fetola pH ea mobu ho ntlafatsa ho fumaneha."
        },
        "mg": {
          "symptoms": "Ravina maitso matroka misy loko volomparasy, fakan-drivotra tsy mivoatra, miadana ny fitomboana.",
          "deficiency": "Tazonina ny fitomboana, ny fakany ratsy, ny fihenan'ny vokatra.",
          "excess": "Ny fanakanana ny zinc sy ny vy, ny tsy fifandanjana ara-tsakafo.",
          "correction": "Mampiasà superphosphate na rock phosphate, ampifanaraho amin'ny pH ny tany mba hanatsarana ny fisiany."
        },
        "wo": {
          "symptoms": "Xob yu wert yu lëndëm ak melo violet, reen gu màggul bu baax, màgg gu yeex.",
          "deficiency": "Màgg gu yeex, reen gu néew, meññeef gu néew.",
          "excess": "Fatt absorption zinc ak fer, desequilibre nutritionel.",
          "correction": "Jëfandikool superfosfaat wala fosfaat xeer, nga xawa jekkal pH suuf si ngir gëna mëna am."
        },
        "bm": {
          "symptoms": "A buluw ye bulama dibiman ye ni u ɲɛ ye bulama ye, u ju ma yiriwa, u bɛ falen dɔɔni dɔɔni.",
          "deficiency": "Kɛnɛya sabatili, jirisunw sɛnɛbaliya, sɛnɛfɛnw sɔrɔli dɔgɔyali.",
          "excess": "Zɛnki ni nɛgɛ tali balili, balodɛsɛ.",
          "correction": "Aw bɛ superphosphate walima fara fositɛri kɛ, ka dugukolo pH ladilan walasa ka sɔrɔ ka ɲɛ."
        },
        "ts": {
          "symptoms": "Matluka ya rihlaza ro dzwihala na muhlovo wa purple, timintsu letinga kulangiki kahle, kukula hiku nonoka.",
          "deficiency": "Kukula lokunga tsandzeka, ku dzima timintsu lokunga kahle, kuhunguteka ka mbuyelo.",
          "excess": "Ku siveriwa ka ku amukeriwa ka zinc na iron, ku nga ringani ka swakudya.",
          "correction": "Tirhisa superphosphate kumbe rock phosphate, lulamisa pH ya misava kuva yi antswisa vukona."
        }
      }
    },
    "K": {
      "element": "Potassium",
      "symptoms": "Brûlure des bords des feuilles, chlorose marginale, fruits mal formés.",
      "effects": {
        "deficiency": "Faible résistance au stress hydrique, réduction de la qualité des fruits.",
        "excess": "Interférence avec l’absorption du magnésium et du calcium."
      },
      "correction": "Appliquer du sulfate ou chlorure de potassium, éviter les excès sur sols légers.",
      "translations": {
        "en": {
          "symptoms": "Leaf edge burn, marginal chlorosis, malformed fruits.",
          "deficiency": "Low resistance to water stress, reduced fruit quality.",
          "excess": "Interference with the absorption of magnesium and calcium.",
          "correction": "Apply potassium sulfate or chloride, avoid excess on light soils."
        },
        "zh": {
          "symptoms": "叶缘灼伤，边缘失绿，果实畸形。",
          "deficiency": "抵抗水分胁迫能力低，果实品质下降。",
          "excess": "干扰镁和钙的吸收。",
          "correction": "施用硫酸钾或氯化钾，避免在轻质土壤上过量使用。"
        },
        "hi": {
          "symptoms": "पत्ती के किनारे जलना, सीमांत हरितहीनता, विकृत फल।",
          "deficiency": "जल तनाव के प्रति कम प्रतिरोध, फल की गुणवत्ता में कमी।",
          "excess": "मैग्नीशियम और कैल्शियम के अवशोषण में हस्तक्षेप।",
          "correction": "पोटेशियम सल्फेट या क्लोराइड का प्रयोग करें, हल्की मिट्टी पर अधिक प्रयोग से बचें।"
        },
        "es": {
          "symptoms": "Quemadura en el borde de las hojas, clorosis marginal, frutos malformados.",
          "deficiency": "Baja resistencia al estrés hídrico, calidad reducida del fruto.",
          "excess": "Interferencia con la absorción de magnesio y calcio.",
          "correction": "Aplicar sulfato o cloruro de potasio, evitar el exceso en suelos ligeros."
        },
        "fr": {
          "symptoms": "Brûlure des bords des feuilles, chlorose marginale, fruits mal formés.",
          "deficiency": "Faible résistance au stress hydrique, réduction de la qualité des fruits.",
          "excess": "Interférence avec l’absorption du magnésium et du calcium.",
          "correction": "Appliquer du sulfate ou chlorure de potassium, éviter les excès sur sols légers."
        },
        "sw": {
          "symptoms": "Kuungua kwa makali ya majani, chlorosis ya kando, matunda yaliyoharibika.",
          "deficiency": "Upinzani mdogo kwa dhiki ya maji, kupunguza ubora wa matunda.",
          "excess": "Kuingilia kati na ngozi ya magnesiamu na kalsiamu.",
          "correction": "Omba sulfate ya potasiamu au kloridi, epuka kupita kiasi kwenye mchanga mwepesi."
        },
        "ha": {
          "symptoms": "Kone gefen ganye, chlorosis na gefe, 'ya'yan itace mara kyau.",
          "deficiency": "Ƙananan juriya ga matsalolin ruwa, rage yawan 'ya'yan itace.",
          "excess": "Tsangwama tare da sha na magnesium da calcium.",
          "correction": "Aiwatar da potassium sulfate ko chloride, kauce wa wuce haddi akan kasa mai haske."
        },
        "yo": {
          "symptoms": "Ijinna eti ewe, chlorosis ala, awọn eso ti ko dara.",
          "deficiency": "Low resistance to omi wahala, din eso didara.",
          "excess": "Kikọlu pẹlu gbigba iṣuu magnẹsia ati kalisiomu.",
          "correction": "Waye potasiomu sulfate tabi kiloraidi, yago fun apọju lori awọn ile ina."
        },
        "ig": {
          "symptoms": "Ọkụ n'ọnụ akwụkwọ, oke chlorosis, mkpụrụ osisi na-adịghị mma.",
          "deficiency": "Obere iguzogide nrụgide mmiri, belata àgwà mkpụrụ osisi.",
          "excess": "Ntinye aka na ntinye nke magnesium na calcium.",
          "correction": "Tinye potassium sulfate ma ọ bụ chloride, zere ịfefe na ala ọkụ."
        },
        "am": {
          "symptoms": "የቅጠል ጠርዝ ማቃጠል, የኅዳግ ክሎሮሲስ, የተበላሹ ፍራፍሬዎች.",
          "deficiency": "የውሃ ውጥረት ዝቅተኛ መቋቋም, የፍራፍሬ ጥራት ይቀንሳል.",
          "excess": "ማግኒዥየም እና ካልሲየም በመምጠጥ ላይ ጣልቃ መግባት.",
          "correction": "ፖታስየም ሰልፌት ወይም ክሎራይድ ይተግብሩ, በቀላል አፈር ላይ ከመጠን በላይ ያስወግዱ."
        },
        "om": {
          "symptoms": "Gubachuu qarqara baala, kilooroosii marginal, firiiwwan bifa hin qabne.",
          "deficiency": "Dhiibbaa bishaanii dandamachuu gadi aanaa, qulqullina firii hir’isuu.",
          "excess": "Xuuxamuu maagniziyeemii fi kaalsiyeemii gidduu seenuun.",
          "correction": "Pootaasiyeem salfeet ykn kilooraayidii dibachuu, biyyee salphaa irratti garmalee fayyadamuu irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Ibibabi byaka, chlorose marginal, imbuto zidahwitse.",
          "deficiency": "Kurwanya imbaraga nke zamazi, kugabanya ubwiza bwimbuto.",
          "excess": "Kwivanga no kwinjiza magnesium na calcium.",
          "correction": "Koresha potasiyumu sulfate cyangwa chloride, irinde kurenza kubutaka bworoshye."
        },
        "ln": {
          "symptoms": "Kozika ya nsɔngɛ ya nkasa, chlorose marginale, mbuma oyo esalemi malamu te.",
          "deficiency": "Résistance moke na stress ya mayi, qualité ya mbuma ekiti.",
          "excess": "Interférence na absorption ya magnésium na calcium.",
          "correction": "Pakola sulfate de potassium to chlorure, koboya kolekisa ndelo na mabele ya pete."
        },
        "sn": {
          "symptoms": "Kupisa kweshizha, marginal chlorosis, michero isina kunaka.",
          "deficiency": "Kudzikira kuderera kwekunetseka kwemvura, kuderedzwa kwemhando yezvibereko.",
          "excess": "Kukanganisa nekutorwa kwe magnesium uye calcium.",
          "correction": "Isa potassium sulfate kana chloride, dzivisa kuwandisa paivhu rakareruka."
        },
        "tn": {
          "symptoms": "Go fisiwa ga molelwane wa matlhare, chlorosis ya molelwane, maungo a a sa bopegang sentle.",
          "deficiency": "Kganetso e e kwa tlase ya kgatelelo ya metsi, boleng jo bo fokoditsweng jwa leungo.",
          "excess": "Tshitiso le monyelo ya magnesium le khalsiamo.",
          "correction": "Tshela potasiamo sulfate kgotsa chloride, tila pheteletso mo mebung e e botlhofo."
        },
        "st": {
          "symptoms": "Ho chesoa ha makhasi, marginal chlorosis, litholoana tse sa sebetseng hantle.",
          "deficiency": "Ho hanyetsa ho tlaase ho khatello ea metsi, ho fokotsa boleng ba litholoana.",
          "excess": "Ho kena-kenana le ho monya ha magnesium le calcium.",
          "correction": "Sebelisa potassium sulfate kapa chloride, qoba ho feteletseng mobung o bobebe."
        },
        "mg": {
          "symptoms": "May ny sisin'ny ravina, ny chlorose marginal, ny voankazo tsy mety.",
          "deficiency": "Ny fanoherana ambany amin'ny adin'ny rano, ny fihenan'ny kalitaon'ny voankazo.",
          "excess": "Ny fitsabahana amin'ny fidiran'ny magnesium sy calcium.",
          "correction": "Mampiasà sulfate potassium na chloride, fadio ny tafahoatra amin'ny tany maivana."
        },
        "wo": {
          "symptoms": "Lakk bu tàng ci catu xob yi, chlorose ci catu xob yi, meññeef yu baaxul.",
          "deficiency": "Resistance bu woyof ci stress ndox, wàññi kalite meññeef yi.",
          "excess": "Dafay tere magnesium ak kalsium di naan.",
          "correction": "Defal sulfate potassium wala chlorure, moytu ko ëpp ci suuf su woyof."
        },
        "bm": {
          "symptoms": "Furu dawolo jeni, kulorozi dafɛla, jiriden minnu ma dila.",
          "deficiency": "Ji degunw kɛlɛli dɔgɔyali, jiridenw jogo dɔgɔyali.",
          "excess": "Manje ni kalisiyɔmu tali bali.",
          "correction": "Aw bɛ potasiyɔmu sulfate walima kuloridi kɛ a la, aw kana tɛmɛ a kan bɔgɔ nɔgɔlenw kan."
        },
        "ts": {
          "symptoms": "Ku hisiwa ka makumu ya matluka, marginal chlorosis, mihandzu leyi nga vumbekiki kahle.",
          "deficiency": "Ku tiya ka le hansi eka ntshikelelo wa mati, kuhunguteka khwalithi ya mihandzu.",
          "excess": "Ku kavanyetiwa ka ku amukeriwa ka magnesium na calcium.",
          "correction": "Chela potassium sulfate kumbe chloride, papalata ku tlula mpimo eka misava yo vevuka."
        }
      }
    },
    "Ca": {
      "element": "Calcium",
      "symptoms": "Nécrose des jeunes feuilles, pourriture apicale des fruits, racines faibles.",
      "effects": {
        "deficiency": "Déformation des fruits, chute prématurée, réduction du rendement.",
        "excess": "Blocage du magnésium et du potassium, alcalinisation du sol."
      },
      "correction": "Utiliser du gypse ou de la chaux agricole, surveiller le pH et l’équilibre des cations.",
      "translations": {
        "en": {
          "symptoms": "Necrosis of young leaves, blossom end rot of fruits, weak roots.",
          "deficiency": "Fruit deformation, premature drop, reduced yield.",
          "excess": "Blockage of magnesium and potassium, alkalization of the soil.",
          "correction": "Use gypsum or agricultural lime, monitor pH and cation balance."
        },
        "zh": {
          "symptoms": "幼叶坏死、果实花蒂腐烂、根部脆弱。",
          "deficiency": "果实变形、过早掉落，产量降低。",
          "excess": "镁和钾的堵塞，土壤碱化。",
          "correction": "使用石膏或农业石灰，监测 pH 值和阳离子平衡。"
        },
        "hi": {
          "symptoms": "युवा पत्तियों का परिगलन, फलों के पुष्प-अंत में सड़न, कमजोर जड़ें।",
          "deficiency": "फल का विकृत होना, समय से पहले गिरना, उपज में कमी।",
          "excess": "मैग्नीशियम और पोटेशियम का अवरोध, मिट्टी का क्षारीयकरण।",
          "correction": "जिप्सम या कृषि चूने का प्रयोग करें, पीएच और धनायन संतुलन की निगरानी करें।"
        },
        "es": {
          "symptoms": "Necrosis de hojas jóvenes, podredumbre apical de frutos, raíces débiles.",
          "deficiency": "Deformación del fruto, caída prematura, reducción del rendimiento.",
          "excess": "Bloqueo de magnesio y potasio, alcalinización del suelo.",
          "correction": "Utilice yeso o cal agrícola y controle el pH y el equilibrio de cationes."
        },
        "fr": {
          "symptoms": "Nécrose des jeunes feuilles, pourriture apicale des fruits, racines faibles.",
          "deficiency": "Déformation des fruits, chute prématurée, réduction du rendement.",
          "excess": "Blocage du magnésium et du potassium, alcalinisation du sol.",
          "correction": "Utiliser du gypse ou de la chaux agricole, surveiller le pH et l’équilibre des cations."
        },
        "sw": {
          "symptoms": "Necrosis ya majani machanga, kuoza mwisho wa maua ya matunda, mizizi dhaifu.",
          "deficiency": "Deformation ya matunda, kushuka mapema, kupunguza mavuno.",
          "excess": "Uzuiaji wa magnesiamu na potasiamu, alkalization ya udongo.",
          "correction": "Tumia jasi au chokaa cha kilimo, fuatilia pH na usawa wa cation."
        },
        "ha": {
          "symptoms": "Necrosis na matasa ganye, furanni karshen rot na 'ya'yan itatuwa, rauni tushen.",
          "deficiency": "Nakasar 'ya'yan itace, faduwa da wuri, rage yawan amfanin ƙasa.",
          "excess": "Blockage na magnesium da potassium, alkalization na ƙasa.",
          "correction": "Yi amfani da gypsum ko lemun tsami na noma, saka idanu pH da ma'aunin cation."
        },
        "yo": {
          "symptoms": "Negirosisi ti odo leaves, Iruwe opin rot ti unrẹrẹ, lagbara wá.",
          "deficiency": "Idibajẹ eso, sisọ ti tọjọ, ikore ti o dinku.",
          "excess": "Blockage ti iṣuu magnẹsia ati potasiomu, alkalization ti ile.",
          "correction": "Lo gypsum tabi orombo ogbin, ṣe atẹle pH ati iwọntunwọnsi cation."
        },
        "ig": {
          "symptoms": "Necrosis nke na-eto eto epupụta, ifuru ọgwụgwụ ire ere nke mkpụrụ osisi, na-adịghị ike mgbọrọgwụ.",
          "deficiency": "Nrụrụ mkpụrụ osisi, ọdịda akaghi aka, mbelata mkpụrụ.",
          "excess": "Mgbochi nke magnesium na potassium, alkalization nke ala.",
          "correction": "Jiri gypsum ma ọ bụ lime ugbo, nyochaa pH na itule cation."
        },
        "am": {
          "symptoms": "የወጣት ቅጠሎች ኒክሮሲስ ፣ የፍራፍሬ መጨረሻ መበስበስ ፣ ደካማ ሥሮች ያብባሉ።",
          "deficiency": "የፍራፍሬ መበላሸት ፣ ያለጊዜው መውደቅ ፣ የምርት መቀነስ።",
          "excess": "የማግኒዚየም እና የፖታስየም መዘጋት, የአፈርን አልካላይዜሽን.",
          "correction": "የጂፕሰም ወይም የግብርና ሎሚ ይጠቀሙ፣ የፒኤች እና የኬቲን ሚዛን ይቆጣጠሩ።"
        },
        "om": {
          "symptoms": "Necrosis baala dargaggoo, daraaraa dhuma manca’uu firii, hiddi dadhabaa.",
          "deficiency": "Difoormeeshinii firii, yeroo malee kufaatii, oomishni hir’achuu.",
          "excess": "Cufamuu maagniziyeemii fi pootaasiyeemii, alkaalaayizeeshinii biyyee.",
          "correction": "Jiipsii ykn liim qonnaa fayyadamuu, pH fi madaallii kaatiyoonii hordofuu."
        },
        "rw": {
          "symptoms": "Necrosis yamababi akiri mato, indabyo zirangirira kubora kwimbuto, imizi idakomeye.",
          "deficiency": "Guhindura imbuto, kugabanuka imburagihe, kugabanya umusaruro.",
          "excess": "Guhagarika magnesium na potasiyumu, alkalisation yubutaka.",
          "correction": "Koresha gypsumu cyangwa lime yubuhinzi, ukurikirane pH hamwe nuburinganire."
        },
        "ln": {
          "symptoms": "Nécrose ya nkasa ya bilenge, fleur fin rot ya ba fruits, misisa ya faible.",
          "deficiency": "Déformation ya mbuma, chute précoce, rendement ekiti.",
          "excess": "Blocage ya magnésium na potassium, alcalisation ya mabele.",
          "correction": "Salelá gypse to lime agricole, monitor pH mpe équilibre ya cation."
        },
        "sn": {
          "symptoms": "Necrosis yemashizha maduku, maruva ekupedzisira kuora kwezvibereko, midzi isina simba.",
          "deficiency": "Michero deformation, kudonha nguva isati yakwana, goho rakaderedzwa.",
          "excess": "Kuvharwa kwe magnesium uye potassium, alkalization yevhu.",
          "correction": "Shandisa gypsum kana lime yekurima, tarisa pH uye cation chiyero."
        },
        "tn": {
          "symptoms": "Necrosis ya makhasi a manyane, palesa qetellong bola tsa ditholwana, metso e fokolang.",
          "deficiency": "Go senyega ga leungo, go wa pele ga nako, thobo e e fokotsegileng.",
          "excess": "Thibelo ya magnesiamo le potasiamo, alkalization ya mobu.",
          "correction": "Dirisa gypsum kgotsa kalaka ya temothuo, ela tlhoko pH le tekatekano ya cation."
        },
        "st": {
          "symptoms": "Necrosis ea makhasi a macha, ho bola ha litholoana, metso e fokolang.",
          "deficiency": "Deformation ea litholoana, ho theoha pele ho nako, chai e fokotsehileng.",
          "excess": "Ho thibela magnesium le potasiamo, alkalization ea mobu.",
          "correction": "Sebelisa gypsum kapa lime tsa temo, hlokomela pH le cation balance."
        },
        "mg": {
          "symptoms": "Necrosis ny tanora ravina, mamelana faran`ny lo ny voankazo, malemy fakany.",
          "deficiency": "Voankazo deformation, mitete aloha loatra, mihena ny vokatra.",
          "excess": "Ny fanakanana ny magnesium sy ny potasioma, ny alkalization ny tany.",
          "correction": "Mampiasà gypsum na sokay fambolena, manara-maso ny pH sy ny fifandanjana cation."
        },
        "wo": {
          "symptoms": "Necrose ci xob yu ndaw yi, tóor-tóor yi jeex ci meññeef yi, reeni yu néew doole yi.",
          "deficiency": "Deformaasioŋu meññeef, teel daanu, wàññi meññeef.",
          "excess": "Bloke magnesium ak potassium, alkalisasioŋ suuf si.",
          "correction": "Jëfandikool gypsum wala chaux agricole, nga saytu pH ak ekilibre kation."
        },
        "bm": {
          "symptoms": "Furu denmisɛnninw ka nekɔrɔsi, jiridenw falen laban toli, u ju barikamaw.",
          "deficiency": "Jiridenw bɔgɔbɔli, u jiginni ka kɔn a waati ɲɛ, u ka sɔrɔ dɔgɔyali.",
          "excess": "Manje ni potasiyɔmu balili, dugukolo alkali.",
          "correction": "Aw bɛ jisuma walima sɛnɛfɛnw kɛ, ka pH ni katiyɔn balansi kɔlɔsi."
        },
        "ts": {
          "symptoms": "Necrosis ya matluka lamantsongo, blossom end rot ya mihandzu, timintsu leti tsaneke.",
          "deficiency": "Ku onhaka ka mihandzu, ku wa ka ha ri na nkarhi, kuhunguteka ka mbuyelo.",
          "excess": "Ku pfaleka ka magnesium na potassium, alkalization ya misava.",
          "correction": "Tirhisa gypsum kumbe lime ya vurimi, languta pH na cation balance."
        }
      }
    },
    "Mg": {
      "element": "Magnesium",
      "symptoms": "Chlorose internervaire sur feuilles âgées, bord des feuilles enroulé.",
      "effects": {
        "deficiency": "Photosynthèse réduite, chute des feuilles, baisse de rendement.",
        "excess": "Interférence avec le calcium et le potassium."
      },
      "correction": "Appliquer du sulfate de magnésium (sel d’Epsom) ou dolomie, éviter les excès de K.",
      "translations": {
        "en": {
          "symptoms": "Interveinal chlorosis on older leaves, leaf margins rolled.",
          "deficiency": "Reduced photosynthesis, leaf drop, reduced yield.",
          "excess": "Interference with calcium and potassium.",
          "correction": "Apply magnesium sulfate (Epsom salt) or dolomite, avoid excess K."
        },
        "zh": {
          "symptoms": "老叶脉间失绿，叶缘卷曲。",
          "deficiency": "光合作用降低，叶子掉落，产量降低。",
          "excess": "对钙和钾的干扰。",
          "correction": "涂抹硫酸镁（泻盐）或白云石，避免过量钾。"
        },
        "hi": {
          "symptoms": "पुरानी पत्तियों पर अन्तरशिरा हरितहीनता, पत्ती के किनारे मुड़े हुए।",
          "deficiency": "प्रकाश संश्लेषण में कमी, पत्तियों का गिरना, उपज में कमी।",
          "excess": "कैल्शियम और पोटेशियम के साथ हस्तक्षेप.",
          "correction": "मैग्नीशियम सल्फेट (एप्सम नमक) या डोलोमाइट का प्रयोग करें, अधिक मात्रा में के. का प्रयोग न करें।"
        },
        "es": {
          "symptoms": "Clorosis intervenal en hojas más viejas, márgenes de las hojas enrollados.",
          "deficiency": "Fotosíntesis reducida, caída de hojas, rendimiento reducido.",
          "excess": "Interferencia con el calcio y el potasio.",
          "correction": "Aplicar sulfato de magnesio (sal de Epsom) o dolomita, evitar el exceso de K."
        },
        "fr": {
          "symptoms": "Chlorose internervaire sur feuilles âgées, bord des feuilles enroulé.",
          "deficiency": "Photosynthèse réduite, chute des feuilles, baisse de rendement.",
          "excess": "Interférence avec le calcium et le potassium.",
          "correction": "Appliquer du sulfate de magnésium (sel d’Epsom) ou dolomie, éviter les excès de K."
        },
        "sw": {
          "symptoms": "Klorosisi ya kuingilia kati kwenye majani ya zamani, kando ya jani imevingirwa.",
          "deficiency": "Kupunguza photosynthesis, kushuka kwa majani, kupungua kwa mavuno.",
          "excess": "Kuingilia kati na kalsiamu na potasiamu.",
          "correction": "Tumia salfati ya magnesiamu (chumvi ya Epsom) au dolomite, epuka K kupita kiasi."
        },
        "ha": {
          "symptoms": "Chlorosis na tsaka-tsaki akan tsofaffin ganye, gefen ganye yana birgima.",
          "deficiency": "Rage photosynthesis, raguwar ganye, rage yawan amfanin ƙasa.",
          "excess": "Tsangwama tare da calcium da potassium.",
          "correction": "Aiwatar da magnesium sulfate (Epsom gishiri) ko dolomite, kauce wa wuce haddi K."
        },
        "yo": {
          "symptoms": "chlorosis ti aarin lori awọn ewe agbalagba, awọn ala ewe ti yiyi.",
          "deficiency": "Photosynthesis ti o dinku, jijẹ ewe, ikore ti o dinku.",
          "excess": "Idawọle pẹlu kalisiomu ati potasiomu.",
          "correction": "Waye sulfate magnẹsia (iyo Epsom) tabi dolomite, yago fun apọju K."
        },
        "ig": {
          "symptoms": "Chlorosis interveinal na akwụkwọ ochie, a na-atụgharị akụkụ akwụkwọ.",
          "deficiency": "Mbelata photosynthesis, ọdịda akwụkwọ, mbelata mkpụrụ.",
          "excess": "Ntinye aka na calcium na potassium.",
          "correction": "Tinye magnesium sulfate (nnu Epsom) ma ọ bụ dolomite, zere ngafe K."
        },
        "am": {
          "symptoms": "ኢንተርቬናል ክሎሮሲስ በአሮጌ ቅጠሎች ላይ, የቅጠል ህዳጎች ተንከባለሉ.",
          "deficiency": "የተቀነሰ ፎቶሲንተሲስ፣ የቅጠል መውደቅ፣ የምርት መቀነስ።",
          "excess": "በካልሲየም እና በፖታስየም ውስጥ ጣልቃ መግባት.",
          "correction": "ማግኒዚየም ሰልፌት (Epsom ጨው) ወይም ዶሎማይት ይተግብሩ ፣ ከመጠን በላይ ኬን ያስወግዱ።"
        },
        "om": {
          "symptoms": "Kilooroosiin ujummoo gidduu baala dulloome irratti, qarri baalaatti kan marfame.",
          "deficiency": "Footosinteesiin hir’achuu, baala kufaatii, oomisha hir’achuu.",
          "excess": "Kaalsiyeemii fi pootaasiyeemii gidduu seenuun.",
          "correction": "Maagniziyeem salfeet (Epsom salt) ykn dolomite dibachuu, K garmalee irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Indwara ya chlorose hagati yamababi ashaje, amababi yizunguruka.",
          "deficiency": "Kugabanya fotosintezeza, guta amababi, kugabanya umusaruro.",
          "excess": "Kwivanga na calcium na potasiyumu.",
          "correction": "Koresha magnesium sulfate (umunyu wa Epsom) cyangwa dolomite, irinde kurenza K."
        },
        "ln": {
          "symptoms": "Chlorose interveinale na nkasa ya kala, ba marges ya nkasa ebalusami.",
          "deficiency": "Bokiti ya photosynthèse, bokiti ya nkasa, bokiti ya mbuma.",
          "excess": "Interférence na calcium na potassium.",
          "correction": "Pakola sulfate de magnésium (mungwa ya Epsom) to dolomite, koboya K oyo eleki."
        },
        "sn": {
          "symptoms": "Intervein chlorosis pamashizha akare, mashizha anotenderedzwa.",
          "deficiency": "Yakaderedzwa photosynthesis, kudonha kwemashizha, kuderera kwegoho.",
          "excess": "Kukanganiswa ne calcium uye potassium.",
          "correction": "Isa magnesium sulfate (Epsom munyu) kana dolomite, dzivirira yakawandisa K."
        },
        "tn": {
          "symptoms": "Chlorosis ya magareng ga ditshika mo matlhareng a kgale, dintlha tsa matlhare di biditswe.",
          "deficiency": "Go fokotsega ga photosynthesis, go wela ga matlhare, go fokotsega ga thobo.",
          "excess": "Go kgoreletsa khalesiamo le potasiamo.",
          "correction": "Tshela makenesiamo salefeite (letswai la Epsom) kgotsa dolomite, tila K e e feteletseng."
        },
        "st": {
          "symptoms": "Intervein chlorosis makhasi a khale, mapheo a makhasi a phuthoa.",
          "deficiency": "Phokotso ea photosynthesis, lerotholi la makhasi, chai e fokotsehileng.",
          "excess": "Ho kena-kenana le calcium le potasiamo.",
          "correction": "Sebelisa magnesium sulfate (letsoai la Epsom) kapa dolomite, qoba ho feta K."
        },
        "mg": {
          "symptoms": "Chlorose interveinal amin'ny ravina efa lehibe, mihodinkodina ny sisin'ny ravina.",
          "deficiency": "Nihena ny photosynthesis, ny firotsahan'ny ravina, ny fihenan'ny vokatra.",
          "excess": "Fanelingelenana amin'ny calcium sy potassium.",
          "correction": "Mampiasà sulfate magnesium (sira Epsom) na dolomita, fadio ny K be loatra."
        },
        "wo": {
          "symptoms": "Chlorose interveine ci xob yu màgget yi, catu xob yi dañu laxasu.",
          "deficiency": "Fotosente bu wàññeeku, xob yuy wàcci, meññeef yu wàññeeku.",
          "excess": "Jaxasoo ak kalsiyom ak potaasiyom.",
          "correction": "Defal sulfate magnesium (xorom Epsom) wala dolomite, moytu K lu ëpp."
        },
        "bm": {
          "symptoms": "Kulorozi cɛmancɛ la furabulu kɔrɔw kan, furabuluw dawolo bɛ kurukuru.",
          "deficiency": "Fotosintɛzi dɔgɔyali, furabuluw jigincogo, sɛnɛfɛnw sɔrɔli dɔgɔyali.",
          "excess": "Kalisiyɔmu ni potasiyɔmu tali bali.",
          "correction": "Aw bɛ sulfate de magnésium (Epsom kɔgɔ) walima dolomite kɛ a la, aw bɛ aw yɛrɛ tanga K tɛmɛnen ma."
        },
        "ts": {
          "symptoms": "Interveinal chlorosis eka matluka ya khale, matlhelo ya matluka ya rhendzeleka.",
          "deficiency": "Kuhunguteka ka photosynthesis, ku hunguteka ka matluka, kuhunguteka ka mbuyelo.",
          "excess": "Ku kavanyetiwa ka calcium na potassium.",
          "correction": "Chela magnesium sulfate (Epsom salt) kumbe dolomite, papalata K yo tlula mpimo."
        }
      }
    },
    "S": {
      "element": "Sulfur",
      "symptoms": "Jaunissement des jeunes feuilles, croissance ralentie, tiges fines.",
      "effects": {
        "deficiency": "Réduction de la synthèse protéique, faible rendement.",
        "excess": "Rare, mais peut acidifier le sol."
      },
      "correction": "Utiliser du sulfate d’ammonium ou de potassium, ou du gypse.",
      "translations": {
        "en": {
          "symptoms": "Yellowing of young leaves, slowed growth, thin stems.",
          "deficiency": "Reduced protein synthesis, low yield.",
          "excess": "Rare, but can acidify the soil.",
          "correction": "Use ammonium or potassium sulfate, or gypsum."
        },
        "zh": {
          "symptoms": "幼叶变黄，生长缓慢，茎细。",
          "deficiency": "蛋白质合成减少，产量低。",
          "excess": "罕见，但会使土壤酸化。",
          "correction": "使用硫酸铵或硫酸钾，或石膏。"
        },
        "hi": {
          "symptoms": "युवा पत्तियों का पीला पड़ना, धीमी वृद्धि, पतले तने।",
          "deficiency": "कम प्रोटीन संश्लेषण, कम उपज.",
          "excess": "दुर्लभ, लेकिन मिट्टी को अम्लीय बना सकता है।",
          "correction": "अमोनियम या पोटेशियम सल्फेट, या जिप्सम का प्रयोग करें।"
        },
        "es": {
          "symptoms": "Amarillamiento de hojas jóvenes, crecimiento lento, tallos delgados.",
          "deficiency": "Síntesis de proteínas reducida, bajo rendimiento.",
          "excess": "Raro, pero puede acidificar el suelo.",
          "correction": "Utilice sulfato de amonio o de potasio, o yeso."
        },
        "fr": {
          "symptoms": "Jaunissement des jeunes feuilles, croissance ralentie, tiges fines.",
          "deficiency": "Réduction de la synthèse protéique, faible rendement.",
          "excess": "Rare, mais peut acidifier le sol.",
          "correction": "Utiliser du sulfate d’ammonium ou de potassium, ou du gypse."
        },
        "sw": {
          "symptoms": "Njano ya majani ya vijana, ukuaji wa polepole, shina nyembamba.",
          "deficiency": "Kupunguza awali ya protini, mavuno ya chini.",
          "excess": "Nadra, lakini inaweza acidify udongo.",
          "correction": "Tumia amonia au sulfate ya potasiamu, au jasi."
        },
        "ha": {
          "symptoms": "Yellowing na matasa ganye, slowed girma, bakin ciki mai tushe.",
          "deficiency": "Rage haɗin furotin, ƙananan yawan amfanin ƙasa.",
          "excess": "Rare, amma zai iya acidify ƙasa.",
          "correction": "Yi amfani da ammonium ko potassium sulfate, ko gypsum."
        },
        "yo": {
          "symptoms": "Yellowing ti odo leaves, slowed idagbasoke, tinrin stems.",
          "deficiency": "Dinku amuaradagba kolaginni, kekere ikore.",
          "excess": "Toje, ṣugbọn o le acidify ile.",
          "correction": "Lo ammonium tabi potasiomu sulfate, tabi gypsum."
        },
        "ig": {
          "symptoms": "Yellowing na-eto eto epupụta, slowed ibu, mkpa ị ga.",
          "deficiency": "Mbelata protein njikọ, obere mkpụrụ.",
          "excess": "Obere, ma nwere ike acidify ala.",
          "correction": "Jiri ammonium ma ọ bụ potassium sulfate, ma ọ bụ gypsum."
        },
        "am": {
          "symptoms": "የወጣት ቅጠሎች ቢጫ, የዘገየ እድገት, ቀጭን ግንዶች.",
          "deficiency": "የፕሮቲን ውህደት ቀንሷል ፣ አነስተኛ ምርት።",
          "excess": "አልፎ አልፎ, ነገር ግን አፈርን አሲድ ሊያደርግ ይችላል.",
          "correction": "አሚዮኒየም ወይም ፖታስየም ሰልፌት ወይም ጂፕሰም ይጠቀሙ."
        },
        "om": {
          "symptoms": "Baalli dargaggeessaa keelloo ta’uu, guddinni suuta jechuu, hidda haphii ta’uu.",
          "deficiency": "Walnyaatinsi pirootiinii hir’ate, oomisha xiqqaa.",
          "excess": "Rare, garuu biyyee asiidii gochuu danda’a.",
          "correction": "Amooniyeemii ykn pootaasiyeem salfeet, ykn jipsamii fayyadamuu."
        },
        "rw": {
          "symptoms": "Umuhondo wamababi akiri mato, gukura gahoro, ibiti bito.",
          "deficiency": "Kugabanya intungamubiri za poroteyine, umusaruro muke.",
          "excess": "Ntibisanzwe, ariko birashobora kugabanya ubutaka.",
          "correction": "Koresha ammonium cyangwa potasiyumu sulfate, cyangwa gypsumu."
        },
        "ln": {
          "symptoms": "Kokóma jaune ya nkasa ya mikemike, kokola malɛmbɛmalɛmbɛ, matiti ya mikemike.",
          "deficiency": "Synthèse ya proteine ​​ekitisami, rendement ya moke.",
          "excess": "Rare, kasi ekoki ko acidifier mabele.",
          "correction": "Salelá sulfate d’ammonium to potassium, to gypse."
        },
        "sn": {
          "symptoms": "Yellowing yemashizha maduku, kunonoka kukura, tsvina dzakatetepa.",
          "deficiency": "Yakaderedzwa protein synthesis, goho rakaderera.",
          "excess": "Kashoma, asi inogona acidify ivhu.",
          "correction": "Shandisa ammonium kana potassium sulfate, kana gypsum."
        },
        "tn": {
          "symptoms": "Yellowing ya matlhare a mannye, kgolo e e bonya, dikutu tse di sesane.",
          "deficiency": "Fokotswa poroteine ​​tswakana, tlaase thobo.",
          "excess": "E sa tlwaelega, fela e ka dira gore mmu e nne asiti.",
          "correction": "Dirisa ammoniamo kgotsa potasiamo salefeite, kgotsa jipisamo."
        },
        "st": {
          "symptoms": "Ho tšehla ha makhasi a manyenyane, khōlo e liehang, lithupa tse tšesaane.",
          "deficiency": "Ho fokotseha ha protheine synthesis, lihlahisoa tse fokolang.",
          "excess": "E sa tloaelehang, empa e ka etsa acidity mobung.",
          "correction": "Sebelisa ammonium kapa potassium sulfate, kapa gypsum."
        },
        "mg": {
          "symptoms": "Mavo ny ravina tanora, mihamitombo ny fitomboana, manify ny tahony.",
          "deficiency": "Mihena ny proteinina synthesis, ambany ny vokatra.",
          "excess": "Tsy fahita firy, fa afaka asidra ny tany.",
          "correction": "Ampiasao ammonium na potassium sulfate, na gypsum."
        },
        "wo": {
          "symptoms": "Xob yu ndaw yi mboq, màgg gu yeex, petal yu sew.",
          "deficiency": "Wàññi synthese protein, njuréef gu néew.",
          "excess": "Néew na, waaye mën na asidloo suuf si.",
          "correction": "Jëfandikool amonium wala sulfatu potaasiyom, wala gips."
        },
        "bm": {
          "symptoms": "A bulu denmisɛnninw bɛ jɛ, u falenni dɔɔni dɔɔni, u buluw bɛ fin.",
          "deficiency": "Protéines synthèse dɔgɔyali, sɔrɔ dɔgɔyali.",
          "excess": "A man teli, nka a bɛ se ka dugukolo asidi kɛ.",
          "correction": "Aw bɛ amoniyɔmu walima sulfate potasiyɔmu, walima jipisi kɛ."
        },
        "ts": {
          "symptoms": "Ku tshwuka ka matluka lamantsongo, ku nonoka ku kula, swirhabyani swo olova.",
          "deficiency": "Kuhunguteka ka ku endliwa ka ti protein, mbuyelo wale hansi.",
          "excess": "A swi talanga, kambe swinga endla leswaku misava yiva na acid.",
          "correction": "Tirhisa ammonium kumbe potassium sulfate, kumbe gypsum."
        }
      }
    },
    "Fe": {
      "element": "Iron",
      "symptoms": "Chlorose internervaire sur jeunes feuilles, feuilles presque blanches.",
      "effects": {
        "deficiency": "Photosynthèse réduite, croissance ralentie.",
        "excess": "Toxicité sur sols acides, blocage du phosphore."
      },
      "correction": "Appliquer des chélates de fer (EDDHA, DTPA), corriger le pH si > 7.5.",
      "translations": {
        "en": {
          "symptoms": "Interveinal chlorosis on young leaves, leaves almost white.",
          "deficiency": "Reduced photosynthesis, slowed growth.",
          "excess": "Toxicity on acidic soils, phosphorus blocking.",
          "correction": "Apply iron chelates (EDDHA, DTPA), correct pH if > 7.5."
        },
        "zh": {
          "symptoms": "幼叶脉间失绿，叶片几乎变白。",
          "deficiency": "光合作用减少，生长减缓。",
          "excess": "对酸性土壤有毒性，有阻磷作用。",
          "correction": "使用铁螯合物（EDDHA、DTPA），如果 pH 值 > 7.5，则校正 pH 值。"
        },
        "hi": {
          "symptoms": "युवा पत्तियों पर अंतरशिरा हरितहीनता, पत्तियां लगभग सफेद।",
          "deficiency": "प्रकाश संश्लेषण में कमी, विकास धीमा।",
          "excess": "अम्लीय मिट्टी पर विषाक्तता, फास्फोरस अवरोधन।",
          "correction": "आयरन कीलेट (EDDHA, DTPA) का प्रयोग करें, यदि pH > 7.5 हो तो उसे सही करें।"
        },
        "es": {
          "symptoms": "Clorosis intervenal en hojas jóvenes, hojas casi blancas.",
          "deficiency": "Fotosíntesis reducida, crecimiento ralentizado.",
          "excess": "Toxicidad en suelos ácidos, bloqueo del fósforo.",
          "correction": "Aplicar quelatos de hierro (EDDHA, DTPA), corregir el pH si > 7,5."
        },
        "fr": {
          "symptoms": "Chlorose internervaire sur jeunes feuilles, feuilles presque blanches.",
          "deficiency": "Photosynthèse réduite, croissance ralentie.",
          "excess": "Toxicité sur sols acides, blocage du phosphore.",
          "correction": "Appliquer des chélates de fer (EDDHA, DTPA), corriger le pH si > 7.5."
        },
        "sw": {
          "symptoms": "Chlorosisi ya kuingilia kwenye majani machanga, huacha karibu nyeupe.",
          "deficiency": "Kupungua kwa photosynthesis, kupungua kwa ukuaji.",
          "excess": "Sumu kwenye udongo tindikali, kuzuia fosforasi.",
          "correction": "Weka chelate za chuma (EDDHA, DTPA), sahihi pH ikiwa > 7.5."
        },
        "ha": {
          "symptoms": "Interveinal chlorosis a kan matasa ganye, bar kusan fari.",
          "deficiency": "Rage photosynthesis, jinkirin girma.",
          "excess": "Guba akan ƙasa acidic, toshe phosphorus.",
          "correction": "Aiwatar da ƙarfe chelates (EDDHA, DTPA), daidai pH idan> 7.5."
        },
        "yo": {
          "symptoms": "Interveinal chlorosis lori odo leaves, fi oju fere funfun.",
          "deficiency": "Photosynthesis ti o dinku, idagba fa fifalẹ.",
          "excess": "Majele lori awọn ile ekikan, didi irawọ owurọ.",
          "correction": "Waye awọn chelates iron (EDDHA, DTPA), pH ti o tọ ti> 7.5."
        },
        "ig": {
          "symptoms": "Interveinal chlorosis na-eto eto epupụta, doo fọrọ nke nta na-acha ọcha.",
          "deficiency": "Mbelata photosynthesis, ebelata uto.",
          "excess": "Nsi na ala acidic, na-egbochi phosphorus.",
          "correction": "Tinye iron chelates (EDDHA, DTPA), pH ziri ezi ma ọ bụrụ> 7.5."
        },
        "am": {
          "symptoms": "በወጣት ቅጠሎች ላይ ኢንተርቬናል ክሎሮሲስ, ነጭ ቅጠሎች ማለት ይቻላል.",
          "deficiency": "የፎቶሲንተሲስ ቀንሷል ፣ የዘገየ እድገት።",
          "excess": "በአሲድ አፈር ላይ መርዛማነት, ፎስፎረስ መከልከል.",
          "correction": "የብረት ኬላቶች (ኢዲኤችኤ፣ ዲቲፒኤ)፣ ፒኤች > 7.5 ከሆነ ያርሙ።"
        },
        "om": {
          "symptoms": "Kilooroosiin ujummoo gidduu baala dargaggoo irratti, baalli adii jechuun ni danda’ama.",
          "deficiency": "Footosinteesiin hir’ate, guddina saffisiise.",
          "excess": "Summii biyyee asiidii qabu irratti, fosfarasii ugguruu.",
          "correction": "Iron chelates (EDDHA, DTPA) dibadhu, pH yoo > 7.5 ta’e sirreessuu."
        },
        "rw": {
          "symptoms": "Indwara ya chlorose hagati yamababi akiri mato, amababi hafi yera.",
          "deficiency": "Kugabanya fotosintezeza, gutinda gukura.",
          "excess": "Uburozi ku butaka bwa aside, guhagarika fosifore.",
          "correction": "Koresha chelates ya fer (EDDHA, DTPA), ikosore pH niba> 7.5."
        },
        "ln": {
          "symptoms": "Chlorose interveinale na nkasa ya bilenge, nkasa pene na pembe.",
          "deficiency": "Photosynthèse ekiti, ekitisaki bokoli.",
          "excess": "Toxicité na mabele ya acide, blocage ya phosphore.",
          "correction": "Pakola ba chélates ya fer (EDDHA, DTPA), bobongisa pH soki > 7,5."
        },
        "sn": {
          "symptoms": "Intervein chlorosis pamashizha madiki, anosiya anenge machena.",
          "deficiency": "Yakaderedzwa photosynthesis, inononoka kukura.",
          "excess": "Toxicity paivhu rine acidic, phosphorus blocking.",
          "correction": "Isa iron chelates (EDDHA, DTPA), yakarurama pH kana> 7.5."
        },
        "tn": {
          "symptoms": "Chlorosis ya interveinal mo matlhareng a mannye, matlhare a batla a le masweu.",
          "deficiency": "Fokoditswe photosynthesis, kgolo e butle.",
          "excess": "Botlhole mo mebung e e botlha, go thibela fosforo.",
          "correction": "Tshela dikheleite tsa tshipi (EDDHA, DTPA), baakanya pH fa e le > 7.5."
        },
        "st": {
          "symptoms": "Intervein chlorosis makhasi a manyane, e siea e batla e le tšoeu.",
          "deficiency": "Phokotso ea photosynthesis, khōlo e liehang.",
          "excess": "Chefo mobung o nang le asiti, ho thibela phosphorus.",
          "correction": "Sebelisa chelate ea tšepe (EDDHA, DTPA), e nepahetseng pH haeba> 7.5."
        },
        "mg": {
          "symptoms": "Chlorose interveinal amin'ny ravina tanora, ravina saika fotsy.",
          "deficiency": "Nihena ny photosynthesis, nihena ny fitomboana.",
          "excess": "Poizina amin'ny tany asidra, fanakanana phosphore.",
          "correction": "Ampiharo chelate vy (EDDHA, DTPA), marina pH raha> 7,5."
        },
        "wo": {
          "symptoms": "Chlorose interveinelle ci xob yu ndaw yi, xob yi daanaka weex.",
          "deficiency": "Fotosente bu wàññeeku, màgg gu yeex.",
          "excess": "Toxisite ci suuf su asid, dafay tere fosfor.",
          "correction": "Defal ay chelate fer (EDDHA, DTPA), nga jubbanti pH sudee > 7.5."
        },
        "bm": {
          "symptoms": "Kulorozi (chlorose interveinal) bɛ furabulu fitininw kan, a buluw bɛ ɲini ka fin.",
          "deficiency": "Fotosintɛzi dɔgɔyara, ka bonya sumaya.",
          "excess": "Toxicité (banakisɛ) bɛ sɔrɔ asidi dugukolow kan, fosiporozɛni balili.",
          "correction": "Aw bɛ nɛgɛ kelatiw (EDDHA, DTPA) kɛ a la, ka pH latilen ni > 7,5."
        },
        "ts": {
          "symptoms": "Interveinal chlorosis eka matluka lamantsongo, matluka ya lava ku basa.",
          "deficiency": "Kuhunguteka ka photosynthesis, ku hunguta kukula.",
          "excess": "Chefu eka misava leyingana acid, ku sivela phosphorus.",
          "correction": "Tirhisa ti iron chelates (EDDHA, DTPA), lulamisa pH loko > 7.5."
        }
      }
    },
    "Zn": {
      "element": "Zinc",
      "symptoms": "Feuilles petites, chlorose internervaire, enroulement, aspect en rosette.",
      "effects": {
        "deficiency": "Croissance ralentie, réduction de la floraison et fructification.",
        "excess": "Toxicité possible, blocage du fer et du manganèse."
      },
      "correction": "Utiliser du sulfate de zinc ou des chélates, éviter les excès de phosphore.",
      "translations": {
        "en": {
          "symptoms": "Small leaves, interveinal chlorosis, rolling, rosette appearance.",
          "deficiency": "Slowed growth, reduced flowering and fruiting.",
          "excess": "Possible toxicity, iron and manganese blockage.",
          "correction": "Use zinc sulfate or chelates, avoid excess phosphorus."
        },
        "zh": {
          "symptoms": "叶片小，脉间失绿，卷曲，莲座状外观。",
          "deficiency": "生长缓慢，开花结果减少。",
          "excess": "可能有毒性、铁和锰堵塞。",
          "correction": "使用硫酸锌或螯合物，避免磷过量。"
        },
        "hi": {
          "symptoms": "छोटी पत्तियां, अंतर शिरा हरित हीनता, लुढ़कती हुई, रोसेट उपस्थिति।",
          "deficiency": "धीमी वृद्धि, फूल और फल कम आना।",
          "excess": "संभावित विषाक्तता, लौह और मैंगनीज अवरोध।",
          "correction": "जिंक सल्फेट या कीलेट का प्रयोग करें, अधिक फास्फोरस से बचें।"
        },
        "es": {
          "symptoms": "Hojas pequeñas, clorosis intervenal, enrolladas, aspecto rosetado.",
          "deficiency": "Crecimiento lento, floración y fructificación reducida.",
          "excess": "Posible toxicidad, bloqueo de hierro y manganeso.",
          "correction": "Utilice sulfato de zinc o quelatos, evite el exceso de fósforo."
        },
        "fr": {
          "symptoms": "Feuilles petites, chlorose internervaire, enroulement, aspect en rosette.",
          "deficiency": "Croissance ralentie, réduction de la floraison et fructification.",
          "excess": "Toxicité possible, blocage du fer et du manganèse.",
          "correction": "Utiliser du sulfate de zinc ou des chélates, éviter les excès de phosphore."
        },
        "sw": {
          "symptoms": "Majani madogo, chlorosis ya kati, rolling, rosette kuonekana.",
          "deficiency": "Ukuaji wa polepole, kupungua kwa maua na matunda.",
          "excess": "Sumu inayowezekana, kuzuia chuma na manganese.",
          "correction": "Tumia sulfate ya zinki au chelates, epuka fosforasi ya ziada."
        },
        "ha": {
          "symptoms": "Ƙananan ganye, chlorosis na interveinal, birgima, bayyanar rosette.",
          "deficiency": "Jinkirin girma, rage fure da 'ya'yan itace.",
          "excess": "Mai yuwuwar guba, toshewar ƙarfe da manganese.",
          "correction": "Yi amfani da zinc sulfate ko chelates, kauce wa wuce haddi na phosphorus."
        },
        "yo": {
          "symptoms": "Awọn ewe kekere, chlorosis interveinal, yiyi, irisi rosette.",
          "deficiency": "Idagba ti o lọra, aladodo ti o dinku ati eso.",
          "excess": "Owun to le majele ti, irin ati manganese blockage.",
          "correction": "Lo zinc sulfate tabi chelates, yago fun apọju irawọ owurọ."
        },
        "ig": {
          "symptoms": "Obere akwụkwọ, chlorosis interveinal, mpịakọta, ọdịdị rosette.",
          "deficiency": "Mbelata uto, mbelata okooko na mkpụrụ osisi.",
          "excess": "Nsi nwere ike ime, mgbochi ígwè na manganese.",
          "correction": "Jiri zinc sulfate ma ọ bụ chelates, zere oke phosphorus."
        },
        "am": {
          "symptoms": "ትናንሽ ቅጠሎች, interveinal chlorosis, የሚሽከረከር, የሮዜት መልክ.",
          "deficiency": "የዘገየ እድገት, አበባ እና ፍራፍሬ መቀነስ.",
          "excess": "ሊከሰት የሚችል መርዛማነት, ብረት እና ማንጋኒዝ መዘጋት.",
          "correction": "ዚንክ ሰልፌት ወይም ቼልስ ይጠቀሙ, ከመጠን በላይ ፎስፎረስ ያስወግዱ."
        },
        "om": {
          "symptoms": "Baaloonni xixiqqoo, kiloorosii ujummoo gidduu, rolling, bifa roozeetii.",
          "deficiency": "Guddinni suuta jechuu, daraaraa fi firii hir’isuu.",
          "excess": "Summii ta’uu danda’u, cufamuu ayirenii fi maangaaniziin.",
          "correction": "Zinc salfate ykn chelates fayyadamuu, phosphorus garmalee irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Amababi mato, chlorose interveinal, kuzunguruka, isura ya rosette.",
          "deficiency": "Gutinda gukura, kugabanya indabyo n'imbuto.",
          "excess": "Birashoboka uburozi, ibyuma na manganese kuzibira.",
          "correction": "Koresha zinc sulfate cyangwa chelates, irinde fosifore irenze."
        },
        "ln": {
          "symptoms": "Nkasa ya mike, chlorose interveinal, roulement, komonana ya rosette.",
          "deficiency": "Bokoli ya malembe, kokita ya fololo mpe kobota mbuma.",
          "excess": "Toxicité possible, blocage ya fer na manganèse.",
          "correction": "Salelá sulfate de zinc to ba chélates, koboya phosphore oyo eleki."
        },
        "sn": {
          "symptoms": "Mashizha maduku, intervein chlorosis, rolling, rosette kuonekwa.",
          "deficiency": "Kukura kunononoka, kuderera kwemaruva uye fruiting.",
          "excess": "Zvinogoneka toxicity, iron uye manganese blockage.",
          "correction": "Shandisa zinc sulfate kana chelates, dzivisa yakawandisa phosphorus."
        },
        "tn": {
          "symptoms": "Matlhare a mannye, chlorosis ya magareng ga ditshika, go pitikologa, ponagalo ya rosette.",
          "deficiency": "Kgolo e e bonya, go fokotsega ga go thunya le go ungwa.",
          "excess": "Botlhole jo bo ka nnang teng, go thibana ga tshipi le manganese.",
          "correction": "Dirisa zinki sulfate kgotsa di-chelate, tila fosforo e e feteletseng."
        },
        "st": {
          "symptoms": "Makhasi a manyane, intervein chlorosis, rolling, rosette ponahalo.",
          "deficiency": "Khōlo e liehang, lipalesa tse fokotsehileng le fruiting.",
          "excess": "Chefo e ka bang teng, ho thibela tšepe le manganese.",
          "correction": "Sebelisa zinc sulfate kapa chelates, qoba phosphorus e feteletseng."
        },
        "mg": {
          "symptoms": "Ravina kely, chlorosis interveinal, mihodinkodina, endrika rosette.",
          "deficiency": "Mihamitombo ny fitomboana, mihena ny voninkazo sy ny voankazo.",
          "excess": "Mety misy poizina, fanakanana vy sy manganese.",
          "correction": "Ampiasao ny zinc sulfate na chelates, fadio ny phosphore be loatra."
        },
        "wo": {
          "symptoms": "Xob yu ndaw, chlorose ci diggante sidit yi, di xalangu, di nuru rosette.",
          "deficiency": "Màgg gu yeex, wàññi tóor-tóor ak meññeef.",
          "excess": "Toxisite bu mëna am, wen ak mangan buy tëju.",
          "correction": "Jëfandikool sulfate zinc wala chelates, moytu fosfor bu bari."
        },
        "bm": {
          "symptoms": "A bulu misɛnniw, kulorozi cɛmancɛ la, a bɛ wuli, a bɛ kɛ rosɛti ye.",
          "deficiency": "A falenni sumaya, a falenni ni a den sɔrɔli dɔgɔyara.",
          "excess": "Toxicité (banakisɛ) bɛ se ka sɔrɔ, nɛgɛ ni manganɛsi (manganese) balili.",
          "correction": "Aw bɛ zinki sulfate walima kelatiw kɛ, aw bɛ aw yɛrɛ tanga fosiporozɛni tɛmɛnen ma."
        },
        "ts": {
          "symptoms": "Matluka lamantsongo, interveinal chlorosis, rolling, xivumbeko xa rosette.",
          "deficiency": "Ku nonoka kukula, kuhunguteka ka swiluva naku mihandzu.",
          "excess": "Ku nga va na chefu, ku pfaleka ka iron na manganese.",
          "correction": "Tirhisa zinc sulfate kumbe ti chelates, papalata phosphorus yo tlula mpimo."
        }
      }
    },
    "Mn": {
      "element": "Manganese",
      "symptoms": "Chlorose internervaire, taches nécrotiques, feuilles réduites.",
      "effects": {
        "deficiency": "Photosynthèse réduite, faible croissance.",
        "excess": "Toxicité sur sols acides, inhibition du fer."
      },
      "correction": "Appliquer du sulfate de manganèse, ajuster le pH si trop élevé.",
      "translations": {
        "en": {
          "symptoms": "Interveinal chlorosis, necrotic spots, reduced leaves.",
          "deficiency": "Reduced photosynthesis, poor growth.",
          "excess": "Toxicity on acidic soils, iron inhibition.",
          "correction": "Apply manganese sulfate, adjust pH if too high."
        },
        "zh": {
          "symptoms": "叶脉间失绿，出现坏死斑点，叶片减少。",
          "deficiency": "光合作用降低，生长不良。",
          "excess": "对酸性土壤有毒性，有铁抑制作用。",
          "correction": "使用硫酸锰，如果pH值太高则调整pH值。"
        },
        "hi": {
          "symptoms": "अंतर शिरा हरित हीनता, परिगलित धब्बे, कम होती हुई पत्तियां।",
          "deficiency": "कम प्रकाश संश्लेषण, खराब विकास.",
          "excess": "अम्लीय मिट्टी पर विषाक्तता, लौह अवरोध।",
          "correction": "मैंगनीज सल्फेट का प्रयोग करें, यदि पीएच अधिक हो तो उसे समायोजित करें।"
        },
        "es": {
          "symptoms": "Clorosis intervenal, manchas necróticas, hojas reducidas.",
          "deficiency": "Fotosíntesis reducida, crecimiento pobre.",
          "excess": "Toxicidad en suelos ácidos, inhibición de hierro.",
          "correction": "Aplique sulfato de manganeso, ajuste el pH si es demasiado alto."
        },
        "fr": {
          "symptoms": "Chlorose internervaire, taches nécrotiques, feuilles réduites.",
          "deficiency": "Photosynthèse réduite, faible croissance.",
          "excess": "Toxicité sur sols acides, inhibition du fer.",
          "correction": "Appliquer du sulfate de manganèse, ajuster le pH si trop élevé."
        },
        "sw": {
          "symptoms": "Chlorosisi ya kuingilia kati, matangazo ya necrotic, majani yaliyopunguzwa.",
          "deficiency": "Kupungua kwa photosynthesis, ukuaji duni.",
          "excess": "Sumu juu ya udongo tindikali, kuzuia chuma.",
          "correction": "Weka salfati ya manganese, rekebisha pH ikiwa juu sana."
        },
        "ha": {
          "symptoms": "Interveinal chlorosis, necrotic spots, rage ganye.",
          "deficiency": "Rage photosynthesis, rashin girma girma.",
          "excess": "Guba akan ƙasa acidic, hana ƙarfe.",
          "correction": "Aiwatar manganese sulfate, daidaita pH idan yayi girma."
        },
        "yo": {
          "symptoms": "chlorosis interveinal, awọn aaye necrotic, awọn ewe ti o dinku.",
          "deficiency": "Photosynthesis dinku, idagbasoke ti ko dara.",
          "excess": "Majele lori awọn ile ekikan, idinamọ irin.",
          "correction": "Waye sulfate manganese, ṣatunṣe pH ti o ba ga ju."
        },
        "ig": {
          "symptoms": "Interveinal chlorosis, necrotic tụrụ, mbelata epupụta.",
          "deficiency": "Mbelata photosynthesis, uto na-adịghị mma.",
          "excess": "Nsi na ala acidic, mgbochi ígwè.",
          "correction": "Tinye manganese sulfate, gbanwee pH ma ọ bụrụ na ọ dị elu."
        },
        "am": {
          "symptoms": "ኢንተርቬንታል ክሎሮሲስ, የኔክሮቲክ ነጠብጣቦች, የተቀነሱ ቅጠሎች.",
          "deficiency": "የተቀነሰ ፎቶሲንተሲስ, ደካማ እድገት.",
          "excess": "በአሲድ አፈር ላይ መርዛማነት, የብረት መከልከል.",
          "correction": "ማንጋኒዝ ሰልፌት ይተግብሩ ፣ በጣም ከፍ ያለ ከሆነ ፒኤች ያስተካክሉ።"
        },
        "om": {
          "symptoms": "Kilooroosii ujummoo gidduu, tuqaawwan neekrootikii, baalli hir’ate.",
          "deficiency": "Footosinteesiin hir’achuu, guddina gaarii dhabuu.",
          "excess": "Summii biyyee asiidii qabu irratti, ayirenii dhorkuu.",
          "correction": "Mangaaniz salfeet dibadhu, yoo baay’ee olka’e pH sirreessaa."
        },
        "rw": {
          "symptoms": "Chlorose yo hagati, ibibara bya nekrotike, amababi yagabanutse.",
          "deficiency": "Kugabanya fotosintezeza, gukura nabi.",
          "excess": "Uburozi kubutaka bwa acide, kubuza ibyuma.",
          "correction": "Koresha sulfate ya manganese, hindura pH niba ari ndende cyane."
        },
        "ln": {
          "symptoms": "Chlorose interveinale, ba taches nécrotiques, nkasa oyo ekitisami.",
          "deficiency": "Photosynthèse ekitisami, bokoli ya mabe.",
          "excess": "Toxicité na mabele ya acide, inhibition ya fer.",
          "correction": "Pakola sulfate ya manganèse, bongisa pH soki eleki mingi."
        },
        "sn": {
          "symptoms": "Intervein chlorosis, necrotic mavara, akaderedzwa mashizha.",
          "deficiency": "Yakaderedzwa photosynthesis, kusakura kwakashata.",
          "excess": "Toxicity paivhu rine acidic, iron inhibition.",
          "correction": "Isa manganese sulfate, gadzirisa pH kana yakawandisa."
        },
        "tn": {
          "symptoms": "Chlorosis ya methapo, matheba a necrotic, makhasi a fokoditsweng.",
          "deficiency": "Go fokotsega ga photosynthesis, kgolo e e bokoa.",
          "excess": "Botlhole mo mebung e e asiti, thibelo ya tshipi.",
          "correction": "Tshela manganese sulfate, fetola pH fa e le kwa godimo thata."
        },
        "st": {
          "symptoms": "Intervein chlorosis, matheba a necrotic, makhasi a fokotsehileng.",
          "deficiency": "Phokotso ea photosynthesis, kholo e fokolang.",
          "excess": "Chefo mobung o nang le asiti, ho thibela tšepe.",
          "correction": "Kenya manganese sulfate, fetola pH haeba e phahame haholo."
        },
        "mg": {
          "symptoms": "chlorosis interveinal, pentina necrotic, ravina mihena.",
          "deficiency": "Mihena ny photosynthesis, tsy mitombona.",
          "excess": "Poizina amin'ny tany asidra, fanakanana vy.",
          "correction": "Ampiharo sulfate manganese, amboary ny pH raha avo loatra."
        },
        "wo": {
          "symptoms": "Chlorose interveine, tombi nekrotik, xob yu wàññeeku.",
          "deficiency": "Fotosente bu wàññeeku, màgg gu bon.",
          "excess": "Toxisite ci suuf yu asid, tere wen.",
          "correction": "Defal sulfate manganèse, nga jekkal pH bi sudee dafa yéeg lool."
        },
        "bm": {
          "symptoms": "Kulorozi cɛmancɛ la, nɔ minnu bɛ mɔgɔ faga, furabuluw bɛ dɔgɔya.",
          "deficiency": "Fotosintɛzi dɔgɔyali, bonya jugu.",
          "excess": "Toxicité (banakisɛ) bɛ sɔrɔ asidi dugukolow kan, nɛgɛ balili.",
          "correction": "Aw bɛ manganɛsi sulfate kɛ a la, ka pH ladilan ni a ka ca kojugu."
        },
        "ts": {
          "symptoms": "Chlorosis ya le xikarhi ka misiha, swivati ​​swa necrotic, matluka lawa ya hungutiweke.",
          "deficiency": "Kuhunguteka ka photosynthesis, kukula lokunga kahle.",
          "excess": "Chefu eka misava leyingana acid, ku sivela iron.",
          "correction": "Chela manganese sulfate, lulamisa pH loko yi tlakukile swinene."
        }
      }
    },
    "Cu": {
      "element": "Copper",
      "symptoms": "Feuilles chlorotiques, croissance ralentie, mauvaise floraison.",
      "effects": {
        "deficiency": "Réduction du rendement, faible résistance aux maladies.",
        "excess": "Toxicité, inhibition du fer et du molybdène."
      },
      "correction": "Utiliser du sulfate de cuivre, éviter les accumulations dans les sols.",
      "translations": {
        "en": {
          "symptoms": "Chlorotic leaves, slow growth, poor flowering.",
          "deficiency": "Reduced yield, low disease resistance.",
          "excess": "Toxicity, inhibition of iron and molybdenum.",
          "correction": "Use copper sulfate, avoid accumulations in soils."
        },
        "zh": {
          "symptoms": "叶片褪绿，生长缓慢，开花不良。",
          "deficiency": "产量降低，抗病性低。",
          "excess": "毒性，对铁和钼有抑制作用。",
          "correction": "使用硫酸铜，避免在土壤中积累。"
        },
        "hi": {
          "symptoms": "क्लोरोटिक पत्तियां, धीमी वृद्धि, खराब फूल।",
          "deficiency": "कम उपज, कम रोग प्रतिरोधक क्षमता।",
          "excess": "विषाक्तता, लौह और मोलिब्डेनम का अवरोध।",
          "correction": "कॉपर सल्फेट का प्रयोग करें, मिट्टी में जमाव से बचें।"
        },
        "es": {
          "symptoms": "Hojas cloróticas, crecimiento lento, floración pobre.",
          "deficiency": "Rendimiento reducido, baja resistencia a las enfermedades.",
          "excess": "Toxicidad, inhibición del hierro y molibdeno.",
          "correction": "Utilizar sulfato de cobre, evitar acumulaciones en suelos."
        },
        "fr": {
          "symptoms": "Feuilles chlorotiques, croissance ralentie, mauvaise floraison.",
          "deficiency": "Réduction du rendement, faible résistance aux maladies.",
          "excess": "Toxicité, inhibition du fer et du molybdène.",
          "correction": "Utiliser du sulfate de cuivre, éviter les accumulations dans les sols."
        },
        "sw": {
          "symptoms": "Majani ya klorotiki, ukuaji wa polepole, maua duni.",
          "deficiency": "Kupunguza mavuno, upinzani mdogo wa magonjwa.",
          "excess": "Sumu, kizuizi cha chuma na molybdenum.",
          "correction": "Tumia sulfate ya shaba, epuka mkusanyiko kwenye udongo."
        },
        "ha": {
          "symptoms": "Ganyen chlorotic, jinkirin girma, fure mara kyau.",
          "deficiency": "Rage yawan amfanin ƙasa, ƙarancin juriya na cuta.",
          "excess": "Guba, hana ƙarfe da molybdenum.",
          "correction": "Yi amfani da jan karfe sulfate, kauce wa tarawa a cikin ƙasa."
        },
        "yo": {
          "symptoms": "Awọn ewe chlorotic, idagbasoke ti o lọra, aladodo ti ko dara.",
          "deficiency": "Idinku ti o dinku, idaabobo arun kekere.",
          "excess": "Majele, idinamọ ti irin ati molybdenum.",
          "correction": "Lo imi-ọjọ imi-ọjọ, yago fun ikojọpọ ni awọn ile."
        },
        "ig": {
          "symptoms": "Akwụkwọ chlorotic, uto ngwa ngwa, ifuru na-adịghị mma.",
          "deficiency": "Mbelata mkpụrụ, obere nguzogide ọrịa.",
          "excess": "Nsi, mgbochi nke ígwè na molybdenum.",
          "correction": "Jiri ọla kọpa sulfate, zere mkpokọta na ala."
        },
        "am": {
          "symptoms": "ክሎሮቲክ ቅጠሎች, ዘገምተኛ እድገት, ደካማ አበባ.",
          "deficiency": "ዝቅተኛ ምርት, ዝቅተኛ የበሽታ መቋቋም.",
          "excess": "መርዛማነት, የብረት እና ሞሊብዲነም መከልከል.",
          "correction": "የመዳብ ሰልፌት ይጠቀሙ, በአፈር ውስጥ መከማቸትን ያስወግዱ."
        },
        "om": {
          "symptoms": "Baalli kiloorootikii, guddina suuta, daraaraa gaarii hin qabne.",
          "deficiency": "Omisha hir’achuu, dhukkuba ofirraa ittisuu gadi aanaa.",
          "excess": "Summii, ayirenii fi moliibdeenii dhorkuu.",
          "correction": "Kooppaar salfeet fayyadamuu, biyyee keessatti kuufamuu irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Amababi ya Chlorotic, gukura gahoro, indabyo mbi.",
          "deficiency": "Kugabanya umusaruro, kurwanya indwara nke.",
          "excess": "Uburozi, kubuza ibyuma na molybdenum.",
          "correction": "Koresha sulfate y'umuringa, irinde kwirundanyiriza mu butaka."
        },
        "ln": {
          "symptoms": "Nkasa ya chlorotique, kokola malembe, fololo ya mabe.",
          "deficiency": "Bokiti ya mbuma, bozangi bokasi ya bokono.",
          "excess": "Toxicité, inhibition ya fer na molybdène.",
          "correction": "Salelá sulfate ya cuivre, koboya ba accumulations na mabele."
        },
        "sn": {
          "symptoms": "Chlorotic mashizha, kunonoka kukura, kuderera kwemaruva.",
          "deficiency": "Kuderedza goho, kushomeka kwezvirwere.",
          "excess": "Toxicity, inhibition yesimbi uye molybdenum.",
          "correction": "Shandisa copper sulfate, dzivisa kuunganidza muvhu."
        },
        "tn": {
          "symptoms": "Matlhare a chlorotic, kgolo e e bonya, go thunya go go bokoa.",
          "deficiency": "Thobo e e fokoditsweng, kganetso e e kwa tlase ya malwetse.",
          "excess": "Botlhole, thibelo ya tshipi le molybdenum.",
          "correction": "Dirisa copper sulfate, tila go kgobokana mo mebung."
        },
        "st": {
          "symptoms": "Makhasi a chlorotic, kholo e liehang, lipalesa tse mpe.",
          "deficiency": "Kotulo e fokotsehileng, ho hanyetsa mafu a tlaase.",
          "excess": "Chefo, ho thibela tšepe le molybdenum.",
          "correction": "Sebelisa sulfate ea koporo, qoba ho bokellana mobung."
        },
        "mg": {
          "symptoms": "Ny ravina chlorotic, miadana ny fitomboana, ny voninkazo ratsy.",
          "deficiency": "Mihena ny vokatra, ambany ny fanoherana ny aretina.",
          "excess": "Poizina, fanakanana ny vy sy molybdène.",
          "correction": "Mampiasà sulfate varahina, misoroka ny fanangonana amin'ny tany."
        },
        "wo": {
          "symptoms": "Xob yu chlorotic, màgg bu yeex, tóor-tóor bu baaxul.",
          "deficiency": "Ndax lu wàññeeku, baña feebar.",
          "excess": "Toxisite, tere fer ak molibdeen.",
          "correction": "Jëfandikool sulfate de cuivre, moytu mu dajaloo ci suuf si."
        },
        "bm": {
          "symptoms": "Kulorotiki buluw, u bɛ falen dɔɔni dɔɔni, u falen man ɲi.",
          "deficiency": "Sɛnɛfɛnw sɔrɔli dɔgɔyali, banaw kunbɛncogo dɔgɔya.",
          "excess": "Toxicité, nɛgɛ ni molibdɛni balili.",
          "correction": "Aw bɛ kuran sulfate kɛ, aw kana a dalajɛ dugukolow la."
        },
        "ts": {
          "symptoms": "Matluka ya chlorotic, ya kula hiku nonoka, ku pfumala swiluva.",
          "deficiency": "Kuhunguteka ka mbuyelo, ku lwisana na mavabyi yale hansi.",
          "excess": "Chefu, ku sivela iron na molybdenum.",
          "correction": "Tirhisa copper sulfate, papalata ku hlengeletiwa eka misava."
        }
      }
    },
    "B": {
      "element": "Boron",
      "symptoms": "Feuilles cassantes, croissance terminale arrêtée, fruits déformés.",
      "effects": {
        "deficiency": "Faible fructification, réduction du rendement.",
        "excess": "Toxicité fréquente, brûlure foliaire."
      },
      "correction": "Appliquer du borax ou acide borique à faible dose, éviter les excès.",
      "translations": {
        "en": {
          "symptoms": "Brittle leaves, stunted terminal growth, deformed fruits.",
          "deficiency": "Low fruiting, reduced yield.",
          "excess": "Frequent toxicity, leaf burn.",
          "correction": "Apply borax or boric acid in small doses, avoid excess."
        },
        "zh": {
          "symptoms": "叶片脆弱，顶端生长发育不良，果实畸形。",
          "deficiency": "结果率低，产量降低。",
          "excess": "经常出现毒性，叶子灼伤。",
          "correction": "少量使用硼砂或硼酸，避免过量。"
        },
        "hi": {
          "symptoms": "भंगुर पत्तियां, अवरुद्ध अंतिम विकास, विकृत फल।",
          "deficiency": "कम फलन, कम उपज.",
          "excess": "बार-बार विषाक्तता, पत्ती जलना।",
          "correction": "बोरेक्स या बोरिक एसिड की छोटी खुराक का प्रयोग करें, अधिक मात्रा से बचें।"
        },
        "es": {
          "symptoms": "Hojas quebradizas, crecimiento terminal atrofiado, frutos deformados.",
          "deficiency": "Fructificación baja, rendimiento reducido.",
          "excess": "Toxicidad frecuente, quemaduras en las hojas.",
          "correction": "Aplicar bórax o ácido bórico en pequeñas dosis, evitar el exceso."
        },
        "fr": {
          "symptoms": "Feuilles cassantes, croissance terminale arrêtée, fruits déformés.",
          "deficiency": "Faible fructification, réduction du rendement.",
          "excess": "Toxicité fréquente, brûlure foliaire.",
          "correction": "Appliquer du borax ou acide borique à faible dose, éviter les excès."
        },
        "sw": {
          "symptoms": "Majani ya brittle, ukuaji wa mwisho uliodumaa, matunda yaliyoharibika.",
          "deficiency": "Matunda ya chini, kupungua kwa mavuno.",
          "excess": "Sumu ya mara kwa mara, kuchoma kwa majani.",
          "correction": "Omba borax au asidi ya boroni kwa dozi ndogo, epuka kupita kiasi."
        },
        "ha": {
          "symptoms": "Ganyen ganyaye, stunted m girma, 'ya'yan itace maras kyau.",
          "deficiency": "Low fruiting, rage yawan amfanin ƙasa.",
          "excess": "Yawan guba, ƙone ganye.",
          "correction": "Aiwatar da borax ko boric acid a cikin ƙananan allurai, kauce wa wuce haddi."
        },
        "yo": {
          "symptoms": "Awọn ewe brittle, idagba ebute gbigbẹ, awọn eso ti o bajẹ.",
          "deficiency": "Eso kekere, ikore ti o dinku.",
          "excess": "Majele ti loorekoore, sisun ewe.",
          "correction": "Waye borax tabi boric acid ni awọn iwọn kekere, yago fun apọju."
        },
        "ig": {
          "symptoms": "Akwụkwọ na-ekukukuku, stunted terminal ito, mkpụrụ osisi ndị nwere nkwarụ.",
          "deficiency": "Mkpụrụ osisi dị ala, mbelata mkpụrụ.",
          "excess": "Ugboro nsi, ọkụ akwukwo.",
          "correction": "Tinye borax ma ọ bụ boric acid na obere doses, zere ngafe."
        },
        "am": {
          "symptoms": "የተበጣጠሱ ቅጠሎች, የዘገየ የእድገት እድገት, የተበላሹ ፍራፍሬዎች.",
          "deficiency": "ዝቅተኛ ፍራፍሬ, የምርት መቀነስ.",
          "excess": "በተደጋጋሚ መርዛማነት, ቅጠል ይቃጠላል.",
          "correction": "ቦርክስ ወይም ቦሪ አሲድ በትንሽ መጠን ይተግብሩ, ከመጠን በላይ ያስወግዱ."
        },
        "om": {
          "symptoms": "Baaloonni cabbii, guddina xumuraa kan dhaabbate, firiiwwan bocaman.",
          "deficiency": "Firii xiqqaa, oomishni hir’ate.",
          "excess": "Yeroo baayyee summii, baala gubachuu.",
          "correction": "Booraaksii ykn asiidii booriik doosiin xiqqaadhaan dibachuu, garmalee irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Amababi yamenetse, gukura gukura kwimbuto, imbuto zahinduwe.",
          "deficiency": "Imbuto nke, kugabanya umusaruro.",
          "excess": "Uburozi kenshi, gutwika amababi.",
          "correction": "Koresha borax cyangwa aside ya boric mukigero gito, irinde kurenza."
        },
        "ln": {
          "symptoms": "Nkasa ya kobukana, bokoli ya nsuka oyo ekangami te, mbuma oyo ebebi.",
          "deficiency": "Kobota mbuma mingi te, mbuma ekiti.",
          "excess": "Toxicité mbala na mbala, kozika ya nkasa.",
          "correction": "Pakola borax to acide borique na ba doses ya mike, koboya kolekisa ndelo."
        },
        "sn": {
          "symptoms": "Brittle mashizha, stunted terminal kukura, akaremara michero.",
          "deficiency": "Low fruiting, goho rakaderedzwa.",
          "excess": "Kazhinji chepfu, kutsva kwemashizha.",
          "correction": "Isa borax kana boric acid mune zviduku zvishoma, dzivisa kudarika."
        },
        "tn": {
          "symptoms": "Matlhare a a thubegang, kgolo e e sa tlhomamang, maungo a a sa itekanelang.",
          "deficiency": "Go ungwa ga maungo a a kwa tlase, kumo e e fokotsegileng.",
          "excess": "Botlhole jwa kgapetsakgapetsa, go fisiwa ga matlhare.",
          "correction": "Dirisa borax kgotsa boric acid ka ditekanyetso tse dinnye, tila go feta selekanyo."
        },
        "st": {
          "symptoms": "Makhasi a brittle, kholo e khutsitseng, litholoana tse holofetseng.",
          "deficiency": "Litholoana tse fokolang, lihlahisoa tse fokolang.",
          "excess": "Hangata chefo, ho chesoa ha makhasi.",
          "correction": "Etsa kopo ea borax kapa boric acid ka tekanyo e nyane, qoba ho feteletseng."
        },
        "mg": {
          "symptoms": "Raviny malemy, tapaka ny fitomboan'ny farany, voakitika ny voankazo.",
          "deficiency": "Voankazo ambany, mihena ny vokatra.",
          "excess": "Poizina matetika, may ny ravina.",
          "correction": "Asio borax na asidra borika amin'ny fatra kely, fadio ny tafahoatra."
        },
        "wo": {
          "symptoms": "Xob yu yomba dagg, màgg gu yeex, meññeef yu yàqu.",
          "deficiency": "Fruit bu néew, meññeef bu néew.",
          "excess": "Toxisite bu bari, lakk xob.",
          "correction": "Defal borax wala asid borik ci dose yu ndaw, moytu ko ëpp."
        },
        "bm": {
          "symptoms": "A buluw bɛ sɔgɔsɔgɔ, u bɛ falen laban na, u jiridenw bɛ tiɲɛ.",
          "deficiency": "Jiridenw ka dɔgɔn, sɛnɛfɛnw sɔrɔli bɛ dɔgɔya.",
          "excess": "Toxicité (banakisɛ) bɛ to a la, furabulu jeni.",
          "correction": "Aw bɛ borakisi walima asidi boriki kɛ a hakɛ dɔɔni na, aw kana a caya."
        },
        "ts": {
          "symptoms": "Matluka ya brittle, ku tsandzeka ku kula ka makumu, mihandzu leyi onhakeke.",
          "deficiency": "Mihandzu yale hansi, mbuyelo wuhunguteka.",
          "excess": "Ku tshamela ku va na chefu, ku hisiwa ka matluka.",
          "correction": "Chela borax kumbe boric acid hi mimpimo leyintsongo, papalata ku tlula mpimo."
        }
      }
    },
    "Mo": {
      "element": "Molybdenum",
      "symptoms": "Jaunissement des feuilles, mauvaise fixation de l’azote (légumineuses).",
      "effects": {
        "deficiency": "Réduction de la croissance, faible rendement.",
        "excess": "Rare, mais peut interférer avec le cuivre."
      },
      "correction": "Utiliser du molybdate d’ammonium, ajuster le pH si trop acide.",
      "translations": {
        "en": {
          "symptoms": "Yellowing of leaves, poor nitrogen fixation (legumes).",
          "deficiency": "Reduced growth, low yield.",
          "excess": "Rare, but may interfere with copper.",
          "correction": "Use ammonium molybdate, adjust pH if too acidic."
        },
        "zh": {
          "symptoms": "叶子变黄，固氮能力差（豆科植物）。",
          "deficiency": "生长减缓，产量低。",
          "excess": "罕见，但可能会干扰铜。",
          "correction": "使用钼酸铵，如果太酸则调整 pH 值。"
        },
        "hi": {
          "symptoms": "पत्तियों का पीला पड़ना, खराब नाइट्रोजन स्थिरीकरण (फलियां)।",
          "deficiency": "कम वृद्धि, कम उपज.",
          "excess": "दुर्लभ, लेकिन तांबे के साथ हस्तक्षेप कर सकता है।",
          "correction": "अमोनियम मोलिब्डेट का प्रयोग करें, यदि अम्लीय हो तो pH समायोजित करें।"
        },
        "es": {
          "symptoms": "Amarillamiento de hojas, mala fijación de nitrógeno (legumbres).",
          "deficiency": "Crecimiento reducido, bajo rendimiento.",
          "excess": "Raro, pero puede interferir con el cobre.",
          "correction": "Utilice molibdato de amonio, ajuste el pH si es demasiado ácido."
        },
        "fr": {
          "symptoms": "Jaunissement des feuilles, mauvaise fixation de l’azote (légumineuses).",
          "deficiency": "Réduction de la croissance, faible rendement.",
          "excess": "Rare, mais peut interférer avec le cuivre.",
          "correction": "Utiliser du molybdate d’ammonium, ajuster le pH si trop acide."
        },
        "sw": {
          "symptoms": "Majani ya manjano, uwekaji duni wa nitrojeni (kunde).",
          "deficiency": "Kupungua kwa ukuaji, mavuno ya chini.",
          "excess": "Nadra, lakini inaweza kuingilia kati na shaba.",
          "correction": "Tumia molybdate ya ammoniamu, rekebisha pH ikiwa ni tindikali sana."
        },
        "ha": {
          "symptoms": "Yellowing na ganye, matalauta nitrogen kayyade (legumes).",
          "deficiency": "Rage girma, ƙananan yawan amfanin ƙasa.",
          "excess": "Rare, amma yana iya tsoma baki tare da jan karfe.",
          "correction": "Yi amfani da ammonium molybdate, daidaita pH idan ya yi yawa acidic."
        },
        "yo": {
          "symptoms": "Yellowing ti leaves, talaka nitrogen fixation (legumes).",
          "deficiency": "Idagba ti o dinku, ikore kekere.",
          "excess": "Toje, ṣugbọn o le dabaru pẹlu bàbà.",
          "correction": "Lo ammonium molybdate, ṣatunṣe pH ti o ba jẹ ekikan pupọ."
        },
        "ig": {
          "symptoms": "Icha akwụkwọ na-acha odo odo, nhazi nitrogen na-adịghị mma (legumes).",
          "deficiency": "Mbelata uto, obere mkpụrụ.",
          "excess": "Ọ dị ụkọ, mana ọ nwere ike igbochi ọla kọpa.",
          "correction": "Jiri ammonium molybdate, gbanwee pH ma ọ bụrụ acidic."
        },
        "am": {
          "symptoms": "ቢጫ ቅጠሎች, ደካማ የናይትሮጅን ማስተካከል (ጥራጥሬዎች).",
          "deficiency": "የእድገት መቀነስ, ዝቅተኛ ምርት.",
          "excess": "አልፎ አልፎ ፣ ግን በመዳብ ላይ ጣልቃ ሊገባ ይችላል።",
          "correction": "አሚዮኒየም ሞሊብዳት ይጠቀሙ፣ በጣም አሲዳማ ከሆነ ፒኤች ያስተካክሉ።"
        },
        "om": {
          "symptoms": "Baalli keelloo ta’uu, naayitiroojiiniin akka hin dhaabbanne (legumes).",
          "deficiency": "Guddina hir’ate, oomishni gadi aanaa.",
          "excess": "Rare, garuu sibiila diimaa gidduu seenuu danda’a.",
          "correction": "Amooniyaamii moliibdeetii fayyadamaa, yoo garmalee asiidii ta’e pH sirreessaa."
        },
        "rw": {
          "symptoms": "Umuhondo wamababi, azote ikennye neza (ibinyamisogwe).",
          "deficiency": "Kugabanya imikurire, umusaruro muke.",
          "excess": "Ntibisanzwe, ariko birashobora kubangamira umuringa.",
          "correction": "Koresha ammonium molybdate, hindura pH niba ari acide cyane."
        },
        "ln": {
          "symptoms": "Kokóma jaune ya nkasa, fixation ya azote ya mabe (légumineuses).",
          "deficiency": "Bokoli ekitisami, mbuma moke.",
          "excess": "Rare, kasi ekoki ko interférer na cuivre.",
          "correction": "Salelá molybdate d’ammonium, bongisa pH soki ezali acide mingi."
        },
        "sn": {
          "symptoms": "Yellowing yemashizha, kusagadzirisa nitrogen (legumes).",
          "deficiency": "Kukura kwakaderera, goho rakaderera.",
          "excess": "Kashoma, asi zvinogona kukanganisa mhangura.",
          "correction": "Shandisa ammonium molybdate, gadzirisa pH kana yakanyanya acidic."
        },
        "tn": {
          "symptoms": "Go nna serolwana ga matlhare, go tlhomamisa ga naeterojene go go bokoa (dinawa).",
          "deficiency": "Kgolô e e fokoditsweng, thobo e e kwa tlase.",
          "excess": "E sa tlwaeleha, empa e ka sitisa koporo.",
          "correction": "Dirisa amoniamo molibdate, fetola pH fa e le esiti thata."
        },
        "st": {
          "symptoms": "Ho ba mosehla ha makhasi, ho futhumala ha naetrojene (legumes).",
          "deficiency": "Khōlo e fokotsehileng, chai e tlaase.",
          "excess": "E sa tloaelehang, empa e ka kena-kenana le koporo.",
          "correction": "Sebelisa ammonium molybdate, fetola pH haeba e le asiti haholo."
        },
        "mg": {
          "symptoms": "Mavo ny raviny, mahantra azota fixation (legioma).",
          "deficiency": "Nihena ny fitomboana, ambany ny vokatra.",
          "excess": "Tsy fahita firy, fa mety hanelingelina ny varahina.",
          "correction": "Ampiasao ammonium molybdate, amboary ny pH raha asidra loatra."
        },
        "wo": {
          "symptoms": "Xob yi dañuy mboq, azot bi du am doole (legume yi).",
          "deficiency": "Màgg gu wàññeeku, meññeef gu néew.",
          "excess": "Rare, waaye mën na jaxasoo ak përëm.",
          "correction": "Jëfandikool molibdat amonium, nga xaw pH sudee asid lool."
        },
        "bm": {
          "symptoms": "Furaw jɛman, azote sirili jugu (legumes).",
          "deficiency": "Bonya dɔgɔyali, sɔrɔ dɔgɔyali.",
          "excess": "A man teli, nka a bɛ se ka nɛgɛ bali.",
          "correction": "Aw bɛ amoniyɔmu molibdati kɛ, ka pH ladilan ni asidi bɛ a la kojugu."
        },
        "ts": {
          "symptoms": "Ku tshwuka ka matluka, ku nga tshamiseki kahle ka nitrogen (legumes).",
          "deficiency": "Kuhunguteka ka kukula, mbuyelo wale hansi.",
          "excess": "A swi talanga, kambe swi nga ha kavanyeta koporo.",
          "correction": "Tirhisa ammonium molybdate, lulamisa pH loko yiri na acid yotala."
        }
      }
    },
    "Cl": {
      "element": "Chlorine",
      "symptoms": "Flétrissement, chlorose, réduction de la taille des feuilles.",
      "effects": {
        "deficiency": "Photosynthèse réduite, faible croissance.",
        "excess": "Toxicité fréquente en irrigation, brûlure foliaire."
      },
      "correction": "Utiliser des engrais contenant du chlorure si nécessaire, surveiller la salinité.",
      "translations": {
        "en": {
          "symptoms": "Wilting, chlorosis, reduction in leaf size.",
          "deficiency": "Reduced photosynthesis, poor growth.",
          "excess": "Frequent toxicity in irrigation, leaf burn.",
          "correction": "Use chloride-containing fertilizers if necessary, monitor salinity."
        },
        "zh": {
          "symptoms": "枯萎、失绿、叶片缩小。",
          "deficiency": "光合作用降低，生长不良。",
          "excess": "灌溉时经常发生毒性作用，引起叶片灼伤。",
          "correction": "必要时使用含氯肥料，监测盐度。"
        },
        "hi": {
          "symptoms": "मुरझाना, हरित हीनता, पत्ती के आकार में कमी।",
          "deficiency": "कम प्रकाश संश्लेषण, खराब विकास.",
          "excess": "सिंचाई में बार-बार विषाक्तता, पत्ती जलना।",
          "correction": "यदि आवश्यक हो तो क्लोराइड युक्त उर्वरकों का प्रयोग करें, लवणता पर नजर रखें।"
        },
        "es": {
          "symptoms": "Marchitez, clorosis, reducción del tamaño de las hojas.",
          "deficiency": "Fotosíntesis reducida, crecimiento pobre.",
          "excess": "Toxicidad frecuente en riego, quemadura de hojas.",
          "correction": "Si es necesario, utilice fertilizantes que contengan cloruro y controle la salinidad."
        },
        "fr": {
          "symptoms": "Flétrissement, chlorose, réduction de la taille des feuilles.",
          "deficiency": "Photosynthèse réduite, faible croissance.",
          "excess": "Toxicité fréquente en irrigation, brûlure foliaire.",
          "correction": "Utiliser des engrais contenant du chlorure si nécessaire, surveiller la salinité."
        },
        "sw": {
          "symptoms": "Wilting, chlorosis, kupunguza ukubwa wa majani.",
          "deficiency": "Kupungua kwa photosynthesis, ukuaji duni.",
          "excess": "Sumu ya mara kwa mara katika umwagiliaji, kuchoma majani.",
          "correction": "Tumia mbolea zenye kloridi ikiwa ni lazima, fuatilia chumvi."
        },
        "ha": {
          "symptoms": "Witing, chlorosis, rage girman ganye.",
          "deficiency": "Rage photosynthesis, rashin girma girma.",
          "excess": "Yawan yawan guba a cikin ban ruwa, ƙone ganye.",
          "correction": "Yi amfani da takin mai ɗauke da chloride idan ya cancanta, saka idanu da gishiri."
        },
        "yo": {
          "symptoms": "Witing, chlorosis, idinku ninu iwọn ewe.",
          "deficiency": "Photosynthesis dinku, idagbasoke ti ko dara.",
          "excess": "Majele ti loorekoore ni irigeson, sisun ewe.",
          "correction": "Lo awọn ajile ti o ni kiloraidi ti o ba jẹ dandan, ṣe atẹle iyọ."
        },
        "ig": {
          "symptoms": "Ịkwụsị, chlorosis, mbelata nke akwukwo akwukwo.",
          "deficiency": "Mbelata photosynthesis, uto na-adịghị mma.",
          "excess": "Ugboro nsi na ogbugba mmiri n'ubi, akwụkwọ ọkụ.",
          "correction": "Jiri fatịlaịza nwere chloride ma ọ bụrụ na ọ dị mkpa, lelee salinity."
        },
        "am": {
          "symptoms": "ዊልቲንግ, ክሎሮሲስ, የቅጠል መጠን መቀነስ.",
          "deficiency": "የተቀነሰ ፎቶሲንተሲስ, ደካማ እድገት.",
          "excess": "በመስኖ ውስጥ በተደጋጋሚ መርዛማነት, ቅጠል ይቃጠላል.",
          "correction": "አስፈላጊ ከሆነ ክሎራይድ የያዙ ማዳበሪያዎችን ይጠቀሙ, ጨዋማነትን ይቆጣጠሩ."
        },
        "om": {
          "symptoms": "Goguun, kilooroosii, guddina baala hir’isuu.",
          "deficiency": "Footosinteesiin hir’achuu, guddina gaarii dhabuu.",
          "excess": "Jallisii keessatti summii yeroo baay’ee, gubachuu baala.",
          "correction": "Yoo barbaachisaa ta’e xaa’oo kilooraayidii of keessaa qabu fayyadamuu, soogidda hordofuu."
        },
        "rw": {
          "symptoms": "Wilting, chlorose, kugabanya ingano yamababi.",
          "deficiency": "Kugabanya fotosintezeza, gukura nabi.",
          "excess": "Uburozi bukabije mu kuhira, gutwika amababi.",
          "correction": "Koresha ifumbire irimo chloride nibiba ngombwa, ukurikirane umunyu."
        },
        "ln": {
          "symptoms": "Kopɔla, chlorose, kokitisa bonene ya nkasa.",
          "deficiency": "Photosynthèse ekitisami, bokoli ya mabe.",
          "excess": "Toxicité mbala na mbala na irrigation, kozika ya nkasa.",
          "correction": "Salelá ba engrais oyo ezali na chlorure soki esengeli, bolanda salinité."
        },
        "sn": {
          "symptoms": "Wilting, chlorosis, kuderedzwa kweshizha saizi.",
          "deficiency": "Yakaderedzwa photosynthesis, kusakura kwakashata.",
          "excess": "Kakawanda chepfu mukudiridza, kupisa kwemashizha.",
          "correction": "Shandisa mafetireza ane chloride kana zvichidikanwa, tarisa salinity."
        },
        "tn": {
          "symptoms": "Go swaba, chlorosis, phokotsego ya bogolo jwa matlhare.",
          "deficiency": "Go fokotsega ga photosynthesis, kgolo e e bokoa.",
          "excess": "Botlhole jwa kgapetsakgapetsa mo nosetsong, go fisiwa ga matlhare.",
          "correction": "Dirisa menontsha e e nang le chloride fa go tlhokega, ela tlhoko letswai."
        },
        "st": {
          "symptoms": "Wilting, chlorosis, ho fokotseha ha boholo ba makhasi.",
          "deficiency": "Phokotso ea photosynthesis, kholo e fokolang.",
          "excess": "Khafetsa chefo ka nosetso, lekhasi chesa.",
          "correction": "Sebelisa menontsha e nang le chloride ha ho hlokahala, hlokomela letsoai."
        },
        "mg": {
          "symptoms": "Malazo, chlorosis, fihenan'ny haben'ny ravina.",
          "deficiency": "Mihena ny photosynthesis, tsy fahampian'ny fitomboana.",
          "excess": "Poizina matetika amin'ny fanondrahana, may ny ravina.",
          "correction": "Mampiasà zezika misy klôro raha ilaina, manara-maso ny salinity."
        },
        "wo": {
          "symptoms": "Woy, chlorose, wàññi dayo xob yi.",
          "deficiency": "Fotosente bu wàññeeku, màgg gu bon.",
          "excess": "Toxisite bu bari ci irigaasioŋ, lakk xob.",
          "correction": "Jëfandikool fertilisan te am chlore su ko jaree, nga xool salinite bi."
        },
        "bm": {
          "symptoms": "Jali, kulorozi, furabulu bonya dɔgɔyali.",
          "deficiency": "Fotosintɛzi dɔgɔyali, bonya jugu.",
          "excess": "Toxicité (banakisɛ) bɛ to ka kɛ jiko la, furabulu jeni.",
          "correction": "Aw bɛ bagajiw kɛ minnu kɔnɔ kuloridi bɛ sɔrɔ ni a mago bɛ a la, aw bɛ kɔgɔ kɔlɔsi."
        },
        "ts": {
          "symptoms": "Ku bola, chlorosis, kuhunguteka ka vukulu bya matluka.",
          "deficiency": "Kuhunguteka ka photosynthesis, kukula lokunga kahle.",
          "excess": "Kutala kuva na chefu eka ku cheleta, ku hisiwa ka matluka.",
          "correction": "Tirhisa manyoro lawa yanga na chloride loko swilaveka, languta munyu."
        }
      }
    },
    "Ni": {
      "element": "Nickel",
      "symptoms": "Accumulation d’urée dans les feuilles, chlorose, croissance ralentie.",
      "effects": {
        "deficiency": "Perturbation du métabolisme de l’azote.",
        "excess": "Toxicité, inhibition enzymatique."
      },
      "correction": "Utiliser des microdoses de nickel si nécessaire, éviter les sols contaminés.",
      "translations": {
        "en": {
          "symptoms": "Accumulation of urea in the leaves, chlorosis, slowed growth.",
          "deficiency": "Disruption of nitrogen metabolism.",
          "excess": "Toxicity, enzyme inhibition.",
          "correction": "Use microdoses of nickel if necessary, avoid contaminated soils."
        },
        "zh": {
          "symptoms": "叶片中尿素积累，失绿，生长减慢。",
          "deficiency": "氮代谢中断。",
          "excess": "毒性，酶抑制。",
          "correction": "必要时使用微剂量的镍，避免土壤受到污染。"
        },
        "hi": {
          "symptoms": "पत्तियों में यूरिया का संचय, हरित हीनता, धीमी वृद्धि।",
          "deficiency": "नाइट्रोजन चयापचय में व्यवधान.",
          "excess": "विषाक्तता, एंजाइम अवरोधन.",
          "correction": "यदि आवश्यक हो तो निकेल की सूक्ष्म खुराक का प्रयोग करें, दूषित मिट्टी से बचें।"
        },
        "es": {
          "symptoms": "Acumulación de urea en las hojas, clorosis, crecimiento lento.",
          "deficiency": "Alteración del metabolismo del nitrógeno.",
          "excess": "Toxicidad, inhibición enzimática.",
          "correction": "Utilizar microdosis de níquel si es necesario, evitar suelos contaminados."
        },
        "fr": {
          "symptoms": "Accumulation d’urée dans les feuilles, chlorose, croissance ralentie.",
          "deficiency": "Perturbation du métabolisme de l’azote.",
          "excess": "Toxicité, inhibition enzymatique.",
          "correction": "Utiliser des microdoses de nickel si nécessaire, éviter les sols contaminés."
        },
        "sw": {
          "symptoms": "Mkusanyiko wa urea kwenye majani, chlorosis, ukuaji wa polepole.",
          "deficiency": "Usumbufu wa kimetaboliki ya nitrojeni.",
          "excess": "Sumu, kizuizi cha enzyme.",
          "correction": "Tumia microdoses ya nikeli ikiwa ni lazima, epuka udongo uliochafuliwa."
        },
        "ha": {
          "symptoms": "Tarin urea a cikin ganye, chlorosis, jinkirin girma.",
          "deficiency": "Rushewar nitrogen metabolism.",
          "excess": "Mai guba, hana enzyme.",
          "correction": "Yi amfani da microdoses na nickel idan ya cancanta, kauce wa gurɓataccen ƙasa."
        },
        "yo": {
          "symptoms": "Ikojọpọ ti urea ninu awọn ewe, chlorosis, idagbasoke ti o fa fifalẹ.",
          "deficiency": "Idalọwọduro ti iṣelọpọ nitrogen.",
          "excess": "Majele, idinamọ enzymu.",
          "correction": "Lo microdoses ti nickel ti o ba jẹ dandan, yago fun awọn ile ti a ti doti."
        },
        "ig": {
          "symptoms": "Mgbakọ nke urea na epupụta, chlorosis, slowed ibu.",
          "deficiency": "Mmebi nke nitrogen metabolism.",
          "excess": "Nsi, mgbochi enzyme.",
          "correction": "Jiri microdoses nke nickel ma ọ bụrụ na ọ dị mkpa, zere ala ndị mmetọ."
        },
        "am": {
          "symptoms": "በቅጠሎች ውስጥ የዩሪያ ክምችት, ክሎሮሲስ, እድገትን ይቀንሳል.",
          "deficiency": "የናይትሮጅን ሜታቦሊዝምን መጣስ.",
          "excess": "መርዛማነት, ኢንዛይም መከልከል.",
          "correction": "አስፈላጊ ከሆነ የኒኬል ማይክሮዶዝ ይጠቀሙ, የተበከለ አፈርን ያስወግዱ."
        },
        "om": {
          "symptoms": "Kuufamni yuuriyaa baala keessatti, kilooroosii, guddina saffisiise.",
          "deficiency": "Jeequmsa meetaabolii naayitiroojiinii.",
          "excess": "Summii, inzaayimii dhorkuu.",
          "correction": "Yoo barbaachisaa ta’e maaykiroodoozii niikeelii fayyadamuu, biyyee faalame irraa fagaachuu."
        },
        "rw": {
          "symptoms": "Kwiyongera kwa urea mumababi, chlorose, gutinda gukura.",
          "deficiency": "Guhagarika metabolism ya azote.",
          "excess": "Uburozi, kubuza enzyme.",
          "correction": "Koresha microdose ya nikel nibiba ngombwa, irinde ubutaka bwanduye."
        },
        "ln": {
          "symptoms": "Accumulation ya urée na nkasa, chlorose, ekitisaki bokoli.",
          "deficiency": "Kobebisama ya métabolisme ya azote.",
          "excess": "Toxicité, kopekisa ba enzymes.",
          "correction": "Salelá ba microdoses ya nickel soki esengeli, koboya mabele oyo ezali na mikrobe."
        },
        "sn": {
          "symptoms": "Kuunganidza urea mumashizha, chlorosis, kunonoka kukura.",
          "deficiency": "Kukanganiswa kwe nitrogen metabolism.",
          "excess": "Toxicity, enzyme inhibition.",
          "correction": "Shandisa mamicrodoses e nickel kana zvichidikanwa, dzivisa ivhu rakasvibiswa."
        },
        "tn": {
          "symptoms": "Pokello ea urea ka makhasi a, chlorosis, butle kgolo.",
          "deficiency": "Go kgoreletsega ga phetogo ya naeterojene.",
          "excess": "Botlhole, thibelo ya enzyme.",
          "correction": "Dirisa di-microdose tsa nickel fa go tlhokega, tila mebu e e kgotletsweng."
        },
        "st": {
          "symptoms": "Ho bokellana ha urea makhasi, chlorosis, ho liehisa kholo.",
          "deficiency": "Ho senyeha ha metabolism ea nitrogen.",
          "excess": "Chefo, thibelo ea enzyme.",
          "correction": "Sebelisa li-microdoses tsa nickel ha ho hlokahala, qoba mobu o silafetseng."
        },
        "mg": {
          "symptoms": "Ny fanangonana ny urea ao amin'ny ravina, ny chlorosis, ny fitomboana miadana.",
          "deficiency": "Fanakorontanana ny metabolism azota.",
          "excess": "Poizina, fanakanana anzima.",
          "correction": "Mampiasà microdoses nikela raha ilaina, fadio ny tany maloto."
        },
        "wo": {
          "symptoms": "Dajale uree ci xob yi, chlorose, màgg gu yeex.",
          "deficiency": "Dakkal metabolismu azot bi.",
          "excess": "Toxisite, tere enzyme.",
          "correction": "Jëfandikool microdose nickel su ko jaree, moytu suuf yu tilim."
        },
        "bm": {
          "symptoms": "Ureya dalajɛli furabuluw la, kulorozi, o bɛ bonya sumaya.",
          "deficiency": "Azote farikolojɔli tiɲɛni.",
          "excess": "Toxicité, enzymes balili.",
          "correction": "Aw bɛ nikɛri hakɛ fitininw kɛ ni a mago bɛ a la, aw bɛ aw yɛrɛ tanga bɔgɔ nɔgɔlenw ma."
        },
        "ts": {
          "symptoms": "Ku hlengeletiwa ka urea eka matluka, chlorosis, swihungute kukula.",
          "deficiency": "Ku kavanyetiwa ka metabolism ya nitrogen.",
          "excess": "Chefu, ku sivela ka enzyme.",
          "correction": "Tirhisa ti microdoses ta nickel loko swilaveka, papalata misava leyi thyakeke."
        }
      }
    },
    "Co": {
      "element": "Cobalt",
      "symptoms": "Fixation de l’azote réduite (légumineuses), croissance ralentie.",
      "effects": {
        "deficiency": "Faible rendement, mauvaise nodulation.",
        "excess": "Toxicité possible, inhibition du fer."
      },
      "correction": "Appliquer du sulfate de cobalt, surveiller le pH et les interactions.",
      "translations": {
        "en": {
          "symptoms": "Reduced nitrogen fixation (legumes), slowed growth.",
          "deficiency": "Low yield, poor nodulation.",
          "excess": "Possible toxicity, iron inhibition.",
          "correction": "Apply cobalt sulfate, monitor pH and interactions."
        },
        "zh": {
          "symptoms": "减少氮固定（豆科植物），减缓生长。",
          "deficiency": "产量低，结瘤性差。",
          "excess": "可能有毒性，铁抑制。",
          "correction": "施用硫酸钴，监测 pH 值和相互作用。"
        },
        "hi": {
          "symptoms": "नाइट्रोजन स्थिरीकरण में कमी (फलियां), विकास धीमा।",
          "deficiency": "कम उपज, खराब गांठें.",
          "excess": "संभावित विषाक्तता, लौह अवरोध।",
          "correction": "कोबाल्ट सल्फेट का प्रयोग करें, pH और अन्योन्यक्रियाओं की निगरानी करें।"
        },
        "es": {
          "symptoms": "Fijación reducida de nitrógeno (legumbres), crecimiento ralentizado.",
          "deficiency": "Bajo rendimiento, pobre nodulación.",
          "excess": "Posible toxicidad, inhibición de hierro.",
          "correction": "Aplicar sulfato de cobalto, controlar el pH y las interacciones."
        },
        "fr": {
          "symptoms": "Fixation de l’azote réduite (légumineuses), croissance ralentie.",
          "deficiency": "Faible rendement, mauvaise nodulation.",
          "excess": "Toxicité possible, inhibition du fer.",
          "correction": "Appliquer du sulfate de cobalt, surveiller le pH et les interactions."
        },
        "sw": {
          "symptoms": "Kupunguza uwekaji wa nitrojeni (kunde), kupunguza ukuaji.",
          "deficiency": "Mavuno ya chini, nodulation mbaya.",
          "excess": "Sumu inayowezekana, kizuizi cha chuma.",
          "correction": "Omba sulfate ya cobalt, fuatilia pH na mwingiliano."
        },
        "ha": {
          "symptoms": "Rage gyare-gyaren nitrogen (legumes), raguwar girma.",
          "deficiency": "Low yawan amfanin ƙasa, matalauta nodulation.",
          "excess": "Mai yiwuwa guba, hana ƙarfe.",
          "correction": "Aiwatar da cobalt sulfate, saka idanu pH da hulɗa."
        },
        "yo": {
          "symptoms": "Idinku nitrogen ti o dinku (legumes), idagbasoke ti o fa fifalẹ.",
          "deficiency": "Ikore kekere, nodulation ti ko dara.",
          "excess": "Majele ti o ṣeeṣe, idinamọ irin.",
          "correction": "Waye koluboti imi-ọjọ, atẹle pH ati awọn ibaraenisepo."
        },
        "ig": {
          "symptoms": "Ndozi nitrogen belatara (legumes), uto na-ebelata.",
          "deficiency": "Mkpụrụ dị ala, nodulation adịghị mma.",
          "excess": "Nsi nwere ike ime, mgbochi ígwè.",
          "correction": "Tinye cobalt sulfate, nyochaa pH na mmekọrịta."
        },
        "am": {
          "symptoms": "የተቀነሰ የናይትሮጅን ማስተካከያ (ጥራጥሬዎች), የዘገየ እድገት.",
          "deficiency": "ዝቅተኛ ምርት, ደካማ nodulation.",
          "excess": "ሊከሰት የሚችል መርዛማነት, የብረት መከልከል.",
          "correction": "ኮባልት ሰልፌት ይተግብሩ፣ ፒኤች እና መስተጋብርን ይቆጣጠሩ።"
        },
        "om": {
          "symptoms": "Naayitiroojiinii fixation (legumes) hir’isuu, guddina saffisiise.",
          "deficiency": "Omisha xiqqaa, noodulation gaarii hin taane.",
          "excess": "Summii ta’uu danda’u, ayirenii dhorkuu.",
          "correction": "Koobaalt salfeet dibachuu, pH fi wal-nyaatinsa hordofuu."
        },
        "rw": {
          "symptoms": "Kugabanya azote ikosora (ibinyamisogwe), gukura bidindiza.",
          "deficiency": "Umusaruro muke, kudashyira mu gaciro.",
          "excess": "Birashoboka uburozi, kubuza ibyuma.",
          "correction": "Koresha cobalt sulfate, ukurikirane pH n'imikoranire."
        },
        "ln": {
          "symptoms": "Bokiti ya fixation ya azote (ba légumineuses), bokoli ya malembe.",
          "deficiency": "Rendement moke, nodulation ya mabe.",
          "excess": "Toxicité possible, inhibition ya fer.",
          "correction": "Pakola sulfate de cobalt, suivre pH na ba interactions."
        },
        "sn": {
          "symptoms": "Yakaderedzwa nitrogen kugadzirisa (legumes), inononoka kukura.",
          "deficiency": "Goho rakaderera, kushaya nodulation.",
          "excess": "Possible toxicity, iron inhibition.",
          "correction": "Isa cobalt sulfate, tarisa pH uye kupindirana."
        },
        "tn": {
          "symptoms": "Fokoditswe go tlhomamisa naeterojene (dinawa), kgolo e e bonya.",
          "deficiency": "Thobo e e kwa tlase, nodulation e e bokoa.",
          "excess": "Botlhole jo bo ka nnang teng, thibelo ya tshipi.",
          "correction": "Dirisa cobalt sulfate, ela tlhoko pH le ditirisano."
        },
        "st": {
          "symptoms": "Phokotso ea nitrogen fixation (legumes), khōlo e liehang.",
          "deficiency": "Kotulo e tlaase, nodulation e fokolang.",
          "excess": "Chefo e ka bang teng, ho thibela tšepe.",
          "correction": "Sebelisa cobalt sulfate, hlokomela pH le litšebelisano."
        },
        "mg": {
          "symptoms": "Nihena ny azota fixation (legioma), nihena ny fitomboana.",
          "deficiency": "Ny vokatra ambany, ny nodulation mahantra.",
          "excess": "Poizina mety hitranga, fanakanana vy.",
          "correction": "Ampiharo sulfate kobalta, manara-maso ny pH sy ny fifandraisana."
        },
        "wo": {
          "symptoms": "Wàññi fiksaasioŋ azot (legume), màgg gu yeex.",
          "deficiency": "Ndax lu néew, nodulation bu baaxul.",
          "excess": "Toxisite bu mëna am, tere fer.",
          "correction": "Defal kobalt sulfate, nga saytu pH bi ak jaxasoo bi."
        },
        "bm": {
          "symptoms": "Azote jɔli dɔgɔyali (legumes), ka bonya sumaya.",
          "deficiency": "Sɛnɛfɛnw sɔrɔli dɔgɔya, nodulation man ɲi.",
          "excess": "Toxicité (banakisɛ) bɛ se ka sɔrɔ, nɛgɛ balili.",
          "correction": "Aw bɛ kobalt sulfate kɛ a la, ka pH ni a ni ɲɔgɔn cɛ jɛɲɔgɔnyaw kɔlɔsi."
        },
        "ts": {
          "symptoms": "Kuhunguteka ka nitrogen fixation (legumes), kuhunguteka kukula.",
          "deficiency": "Mbuyelo wale hansi, nodulation yoka yingari kahle.",
          "excess": "Chefu leyi nga kotekaka, ku sivela ka ayoni.",
          "correction": "Tirhisa cobalt sulfate, languta pH na ku tirhisana."
        }
      }
    }
  }
}