{
    "deficiencies": {
        "N": {
            "element": "Nitrogen",
            "symptoms": "Feuilles âgées jaunes, croissance ralentie, tiges fines, faible développement foliaire.",
            "effects": {
                "deficiency": "Réduction du rendement, faible croissance végétative, floraison et fructification limitées.",
                "excess": "Croissance excessive des feuilles au détriment des fruits, sensibilité accrue aux maladies."
            },
            "correction": "Appliquer des engrais azotés (urée, nitrate d'ammonium), éviter les excès, fractionner les apports selon les stades."
        },
        "P": {
            "element": "Phosphorus",
            "symptoms": "Feuilles vert foncé avec teinte pourpre, racines peu développées, croissance lente.",
            "effects": {
                "deficiency": "Retard de croissance, faible enracinement, réduction du rendement.",
                "excess": "Blocage de l’absorption du zinc et du fer, déséquilibre nutritionnel."
            },
            "correction": "Utiliser du superphosphate ou du phosphate naturel, ajuster le pH du sol pour améliorer la disponibilité."
        },
        "K": {
            "element": "Potassium",
            "symptoms": "Brûlure des bords des feuilles, chlorose marginale, fruits mal formés.",
            "effects": {
                "deficiency": "Faible résistance au stress hydrique, réduction de la qualité des fruits.",
                "excess": "Interférence avec l’absorption du magnésium et du calcium."
            },
            "correction": "Appliquer du sulfate ou chlorure de potassium, éviter les excès sur sols légers."
        },
        "Ca": {
            "element": "Calcium",
            "symptoms": "Nécrose des jeunes feuilles, pourriture apicale des fruits, racines faibles.",
            "effects": {
                "deficiency": "Déformation des fruits, chute prématurée, réduction du rendement.",
                "excess": "Blocage du magnésium et du potassium, alcalinisation du sol."
            },
            "correction": "Utiliser du gypse ou de la chaux agricole, surveiller le pH et l’équilibre des cations."
        },
        "Mg": {
            "element": "Magnesium",
            "symptoms": "Chlorose internervaire sur feuilles âgées, bord des feuilles enroulé.",
            "effects": {
                "deficiency": "Photosynthèse réduite, chute des feuilles, baisse de rendement.",
                "excess": "Interférence avec le calcium et le potassium."
            },
            "correction": "Appliquer du sulfate de magnésium (sel d’Epsom) ou dolomie, éviter les excès de K."
        },
        "S": {
            "element": "Sulfur",
            "symptoms": "Jaunissement des jeunes feuilles, croissance ralentie, tiges fines.",
            "effects": {
                "deficiency": "Réduction de la synthèse protéique, faible rendement.",
                "excess": "Rare, mais peut acidifier le sol."
            },
            "correction": "Utiliser du sulfate d’ammonium ou de potassium, ou du gypse."
        },
        "Fe": {
            "element": "Iron",
            "symptoms": "Chlorose internervaire sur jeunes feuilles, feuilles presque blanches.",
            "effects": {
                "deficiency": "Photosynthèse réduite, croissance ralentie.",
                "excess": "Toxicité sur sols acides, blocage du phosphore."
            },
            "correction": "Appliquer des chélates de fer (EDDHA, DTPA), corriger le pH si > 7.5."
        },
        "Zn": {
            "element": "Zinc",
            "symptoms": "Feuilles petites, chlorose internervaire, enroulement, aspect en rosette.",
            "effects": {
                "deficiency": "Croissance ralentie, réduction de la floraison et fructification.",
                "excess": "Toxicité possible, blocage du fer et du manganèse."
            },
            "correction": "Utiliser du sulfate de zinc ou des chélates, éviter les excès de phosphore."
        },
        "Mn": {
            "element": "Manganese",
            "symptoms": "Chlorose internervaire, taches nécrotiques, feuilles réduites.",
            "effects": {
                "deficiency": "Photosynthèse réduite, faible croissance.",
                "excess": "Toxicité sur sols acides, inhibition du fer."
            },
            "correction": "Appliquer du sulfate de manganèse, ajuster le pH si trop élevé."
        },
        "Cu": {
            "element": "Copper",
            "symptoms": "Feuilles chlorotiques, croissance ralentie, mauvaise floraison.",
            "effects": {
                "deficiency": "Réduction du rendement, faible résistance aux maladies.",
                "excess": "Toxicité, inhibition du fer et du molybdène."
            },
            "correction": "Utiliser du sulfate de cuivre, éviter les accumulations dans les sols."
        },
        "B": {
            "element": "Boron",
            "symptoms": "Feuilles cassantes, croissance terminale arrêtée, fruits déformés.",
            "effects": {
                "deficiency": "Faible fructification, réduction du rendement.",
                "excess": "Toxicité fréquente, brûlure foliaire."
            },
            "correction": "Appliquer du borax ou acide borique à faible dose, éviter les excès."
        },
        "Mo": {
            "element": "Molybdenum",
            "symptoms": "Jaunissement des feuilles, mauvaise fixation de l’azote (légumineuses).",
            "effects": {
                "deficiency": "Réduction de la croissance, faible rendement.",
                "excess": "Rare, mais peut interférer avec le cuivre."
            },
            "correction": "Utiliser du molybdate d’ammonium, ajuster le pH si trop acide."
        },
        "Cl": {
            "element": "Chlorine",
            "symptoms": "Flétrissement, chlorose, réduction de la taille des feuilles.",
            "effects": {
                "deficiency": "Photosynthèse réduite, faible croissance.",
                "excess": "Toxicité fréquente en irrigation, brûlure foliaire."
            },
            "correction": "Utiliser des engrais contenant du chlorure si nécessaire, surveiller la salinité."
        },
        "Ni": {
            "element": "Nickel",
            "symptoms": "Accumulation d’urée dans les feuilles, chlorose, croissance ralentie.",
            "effects": {
                "deficiency": "Perturbation du métabolisme de l’azote.",
                "excess": "Toxicité, inhibition enzymatique."
            },
            "correction": "Utiliser des microdoses de nickel si nécessaire, éviter les sols contaminés."
        },
        "Co": {
            "element": "Cobalt",
            "symptoms": "Fixation de l’azote réduite (légumineuses), croissance ralentie.",
            "effects": {
                "deficiency": "Faible rendement, mauvaise nodulation.",
                "excess": "Toxicité possible, inhibition du fer."
            },
            "correction": "Appliquer du sulfate de cobalt, surveiller le pH et les interactions."
        }
    }
}
