{
  "Alfalfa mosaic virus": {
    "culture": "Luzerne, tomato, pepper, potato, ornamental",
    "Agent causal": "Alfalfa mosaic virus (amv), to virus àr u genre * alfamovirus *, family * bromoviridae *",
    "description": "Virus with broad spectrum of hosts, transmitted mainly by aphids. It causes mosaics and deformations on many plants.",
    "symptoms": "Yellow mosaics, leafy deformations, rabougreation, punctual necrosis on leaves and fruits.",
    "evolution": "Rapid transmission by aphids. The virus persists in plant tissues and can infect new plants in a few minutes.",
    "Name of active product material": "No direct antiviral treatment. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Elimination of infected plants, fight against aphids, use of resistant varieties, distance from sensitive cultures."
  },
  "Aphids": {
    "culture": "Vegetables, fruit trees, cereals, ornamental",
    "Agent causal": "Insects de la super-famille * aphidoidea *, notamment * myzus persicae *, * aphis gossypii *",
    "description": "Small insects-sucking insects who feed on sap and transmit many plant viruses.",
    "symptoms": "Craft leaves, slowed growth, sticky honey, black fumagine, presence of ants.",
    "evolution": "Quick reproduction, often asexual. Several generations per season. Frequent migration between plants.",
    "Name of active product material": "Pyréthrinoids, saavon insecticides, crying, spinosad",
    "treatment": "Sunflower spraying, introduction of natural predators (ladybugs), biological or chemical treatments depending on the threshold."
  },
  "Armyworms": {
    "culture": "Corn, rice, wheat, lawn, leafy vegetables",
    "Agent causal": "Nocturnal butterflies of the genre *spodoptera *, in particular *spodoptera frugiperda *(Automn army)",
    "description": "Very voracious caterpillars that move en masse, causing rapid and severe defoliations.",
    "symptoms": "Holes in the leaves, cut stems, brown areas, presence of many caterpillars.",
    "evolution": "Quick cycle (30–60 days). The larvae cause the majority of damage. Several generations per year.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (BT), méthoxyfénozide, bifenthrine",
    "treatment": "Active monitoring, early treatment, residue management, encouragement of natural enemies."
  },
  "Bacterial canker": {
    "culture": "Tomato, cherry, plum, fishing",
    "Agent causal": "*Clavibacter michiganensis* subsp. *michiganensis* (Cmm), bactérie gram-positive",
    "description": "Systemic bacterial disease causing channinaries, wilts and lesions on fruits and stems.",
    "symptoms": "Brown spots, chancres on branches, elaboration of gum, unilateral wilting.",
    "evolution": "Propagation by infected seeds, tools, splashes. Favored in wet and fresh weather.",
    "Name of active product material": "Copper (hydroxide, oxychloride), phosphonates",
    "treatment": "Pruning in summer, tool disinfection, preventive copper application, elimination of infected plants."
  },
  "Bacterial speck": {
    "culture": "Tomato, pepper",
    "Agent causal": "Pseudomonas Syringae PV. Tomato, Gram-negative bacteria",
    "description": "Bacterial disease mainly affecting tomatoes, causing dark lesions on leaves and fruits.",
    "symptoms": "Small black spots on the leaves with yellow halo, superficial lesions on green fruits, sometimes driven or raised.",
    "evolution": "Favored by fresh and humid conditions (18–24 ° C). Spreads by water splashes, contaminated tools or seeds.",
    "Name of active product material": "Copper (hydroxide, oxychloride), Mancozèbe",
    "treatment": "Use certified seeds, avoid sprinkling by sprinkling, apply copper -based treatments before rains, cultural rotation."
  },
  "Bacterial tache": {
    "culture": "Tomato, pepper",
    "Agent causal": "Xanthomonas campestris pv. vesicatoria",
    "description": "Bacterial disease causing dark spots on the leaves, stems and fruits, often confused with the speck.",
    "symptoms": "Wet stains becoming brown/black, sometimes surrounded by a yellow halo. Lesions on sunk and liégous fruits.",
    "evolution": "Develops in warm and humid weather. Propagates by the seeds, splashes and contaminated tools.",
    "Name of active product material": "Copper + Mancozèbe, Kasugamycin (in some countries)",
    "treatment": "Use healthy seeds, disinfect tools, apply copper -based preventive treatments, 2–3 year old cultural rotation."
  },
  "Beet curly top virus": {
    "culture": "Beet, tomato, pepper, bean, melon",
    "Agent causal": "Beet curly top virus (BCTV), genre *Curtovirus*, famille *Geminiviridae*",
    "description": "Viruses transmitted by the hacking of beet, causing leafy deformations and a growth stop.",
    "symptoms": "Leaves wrapped up, thickened, yellowing, secondary excess roots, slowed growth.",
    "evolution": "Transmitted persistently by *TENELLUS circulifer *. The virus remains active in the insect throughout its life.",
    "Name of active product material": "No antiviral treatment. Vector control: Pyrethrinoids, horticultural oils.",
    "treatment": "Use resistant varieties, eliminate host weeds, install anti-insect nets, avoid infested areas."
  },
  "Beet feuillehopper": {
    "culture": "Beet, tomato, potato, luzerne",
    "Agent causal": "*TENELLUS CIRCULIFER*, CICADELLE Vector of the BCTV",
    "description": "Insect-sucker responsible for the transmission of the beet frying virus.",
    "symptoms": "Jeurvening, rolled up leaves, slowed growth, symptoms linked to the transmitted virus.",
    "evolution": "Multiple generations per year. Moves with the wind. Eggs laid in plant tissues.",
    "Name of active product material": "Spinosad, pyrethrinoids, horticultural oils",
    "treatment": "Monitoring, fighting weeds hosts, anti-insect nets, targeted treatments at the start of infestation."
  },
  "Beetles and feuillehoppers": {
    "culture": "Various cultures: beet, tomato, bean, luzerne",
    "Agent causal": "Various beetles (eg*epicauta spp.*) And cicadelles (*Empoasca spp.*,*Circulifer Tenellus*)",
    "description": "Group of pest insects causing direct (bites, sucking) and indirect (virus transmission) damage.",
    "symptoms": "Perforated, rolled, yellowed, slowed growth, presence of oozing or necrosis.",
    "evolution": "Rapid reproduction, several generations per year. Some vectors transmit persistent viruses.",
    "Name of active product material": "Spinosad, pyrethrinoids, neem oils",
    "treatment": "Monitoring, elimination of weeds, anti-insect nets, biological or chemical treatments depending on the threshold."
  },
  "Big bud": {
    "culture": "Black girl, hazelnut",
    "Agent causal": "*Cecidophyopsis ribis*, microscopic mite",
    "description": "A mite responsible for the abnormal swelling of the buds, which can transmit the reversion virus.",
    "symptoms": "Rounded and swollen buds in winter, not hatched in the spring, reduction of flowering and yield.",
    "evolution": "Mites enter the buds in summer. They multiply there and prevent their development in the following spring.",
    "Name of active product material": "No approved treatment. Sulfur and horticultural oils tested experimentally.",
    "treatment": "Eliminate and burn swollen buds in winter, tear off the highly infested plants, plant resistant varieties (eg ‘Ben Hope’)."
  },
  "Blossom end rot": {
    "culture": "Tomato, pepper, eggplant, zucchini",
    "Agent causal": "Physiological imbalance due to calcium deficiency",
    "description": "Non -pathogenic disorder affecting development fruit, caused by poor absorption of calcium.",
    "symptoms": "Dark spots and driven at the lower end of the fruit, becoming brown then black, sometimes with secondary mold.",
    "evolution": "Often appears on the first fruits. Favored by irregular watering, an excess of nitrogen or a soil poor in calcium.",
    "Name of active product material": "Calcium chélates, calcium nitrate, calcium leaf sprays",
    "treatment": "Maintain constant humidity, avoid excess nitrogen, enrich the calcium soil, preventive leaf spray."
  },
  "Anacardier anthracnose": {
    "culture": "Anacardier (Anacardium occidentale)",
    "Agent causal": "*Colletotrichum gloeosporioides*",
    "description": "Fungal disease causing lesions on leaves, flowers and fruits, greatly reducing the yield.",
    "symptoms": "Brown spots with black on leaves, stunted flowers, deformed or rotten fruits, premature fall.",
    "evolution": "Quickly spreads in warm and humid weather. Spores persist on plant debris.",
    "Name of active product material": "Mancozèbe, copper (oxychloride or hydroxide), azoxystrobin",
    "treatment": "Pruning of infected parts, fungicidal treatments during sensitive period, cultural rotation, ventilation of plantations."
  },
  "Anacardier gumosis": {
    "culture": "Anacardier",
    "Agent causal": "* Lasiodiplodia theobromae* or physiological injuries",
    "description": "Gum flow on the trunk or branches, often linked to stress or secondary infections.",
    "symptoms": "Vertical slits on the trunk, oozing of amber gum, blackening of the bark.",
    "evolution": "Favored by injuries, excessive humidity or pest attacks. Can cause a general weakening.",
    "Name of active product material": "Copper -based fungicides, phosphonates",
    "treatment": "Improve drainage, avoid injury, disinfect tools, remove the infected bark to the healthy fabric."
  },
  "Healthy cashew": {
    "culture": "Anacardier",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of illness or stress, with good vegetative and reproductive development.",
    "symptoms": "Dark green foliage, regular growth, normal flowering and fruiting.",
    "evolution": "A good health condition is maintained by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Good irrigation management, balanced fertilization, sanitary size, preventive phytosanitary surveillance."
  },
  "CHERNE CHEPDARY": {
    "culture": "Anacardier",
    "Agent causal": "Larves Minees (* Acrocercops syngramma *, * Phyllocnistis spp. *)",
    "description": "Insects whose larvae dig galleries in the leaves, reducing photosynthesis.",
    "symptoms": "Silvering silver drag on the leaves, partial drying, premature fall of the leaves.",
    "evolution": "Quick multiplication in hot season. Adults lay on young leaves.",
    "Name of active product material": "Spinosad, abamectine, neem",
    "treatment": "Elimination of affected leaves, targeted insecticide treatments, introduction of natural parasitoids."
  },
  "Anacardier red rust": {
    "culture": "Anacardier",
    "Agent causal": "*Cephaleuros Virescens*, pathogenic algae",
    "description": "Disease caused by a reddish algae, affecting the leaves, branches and sometimes fruits.",
    "symptoms": "Reddish or orange spots on the leaves, sometimes powder, blackened or deformed branches.",
    "evolution": "Develops in hot and humid conditions. The algae penetrates by stomates or injuries.",
    "Name of active product material": "Copper (oxychloride, hydroxide), Mancozèbe",
    "treatment": "Pruning of affected parts, fungicidal treatments based on copper, improvement in ventilation and drainage."
  },
  "Cercospora Fache leaf (Frogeye)": {
    "culture": "Beet, eggplant, pepper, soy",
    "Agent causal": "Champignons du Genre *Cercospora *, Notmment *Bethole Cercospora *, *c. Capsici *, *c. Melongenae*",
    "description": "Fungal disease causing circular leaf spots with clear centers and dark edges, evoking a frog eye.",
    "symptoms": "Small round stains with gray or light brown center and purple to black edge. The lesions can merge, resulting in the fall in the leaves.",
    "evolution": "Favored by hot and humid conditions. Spores spread through wind, rain or tools. The fungus survives in plant debris.",
    "Name of active product material": "Azoxystrobine, chlorothalonil, mancozèbe, cuivre",
    "treatment": "Cultural rotation, elimination of debris, preventive fungicidal treatments, ground irrigation to avoid splashes."
  },
  "Choaneph horas brûlure (Wet Rot)": {
    "culture": "Zucchini, okra, bean, pepper, cucurbit",
    "Agent causal": "*Choanephora cucurbitarum*, champignon zygomycète",
    "description": "Fungal disease affecting flowers and fruits, causing wet rot and fluffy fungal development.",
    "symptoms": "Floral extremity of soft, brown fruits, covered with white then black or purple. Rotten and withered flowers.",
    "evolution": "Develops quickly in hot and humid weather. Spores propagate by insects, water or wind.",
    "Name of active product material": "No effective fungicide. Prevention by cultural practices.",
    "treatment": "Plant spacing, drip irrigation, suppression of infected fruits, cultural rotation, ventilation of plant cover."
  },
  "Colorado Potato Beetle": {
    "culture": "Potato, eggplant, tomato",
    "Agent causal": "*Leptinotarsa ​​decemlineaa*, devastating beetle",
    "description": "Very voracious defolitive insect, capable of quickly destroying the foliage of the Solanaceae.",
    "symptoms": "Rodged leaves, irregular holes, red larvae with black dots, yellow eggs under the leaves.",
    "evolution": "2–3 generations per year. Adults winter in the ground and emerge in the spring. The larvae cause the biggest damage.",
    "Name of active product material": "Spinosad, imidaclopride, azadirachtine, Bacillus thuringiensis var. tenebrionis",
    "treatment": "Manual collection, cultural rotation, mulch, targeted treatments, introduction of natural predators (bugs, birds)."
  },
  "Corn earworm Tomate fruitworm": {
    "culture": "Corn, tomato, pepper, bean, cotton",
    "Agent causal": "*Helicoverpa zea*, night lipidopter",
    "description": "Polyphage caterpillar which attacks fruit, ears and leaves, causing galleries and loss of yield.",
    "symptoms": "Holes in fruits (tomatoes), galleries in corn ears, presence of excrement (frass), rotten fruits.",
    "evolution": "3 generations per year. The larvae enter the fruits shortly after hatching. Complete cycle in 28–35 days.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (BT), pyréthrinoïdes",
    "treatment": "Monitoring with pheromone traps, preventive treatment, cultural rotation, introduction of parasitoids (*trichogrammma spp.*)."
  },
  "Cucumber mosaic geminiviruses": {
    "culture": "Cucumber, melon, tomato, pepper, lettuce, spinach",
    "Agent causal": "Cucumber mosaic virus (CMV), genre *Cucumovirus*, famille *Bromoviridae*",
    "description": "Very widespread viruses affecting more than 1,200 plant species, transmitted by aphids and contaminated tools.",
    "symptoms": "Light green/yellow mosaic on the leaves, deformation, navism, bumpy or discolored fruits.",
    "evolution": "Rapid transmission by more than 75 species of aphids. The virus persists in weeds and seeds.",
    "Name of active product material": "No antiviral. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Elimination of infected plants, fight against aphids, disinfection of tools, use of resistant varieties."
  },
  "Cutworms": {
    "culture": "Share vegetables, tomatoes, cabbage, corn, young sowing",
    "Agent causal": "Larves of Noctuelles (Out. * Agrotis ipsilon * * Agrotis Crest *)",
    "description": "Nocturnal caterpillars that cut the young stems at the base, causing the fall of the seedlings.",
    "symptoms": "Prunges cut with collar, suddenly withering, presence of larvae wrapped in C in the ground.",
    "evolution": "Active at night, several generations per year. The larvae winter in the ground and emerge in the spring.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (Bt), chlorpyrifos (usage restreint)",
    "treatment": "Protective necklaces, binage, deletion of debris, soil treatment, manual trapping, cultural rotation."
  },
  "Damping-off & root rot": {
    "culture": "Sowing vegetables, flowers, spinach, tomato, lettuce",
    "Agent causal": "Champignons du Sol: * Pythium spp. *, * Rhizoctonia Solani * * Fusarium spp. *",
    "description": "Fungal disease affecting sowing and young plants, causing the root rot and the cast iron.",
    "symptoms": "Ramollia stems at the base, plants that are busy, brown or rotten roots, growth stopped.",
    "evolution": "Appears in cold and humid soil. Spores persist in the ground and spread through water or tools.",
    "Name of active product material": "Méfénoxame, Copper, Trichoderma spp. (Biocontrol)",
    "treatment": "Use a sterile substrate, avoid excess water, sow good density, treat preventively with fungicides or biostimulants."
  },
  "Early Brupure": {
    "culture": "Tomato, potato",
    "Agent causal": "*Alternaria Solani*, Champignon Défoliat",
    "description": "Fungal disease causing concentric spots on the leaves, stems and fruits, reducing yield.",
    "symptoms": "Brown with black stains with concentric circles, yellowing, falling leaves, lesions on stems and fruits.",
    "evolution": "Favored by humidity and moderate temperatures. Spreads by splashes and infected debris.",
    "Name of active product material": "Chlorothalonil, mancozèbe, azoxystrobine, cuivre",
    "treatment": "Cultural rotation, elimination of debris, preventive fungicidal treatments, spacing of ventilation plants."
  },
  "False chinch bug": {
    "culture": "Cabbage, mustard, radish, lettuce, sunflower",
    "Agent causal": "* Nysius Radish, insects hémiptère",
    "description": "Small sap sucking insect that moves en masse, causing willing and water stress.",
    "symptoms": "Wanned, discolored leaves, slowed growth, presence of small gray-brown insects in groups.",
    "evolution": "Develops on wild crucifers. Massive migration to crops during the drying up of weeds.",
    "Name of active product material": "Pyrethrinoids, spinosad (variable efficiency)",
    "treatment": "Eliminate host weeds, regular irrigation, physical barriers, treatment in the event of a massive invasion."
  },
  "Flea beetles": {
    "culture": "Cabbage, radish, tomato, eggplant, beet",
    "Agent causal": "Coléoptères of the genre *Phyllotreta *, *Epitrix SPP. *",
    "description": "Small co -sealing beetles that puncture the leaves, causing significant damage to young plants.",
    "symptoms": "Round holes (shotoles) in the leaves, slowed growth, deformed or withered leaves.",
    "evolution": "Active from 10 ° C. Adults winter in debris. Several generations per year.",
    "Name of active product material": "Spinosad, pyréthrinades, messed, meat, song",
    "treatment": "Anti-insect nets, mulching, cultural rotation, targeted treatments at the start of infestation."
  },
  "Fusarium crownroot rot": {
    "culture": "Tomato, pepper, eggplant",
    "Agent causal": "* Fusarium oxysporum * f. sp. * root-tomato *",
    "description": "Fungal -fungal disease causing root and collar rot, withering and death of the plants.",
    "symptoms": "Yellowing of low leaves, wilting, brown lesions with collar, rotten roots.",
    "evolution": "Favored by fresh and humid soil. The fungus persists in the soil and plant debris.",
    "Name of active product material": "No curative treatment. Prevention: grafting, trichoderma spp.",
    "treatment": "Use resistant varieties (for), grafting, cultural rotation, improvement in drainage."
  },
  "Fusarium wilt": {
    "culture": "Tomato, melon, banana, pea, cotton",
    "Agent causal": "* Fusarium oxysporum* f. SP. specific to the host",
    "description": "Vascular fungus blocking the circulation of water, causing the plants of plants and death.",
    "symptoms": "Unilateral wilt, yellowing, vascular browning, progressive death of the plant.",
    "evolution": "Persists for a long time in the ground. Propagates by contaminated roots, tools or seeds.",
    "Name of active product material": "No curative fungicide. Prevention only.",
    "treatment": "Use resistant varieties (F1, F2 codes, etc.), long cultural rotation, tool disinfection, grafting."
  },
  "Gray Facing Leaf": {
    "culture": "Tomato, eggplant, pepper",
    "Agent causal": "* Stemphhipology SPP. * OU * SPP CERCOSS. * Selon la Culture",
    "description": "Fungal disease causing gray to brown spots on the leaves, reducing photosynthesis.",
    "symptoms": "Round spots at grayish center, dark edge, sometimes with spores on the surface. Premature fall of the leaves.",
    "evolution": "Favored by high humidity and moderate temperatures. Spreads by splashes and wind.",
    "Name of active product material": "Chlorothalonil, mancozèbe, cuivre, azoxystrobine",
    "treatment": "Elimination of infected leaves, preventive fungicidal treatments, plant spacing, ground irrigation."
  },
  "Hornworms": {
    "culture": "Tomato, pepper, eggplant, potato",
    "Agent causal": "* Manduca Quinquemaculata* (see of the tomato),* Manduca sixta* (see du tabac)",
    "description": "Large green caterpillars, very voracious, which consume the leaves, stems and sometimes the fruits of the solanaceae.",
    "symptoms": "Devoured leaves, cut stems, visible dark excrement, perforated fruits, presence of large green caterpillars with a posterior horn.",
    "evolution": "Quick cycle in summer. Adults are nocturnal sphinxes. The larvae cause the majority of damage.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (BT), pyréthrinoïdes",
    "treatment": "Manual pickup, biological treatment with BT or spinosad, introduction of parasitoids (*COTESIA CONGREGATA*), cultural rotation."
  },
  "Late burn": {
    "culture": "Tomato, potato",
    "Agent causal": "*Phytophthora infestans*, pathogen",
    "description": "Devastating disease causing dark lesions on leaves, stems and fruit, causing the rapid rot of the tissues.",
    "symptoms": "Dark brown spots with fuzzy edges on leaves, blackened stems, brown and soft fruits, smell of rot.",
    "evolution": "Spreads quickly in fresh and humid weather. Spores move through wind and water.",
    "Name of active product material": "Cymoxanil, Mancozèbe, Fluopicolide, Copper",
    "treatment": "Elimination of infected plants, preventive fungicidal treatments, plant spacing, long cultural rotation."
  },
  "Beetle leaf corn": {
    "culture": "But",
    "Agent causal": "* Orulema Melanopus * (Chrysomel Du Maïs), * Chickwaem chick *",
    "description": "Beetles that gnaw at corn leaves, reducing the photosynthetic surface and weakening the plants.",
    "symptoms": "Linear holes or in strips on the leaves, grilled appearance, slowed growth, presence of brilliant insects.",
    "evolution": "Adults winter in debris. The larvae feed on the foliar parenchyma. Several generations per year.",
    "Name of active product material": "Lambda-cyhalothrine, deltaméthrine, spinosad",
    "treatment": "Monitoring, treatment at the start of infestation, cultural rotation, destruction of culture residues."
  },
  "Leaf burn corn": {
    "culture": "But",
    "Agent causal": "* Exserohilum Turkish * (Brulure du Nord), * Bipolaris Maydis * (Brülure du Sud)",
    "description": "Fungal diseases causing elongated lesions on the leaves, reducing photosynthesis and yield.",
    "symptoms": "Cigarettes (north) or oblong (south), brownish, sometimes bordered with yellow, progression up of the plant.",
    "evolution": "Favored by high humidity and moderate temperatures. Spores persist in residues.",
    "Name of active product material": "Azoxystrobine, propiconazole, mancozèbe",
    "treatment": "Cultural rotation, resistant varieties, preventive fungicidal treatments, burial of residues."
  },
  "Corn Tax leaf": {
    "culture": "But",
    "Agent causal": "*Cercospora zeae-maydis*, *Helminthosporium maydis*",
    "description": "Fungal diseases causing brown or black spots on the leaves, reducing photosynthetic capacity.",
    "symptoms": "Oval or elongated spots, sometimes with yellow halo, fusion of lesions in case of severe infection.",
    "evolution": "Spreads by splashes and wind. Favored by humidity and moderate temperatures.",
    "Name of active product material": "Pyraclostrobine, mancozèbe, tébuconazole",
    "treatment": "Cultural rotation, tolerant varieties, fungicidal treatments, burial of residues."
  },
  "Maïs streak virus": {
    "culture": "But",
    "Agent causal": "Maize streak virus (MSV), genre *Mastrevirus*, famille *Geminiviridae*",
    "description": "Viruses transmitted by the leaflets, causing chlorotic streaks on the leaves and severe navism.",
    "symptoms": "Yellow streaks parallel to the ribs, distorted leaves, slowed growth, absent or poorly trained ears.",
    "evolution": "Transmitted by *Cicadulina Mbila *. The virus persists in the insect. Early infection = severe losses.",
    "Name of active product material": "No antiviral. Vector control only.",
    "treatment": "Use resistant varieties (e.g. MH26, SC403), eliminate host weeds, early sowing, fighting cicadelles."
  },
  "Pepper mottle pepper": {
    "culture": "Poivron (capsicum spp.)",
    "Agent causal": "Pepper Mottle Virus (Pepmov), Genre * Potyvirus *, Family * Potyviridae *",
    "description": "Virus transmitted by aphids, causing mosaics, deformations and yield losses on peppers.",
    "symptoms": "Light green/yellow mosaic, deformed leaves, slowed growth, bumpy or striated fruits, falling flowers.",
    "evolution": "Non -persistent transmission by aphids. More severe infection if it occurs early. Can co-infect with other viruses.",
    "Name of active product material": "No antiviral. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Use resistant varieties, eliminate infected plants, disinfect tools, control aphids."
  },
  "Phomopsis burn": {
    "culture": "Juniperus sp. Vines in Aubergine, Poivron",
    "Agent causal": "* Phomopsis spp. * (Out. * Phomopsis vexans *, * Phomopsis viticola)",
    "description": "Mushroom causing burns of shoots, channies and leaf spots, especially on young fabrics.",
    "symptoms": "Getting young shoots, brown spots on leaves, cannons on stems, fruit deformation.",
    "evolution": "Infection favored by humidity and injuries. Spores winter in dead fabrics.",
    "Name of active product material": "Mancozèbe, Thiophanate-Methyl, Copper",
    "treatment": "Pruning of affected parts, disinfection of tools, preventive fungicide treatments, avoid injury."
  },
  "Phytoptora root, stem, and crown rots": {
    "culture": "Pepper, tomato, eggplant, cucurbit, ornamental",
    "Agent causal": "* Phytophthora spp. * (Out. * P. Capsici *, * p. Nicotianae *)",
    "description": "Oomycetes causing root, collar and stems, causing withered and death of plants.",
    "symptoms": "Getting, yellowing, brunette rot with collar, soft roots, blackened stems.",
    "evolution": "Favored by excess water and poorly drained soil. Spores propagate by water, soil or tools.",
    "Name of active product material": "Méfénoxame, phosphonates, copper",
    "treatment": "Improve drainage, avoid excess water, preventive treatments, long cultural rotation."
  },
  "Leaf Theopper potato": {
    "culture": "Potato, bean, luzerne",
    "Agent causal": "* Empoasca bean *, Cicadelle verte",
    "description": "Insect sap sucking causing foliar burns and sometimes transmitting phytoplasms.",
    "symptoms": "Marginal yellowing, winding of leaves, slowed growth, burned appearance (hopperburn).",
    "evolution": "Multiple generations per year. Frequent migration. More severe damage in hot and dry weather.",
    "Name of active product material": "Spinosad, pyrethrinoids, acetamipride",
    "treatment": "Monitoring, anti-insect nets, targeted treatments, elimination of host weeds."
  },
  "Y tobacacco andch potato": {
    "culture": "Potato, pepper, tobacco",
    "Agent causal": "*The desire of virus y* (Pvy) et *Tobacco etch virus* (tev), genre *potyvirus**",
    "description": "Virus transmitted by aphids, causing mosaics, necrosis and deformations on leaves and tubers.",
    "symptoms": "Mosaic, necrosis, streaks on leaves, naism, deformed or necrotic tubers.",
    "evolution": "Rapid transmission by aphids. Early infection = severe losses. Frequent co-infections.",
    "Name of active product material": "No antiviral. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Use resistant varieties, eliminate infected plants, disinfect tools, fight aphids."
  },
  "Powdery mildew on vegetables": {
    "culture": "Zucchini, cucumber, tomato, pea, bean, lettuce",
    "Agent causal": "* Erysiphe spp. * * Podosphaera spp. * * * Leveillula taurica *",
    "description": "Mushrooms causing white felting on the leaves, reducing photosynthesis and yield.",
    "symptoms": "White stains powder on leaves, yellowing, drying, premature fall.",
    "evolution": "Develops in hot and dry weather with high ambient humidity. Propagates by the wind.",
    "Name of active product material": "Soufre, bicarbonate de potassium, myclobutanil, neem",
    "treatment": "Eliminate the affected leaves, preventive treatments, plant spacing, resistant varieties."
  },
  "Root-knot nematodes": {
    "culture": "Tomato, carrot, melon, eggplant, lettuce",
    "Agent causal": "* Meloidogyne spp. * (Out. * 1000. Unknown *, * m. *)",
    "description": "Microscopic nematodes causing galls on the roots, reducing the absorption of water and nutrients.",
    "symptoms": "Wales on the roots, wilting, yellowing, slowed growth, reduced yield.",
    "evolution": "Multiple cycles per year in hot climate. Eggs persist in the ground for several years.",
    "Name of active product material": "Biological nematicides (eg *paecilomyces Lilacinus *), Azadirachtine",
    "treatment": "Cultural rotation, solarization, resistant varieties, organic amendments, biocontrol."
  },
  "Thrips": {
    "culture": "Onion, pepper, tomato, strawberry, ornamental",
    "Agent causal": "*Frankliniella occidentalis*, *Thrips tabaci*, *Scirtothrips dorsalis*",
    "description": "Small sucking insects causing discoloration, deformations and transmitting viruses (eg TSWV).",
    "symptoms": "Sleeping of leaves, black spots (excrement), deformed fruits, slowed growth.",
    "evolution": "Multiple generations per year. Develop quickly in a greenhouse or in hot and dry weather.",
    "Name of active product material": "Spinosad, abamectine, azadirachtine, savon insecticide",
    "treatment": "Blue traps, anti-insect nets, targeted treatments, introduction of predators (eg *Orius spp. *)."
  },
  "Tobacco mosaic virus & Tomate mosaic virus": {
    "culture": "Tobacco, tomato, pepper, eggplant, ornamental",
    "Agent causal": "Tobacco mosaic virus (TMV) et Tomato mosaic virus (ToMV), genre *Tobamovirus*",
    "description": "Very stable viruses transmitted mechanically, causing mosaics, deformations and loss of yield.",
    "symptoms": "Light/dark green mosaic, deformed or fern -shaped leaves, slowed growth, necrotic or striated fruits.",
    "evolution": "Seed transmission, tools, hands, tobacco. Very persistent in plant debris (several years).",
    "Name of active product material": "No antiviral. Disinfection: skim milk, soap, iodized solutions.",
    "treatment": "Use healthy seeds, disinfect tools, avoid tobacco, eliminate infected plants, resistant varieties."
  },
  "Tobamoviruses": {
    "culture": "Tomato, pepper, tobacco, ornamental",
    "Agent causal": "Genre *Tobamovirus* (ex. TMV, ToMV, PMMoV, ToBRFV)",
    "description": "Very stable family of virus affecting many cultures, transmitted by contact and seeds.",
    "symptoms": "Mosaic, deformations, necrosis, striated or bumpy fruits, naism, chlorosis of the ribs.",
    "evolution": "Mechanical transmission. Very persistent on tools, clothes, seeds. No known insect vector.",
    "Name of active product material": "No antiviral. Disinfection: skim milk, soap, chlorinated solutions.",
    "treatment": "Strict hygiene, certified seeds, resistant varieties, elimination of infected plants, cultural rotation."
  },
  "Tomate russet mite": {
    "culture": "Tomato",
    "Agent causal": "*Aculops Lycopersici*, microscopic mite",
    "description": "Acvisible mite to the naked eye, causing browning of the stems and leaves, and a general weakening.",
    "symptoms": "Craft leaves, bronze or rusty appearance, brown stems, deformed or rough fruits, falling leaves.",
    "evolution": "Develops in hot and dry weather. Infestation often detected late. Spreads from bottom to top.",
    "Name of active product material": "Sulfur, abamectine, horticultural oils",
    "treatment": "Early monitoring, localized treatment, sulfur spray (avoid> 30 ° C), elimination of plants strongly affected."
  },
  "Tomate tacheted wilt virus": {
    "culture": "Tomato, pepper, lettuce, peanut, ornamental",
    "Agent causal": "Tomato spotted wilt virus (TSWV), genre *Orthotospovirus*",
    "description": "Viruses transmitted by thrips, causing willing, annular spots and fruit deformations.",
    "symptoms": "Bronzed leaves, withered, yellow or brown annular stains, deformed or necrotic fruits, slowed growth.",
    "evolution": "Transmitted by Thrips (eg *Frankliniella Westernalis *). Early infection = severe losses. No semen transmission.",
    "Name of active product material": "No antiviral. Verctors control: spinosad, insecticide soap.",
    "treatment": "Eliminate infected plants, control thrips, use resistant varieties (TSWV), anti-insect nets, weeding."
  },
  "Tospoviruses blossom-end rot chemical damage": {
    "culture": "Tomato, pepper, eggplant",
    "Agent causal": "Physiological imbalance (calcium deficiency) or chemical damage (excess fertilizer or phytotoxicity)",
    "description": "Non -pathogenic disturbance caused by water or nutritional stress, often confused with viral symptoms.",
    "symptoms": "Brown spots at the end of the fruits (Blossom-End Rot), leaf burns, deformations, localized necrosis.",
    "evolution": "Favored by irregular watering, excess of nitrogen, inappropriate pH, or excessive application of chemicals.",
    "Name of active product material": "Calcium (calcium nitrate, chelates), pH correctors",
    "treatment": "Regular watering, balanced fertilization, leaf calcium spraying, avoid excess chemicals."
  },
  "Two-tacheted spider mite": {
    "culture": "Tomato, eggplant, bean, strawberry, ornamental",
    "Agent causal": "* Distribution nettle *, Acarien tétranyque",
    "description": "Very polyphagous devastating mite, causing discoloring, canvases and weakening of plants.",
    "symptoms": "Stippling (white points), yellow then brown leaves, fine fabrics, falling leaves, slowed growth.",
    "evolution": "Develops quickly in hot and dry weather. Several generations per year. Infestation often at the base of plants.",
    "Name of active product material": "Abamectine, spirototetramatis, horticultural oils, insecticide soap",
    "treatment": "Targeted spraying, introduction of predators (*phytoseiulus persimilis*), avoid water stress, regular monitoring."
  },
  "Western striped and tacheted cucumber beetle": {
    "culture": "Cucumber, melon, squash, watermelon, corn",
    "Agent causal": "*Acalymma trivtattatum* (slashed), *Baboter undecided* (stained)",
    "description": "Cecurbit pests pests, managers of direct damage and disease vectors such as bacterial wilt.",
    "symptoms": "Perforated leaves, healed fruits, slowed growth, wilting. Presence of striped or spotted insects.",
    "evolution": "Adults emerge in the spring, lay at the foot of the plants. The larvae attack roots, adults the leaves and fruits.",
    "Name of active product material": "Kaolin, spinosad, pyréthrinoïdes, carbaryl",
    "treatment": "Reflective mulch, nets, yellow traps, targeted treatments at the start of infestation, cultural rotation."
  },
  "WhiteFlies": {
    "culture": "Tomato, pepper, eggplant, bean, ornamental",
    "Agent causal": "* Bemisia tabaci * Trialeurodes vaporariors *",
    "description": "Small winged insects sucks of sap, causing weakening of plants and transmission of viruses.",
    "symptoms": "Yellowed, sticky leaves (honeydew), black fumagine, slowed growth, theft of white insects at the slightest movement.",
    "evolution": "Multiple generations per year. Develop quickly in a greenhouse or in hot and dry weather.",
    "Name of active product material": "Insecticide, neem, spinosad, horticultural oils",
    "treatment": "Yellow traps, foliar spraying, introduction of parasitoids (*Encoursia Formosa*), avoid excess of nitrogen."
  },
  "Yellow Mosaic Potato X": {
    "culture": "Potato, tomato, pepper",
    "Agent causal": "*Pavy wants, *Porta virus X* (PVX), genre *Potyvirus**",
    "description": "Virus causing mosaics, navism and deformations, transmitted by aphids or contaminated equipment.",
    "symptoms": "Yellow mosaic, blistered or tense leaves, slowed growth, deformed or necrotic tubers.",
    "evolution": "Non -persistent transmission by aphids. Frequent co-infections with PVX or TEV worsening symptoms.",
    "Name of active product material": "No antiviral. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Use certified seeds, eliminate infected plants, disinfect tools, control aphids."
  },
  "Anthracnose": {
    "culture": "Bean, tomato, cucumber, mango, papaya, citrus",
    "Agent causal": "* Colletotrichum spp. * (Ex. * C. Lindemuthianum * c. Gloeosporioides *)",
    "description": "Mushroom causing dark spots on leaves, stems and fruits, often with post-harvest rot.",
    "symptoms": "Brown or black spots, pressed, sometimes with pink masses of spores. Rotting or deformed fruits.",
    "evolution": "Spreads by splashes, tools, seeds. Favored by high humidity and heat.",
    "Name of active product material": "Mancozèbe, Thiophanate-Methyl, Copper, Azoxystrobin",
    "treatment": "Cultural rotation, healthy seeds, preventive fungicidal treatments, elimination of infected debris."
  },
  "Apple Apple scab": {
    "culture": "Apple",
    "Agent causal": "* Venturia unequal *, Champignon Ascomycète",
    "description": "Fungal disease causing black spots on leaves and fruits, reducing commercial quality.",
    "symptoms": "Velvet stains brown-olive on leaves, deformed or cracked fruits, premature fall of the leaves.",
    "evolution": "Spores released in the spring from the dead leaves. Infections favored by prolonged humidity.",
    "Name of active product material": "Captane, dodine, difénoconazole, copper",
    "treatment": "Picking up dead leaves, fungicidal treatments with debt, resistant varieties (eg ‘Liberty’)."
  },
  "Pomme black rot": {
    "culture": "Apple",
    "Agent causal": "* Botryosphaeria blunt * (syn. * Physalospora blunt)",
    "description": "Mushroom causing black rot of fruits, channies on branches and leaf stains.",
    "symptoms": "Brown circular spots on fruits (beef eye), channies on branches, tied leaves in V.",
    "evolution": "Winter in chancres and mummified fruits. Spreads by rain and wind in the spring.",
    "Name of active product material": "Captane, thiophanate-methyl, copper",
    "treatment": "Pruning of affected branches, elimination of mummified fruits, preventive fungicidal treatments."
  },
  "Apple Cedar Apple Rust": {
    "culture": "Apple tree, juniper (alternating cycle)",
    "Agent causal": "*Gymnosporangium juniperi-virginianae*, champignon rouille",
    "description": "Heteroic rust requiring apple and juniper. Causes orange spots and deformations.",
    "symptoms": "Vive orange spots on leaves, protuberances on the underside, deformed or striated fruits.",
    "evolution": "Spores released from Wales on juniper in the spring. Pommers' infection during wet period.",
    "Name of active product material": "Myclobutanil, propiconazole, cuivre",
    "treatment": "East the juniper, fungicidal treatments at the pink stadium, resistant varieties (eg ‘Liberty’)."
  },
  "Healthy apple": {
    "culture": "Apple",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous tree, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Dark green foliage, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Bacterial burn": {
    "culture": "Pear tree, apple, rosaceae",
    "Agent causal": "*Erwinia amylovora*, Gram-negative bacteria",
    "description": "Very contagious bacterial disease affecting the fruit trees with seeds, causing a rapid willing of young shoots.",
    "symptoms": "Drunk leaves, curled up, burned appearance, bacterial oozing on branches, channies on branches.",
    "evolution": "Rapid propagation by rain, insects and tools. Favored in hot and humid weather in the spring.",
    "Name of active product material": "Copper (oxychloride, hydroxide), kasugamycin (in some countries)",
    "treatment": "Severe pruning in dry periods, tool disinfection, preventive copper treatments, surveillance in spring."
  },
  "Healthy blueberry": {
    "culture": "Myrtille (Vaccinium spp.)",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous shrub, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Dark green foliage, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Brown tache": {
    "culture": "Apple tree, pear, citrus, vegetables",
    "Agent causal": "Divers champignons (ex. *Alternaria spp.*, *Phyllosticta spp.*, *Cladosporium spp.*)",
    "description": "Brown spots on leaves or fruits caused by opportunistic mushrooms, often in wet conditions.",
    "symptoms": "Circular or irregular spots, dark brown with black, sometimes with yellow halo, lesions on fruits or leaves.",
    "evolution": "Favored by high humidity, injuries, water stress or deficiencies. Can evolve towards the fall of leaves or rot.",
    "Name of active product material": "Mancozèbe, Copper, Thiophanate-Methyl",
    "treatment": "Elimination of affected leaves, preventive fungicide treatments, improvement of ventilation and drainage."
  },
  "Healthy cherry": {
    "culture": "Cherry",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous tree, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Brilliant green foliage, abundant flowering, healthy fruits, absence of cannons or spots.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Cerisier powdery mildew": {
    "culture": "Cherry, plum, fishing",
    "Agent causal": "*Podosphaera clandestina*, champignon ascomycète",
    "description": "Fungal disease causing white felting on young leaves, flowers and fruits, reducing photosynthesis.",
    "symptoms": "White stains powder on leaves, winding, drying, deformed or cracked fruits.",
    "evolution": "Favored in hot and dry weather with high ambient humidity. Propagates by the wind.",
    "Name of active product material": "Sulfur, myclobutanil, trifloxystrobin",
    "treatment": "Elimination of affected parts, preventive fungicidal treatments, trees spacing, resistant varieties."
  },
  "Corn (corn) Cercle leaf spot gray leaf": {
    "culture": "But",
    "Agent causal": "*Cercle Zeae-Maydis*, foliar mushroom",
    "description": "Fungal disease causing gray rectangular lesions on the leaves, reducing photosynthesis.",
    "symptoms": "Lying stains, gray to brown, delimited by ribs, possible fusion in case of severe infection.",
    "evolution": "Favored by high humidity and moderate temperatures. Spreads by splashes and wind.",
    "Name of active product material": "Azoxystrobine, propiconazole, pyraclostrobine",
    "treatment": "Cultural rotation, resistant varieties, preventive fungicidal treatments, burial of residues."
  },
  "Common rust": {
    "culture": "But",
    "Agent causal": "*Puccinia sorghum*, mushroom rust",
    "description": "Fungal disease causing brown-red pustula on the leaves, reducing the photosynthetic surface.",
    "symptoms": "Red-brown oval pustules on both sides of the leaves, chlorosis around, drying possible.",
    "evolution": "Spreads by the wind from the hot regions. Favored by high humidity and moderate temperatures.",
    "Name of active product material": "Propiconazole, azoxystrobine, mancozèbe",
    "treatment": "Use resistant hybrids, fungicidal treatments if early appearance, cultural rotation."
  },
  "Corn (Corn) in good": {
    "culture": "But",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green leaves, rapid growth, flowering and filling of normal grains, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Balanced fertilization, controlled irrigation, cultural rotation, preventive phytosanitary surveillance."
  },
  "Corn (Corn) Northern Leaf Burn": {
    "culture": "But",
    "Agent causal": "* Exserohilum Turkish * Champignon Foliaire",
    "description": "Fungal disease causing cigar -shaped lesions on the leaves, reducing photosynthesis.",
    "symptoms": "Lying stains, gray-brown, bordered with green or yellow, progression up of the plant.",
    "evolution": "Favored by prolonged humidity (> 6h) and moderate temperatures (18–27 ° C). Spreads by air spores.",
    "Name of active product material": "Azoxystrobine, propiconazole, pyraclostrobine",
    "treatment": "Use resistant varieties, cultural rotation, preventive fungicide treatments, burial of residues."
  },
  "Fall armyworm": {
    "culture": "Corn, sorghum, rice, cotton, leafy vegetables",
    "Agent causal": "*SPODOPTERA frugiperda*, nocturnal lepidopter",
    "description": "Very mobile and voracious caterpillar, capable of quickly destroying crops by moving en masse.",
    "symptoms": "Irregular holes in the leaves, galleries in the ears, dark droppings, wilting, presence of caterpillars in groups.",
    "evolution": "Quick cycle (30–40 days). The larvae cause 80 % of the damage. Several generations per year. Active migration of adults.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (Bt), chlorantraniliprole, emamectine benzoate",
    "treatment": "Monitoring with pheromone traps, early treatment, cultural rotation, introduction of parasitoids (*trichogrammma spp.*), Management of residues."
  },
  "Raisin black rot": {
    "culture": "Vine (table and tank grapes)",
    "Agent causal": "* Guuvardy Bidwellii *, Champignon asccomycete",
    "description": "Fungal disease causing lesions on leaves, branches and fruit, causing their rot and mummification.",
    "symptoms": "Circular brown spots on leaves, black lesions on branches, rotten fruits and drying out in 'mummies'.",
    "evolution": "The fungus winters in mummified fruits and branches. Spores released in the spring by rain. Quick infection in hot and humid conditions.",
    "Name of active product material": "Captane, myclobutanil, mancozèbe, trifloxystrobine",
    "treatment": "Elimination of mummified fruits, size of the reached branches, fungicidal treatments between deburring and post-flora, tolerant varieties."
  },
  "Raisin esca (black measles)": {
    "culture": "Vine",
    "Agent causal": "Complexe Fongique: * Phaeomoniella chlamydospora *, * Phaeoacremonium aleophilum * * Fomitiporia Mediterranea *",
    "description": "Chronic wood disease causing foliar streaks, drying up, rotting berries and slow deaths of the vines.",
    "symptoms": "STRIES YELLOW OR RATERS, DRAWING OF THE SHEETS, dark spots on bays, necrotic wood in transverse cut.",
    "evolution": "Infection by size wounds. Symptoms visible after several years. Irregular appearance according to the climate.",
    "Name of active product material": "No curative treatment. Prevention only.",
    "treatment": "Double or late size, tool disinfection, elimination of reached vines, application of Trichoderma SPP. on size wounds."
  },
  "Healthy grapes": {
    "culture": "Vine",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous vine foot, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green foliage, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Grape leaf burn (isariopsis sheet spot)": {
    "culture": "Vine",
    "Agent causal": "* Isariopsis Clavispora *",
    "description": "Mushroom causing dark brown angular spots on the leaves, reducing the photosynthetic surface.",
    "symptoms": "Dark brown angular spots with black, often delimited by ribs, sometimes with gray sporulation on the reverse.",
    "evolution": "Favored by high humidity and moderate temperatures. Spreads by splashes and wind.",
    "Name of active product material": "Copper, Mancozèbe, Captane",
    "treatment": "Elimination of affected leaves, preventive fungicidal treatments, ventilation of plant cover, weeding under the row."
  },
  "Grasshoper": {
    "culture": "Cereals, vegetables, legumes, pastures",
    "Agent causal": "Othoptthres of Genre * Locust *, * OEDALUUS *, * Schistoccer *",
    "description": "Phytophagous jumper insects that consume leaves, stems and sometimes fruits, causing massive defoliations.",
    "symptoms": "Roded leaves, cut stems, slowed growth, presence of adult or nymphs.",
    "evolution": "Multiple generations per year. Migration possible over long distances. Prumps favored by drought followed by rain.",
    "Name of active product material": "Deltaméthrine, diflubenzuron, neem",
    "treatment": "Monitoring, targeted treatment at the start of infestation, physical barriers, introduction of natural predators (birds, reptiles)."
  },
  "Green mite": {
    "culture": "Cassava, tomato, bean, ornamental",
    "Agent causal": "*Mononychellus Tanajoa*, Phytophagous mite",
    "description": "A mite sucking sap causing yellow spots, a wilting and a reduction in photosynthesis.",
    "symptoms": "Yellow spots on leaves, deformation, premature fall, slowed growth, 'candlestick' appearance on terminal shoots.",
    "evolution": "Quick multiplication in the dry season. Spreads by the wind, the tools or the cuttings infested.",
    "Name of active product material": "Abamectine, horticultural oils, neem",
    "treatment": "Introduction of predatory mites (*typhlodromalus aripipo*), targeted spraying, cultural rotation, elimination of residues."
  },
  "Gum": {
    "culture": "Fish, apricot tree, cherry, plum",
    "Agent causal": "*Leucostoma SPP.*,*Cytospora spp.*, Physiological stress or injuries",
    "description": "Slow of amber gum on the trunk or branches, often linked to fungal infections or abiotic stresses.",
    "symptoms": "Slots in bark, eighty of gum, channies, general weakening, descendant of the branches.",
    "evolution": "Favored by injuries, excessive humidity, frost, insect attacks. The fungus penetrates through the wounds.",
    "Name of active product material": "Copper, phosphonates (preventive)",
    "treatment": "Elimination of necrotic tissues, tool disinfection, drainage improvement, preventive copper treatments, avoid injury."
  },
  "Feuille beetle": {
    "culture": "Bean, soy, potato, beet",
    "Agent causal": "Coléoptères of the genre *Cerotoma *, *Galerucella *, *Altica *",
    "description": "Phytophagous insects that gnaw at the leaves, causing partial holes or defoliations.",
    "symptoms": "Circular or irregular holes in the leaves, sometimes foliar skeleton, slowed growth.",
    "evolution": "Active in spring and summer. Adults lay on the leaves, the larvae also feed on the foliage.",
    "Name of active product material": "Spinosad, Pyréthrinoids, take",
    "treatment": "Surveillance, manual collection, anti-insect nets, targeted treatments at the start of infestation."
  },
  "Burn leaf": {
    "culture": "Tomato, potato, strawberry, ornamental",
    "Agent causal": "Water stress, calcium deficiency, excess fertilizer or fungal diseases (eg *Alternaria *, *Septoria *)",
    "description": "Symptom of stress or illness, characterized by drying out of the edges or the end of the leaves.",
    "symptoms": "Edges of brown or necrotic leaves, rolled up or dressed leaves, slowed growth.",
    "evolution": "Appears in the event of water imbalance, chemical burns or fungal infection. Can evolve towards the fall of the leaves.",
    "Name of active product material": "According to the cause: calcium, copper, mancozèbe, irrigation adjustment",
    "treatment": "Correct watering, adjust fertilization, apply an identified pathogenic fungicide, remove the affected sheets."
  },
  "Feuille curl": {
    "culture": "Tomato, chili, cotton, tobacco",
    "Agent causal": "Begomovirus (Ex. Tomato leaf curl virus), transmit the parses to read alleurodes (*Tace Bemici*)",
    "description": "Viral disease causing the winding of leaves, navism and the reduction in yield.",
    "symptoms": "Leaves wrapped up or bottom, thickened, chlorosis, slowed growth, deformed or absent fruits.",
    "evolution": "Transmitted by the Aleurodes. Early infection = severe losses. The virus persists in host plants and vectors.",
    "Name of active product material": "No antiviral. Vector control: spinosad, pyrethrinoids, horticultural oils",
    "treatment": "Use resistant varieties, eliminate infected plants, anti-insect nets, fight against the aleurodes."
  },
  "Wing": {
    "culture": "Tomato, bean, spinach, beet, ornamental",
    "Agent causal": "Larves of miner flies (*Liriomyza SPP.*,*Phytomyza spp.*)",
    "description": "Larves that dig galleries in the leaves, reducing photosynthesis and weakening the plant.",
    "symptoms": "Abbed streaks or clear spots in the leaves, distorted or withered leaves, presence of larvae in the mines.",
    "evolution": "Quick cycle. Adults lay in the leaves, the larvae dig internal galleries.",
    "Name of active product material": "Spinosad, abamectine, neem",
    "treatment": "Elimination of affected leaves, introduction of parasitoids (*Diglyphus Isaaa*), targeted treatments."
  },
  "Stain leaf": {
    "culture": "Tomato, pepper, lettuce, bean, ornamental",
    "Agent causal": "Mushrooms (*Alternaria*,*Septoria*,*Cercle*) or bacteria (*xanthomonas*,*pseudomonas*)",
    "description": "Leaf spots caused by pathogens, reducing the photosynthetic surface and promoting the fall of the leaves.",
    "symptoms": "Brown, black or yellow spots, sometimes with halo, fusion of lesions, premature fall of the leaves.",
    "evolution": "Favored by high humidity. Spreads by splashes, tools or contaminated seeds.",
    "Name of active product material": "Copper, Mancozèbe, Chlorothalonil, Thiophanate-Methyl",
    "treatment": "Elimination of affected leaves, fungicide or bactericidal treatments, plant spacing, cultural rotation."
  },
  "Maïs fall armyworm": {
    "culture": "Corn, sorghum, rice, cotton",
    "Agent causal": "*SPODOPTERA frugiperda*, nocturnal lepidopter",
    "description": "Very mobile and voracious caterpillar, capable of quickly destroying crops by moving en masse.",
    "symptoms": "Irregular holes in the leaves, galleries in the ears, dark droppings, wilting, presence of caterpillars in groups.",
    "evolution": "Quick cycle (30–40 days). Several generations per year. Active migration of adults.",
    "Name of active product material": "Spinosad, Bacillus thuringiensis (Bt), chlorantraniliprole",
    "treatment": "Monitoring with pheromone traps, early treatment, cultural rotation, introduction of parasitoids (*trichogrammma spp.*)."
  },
  "Grasshoper corn": {
    "culture": "Corn, sorghum, rice, vegetables",
    "Agent causal": "Orthoptthres: * hieroglyphus spp. *, * Oxya spp. *, * Migratory locust *",
    "description": "Phytophagous jumper insects that consume the leaves, stems and sometimes ears, causing massive defoliations.",
    "symptoms": "Roded leaves, cut stems, slowed growth, presence of adult or nymphs.",
    "evolution": "Multiple generations per year. Prumps favored by drought followed by rain. Migration possible.",
    "Name of active product material": "Deltaméthrine, diflubenzuron, neem",
    "treatment": "Monitoring, targeted treatment at the start of infestation, physical barriers, introduction of natural predators (birds, reptiles)."
  },
  "Healthy corn": {
    "culture": "But",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green leaves, rapid growth, flowering and filling of normal grains, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Balanced fertilization, controlled irrigation, cultural rotation, preventive phytosanitary surveillance."
  },
  "Mosaic": {
    "culture": "Tomato, cucumber, bean, lettuce, pepper, melon",
    "Agent causal": "Divers virus du genre *Potyvirus*, *Cucumovirus*, *Begomovirus*",
    "description": "Viral disease causing color mosaics on the leaves, deformations and a reduction in yield.",
    "symptoms": "Light green/yellow mosaic, deformed or tense leaves, naism, striated or bumpy fruits.",
    "evolution": "Transmitted by infected aphids, suits or seeds. Early infection = severe losses.",
    "Name of active product material": "No antiviral. Verctors control: Pyrethrinoids, Horticultural oils.",
    "treatment": "Eliminate infected plants, use resistant varieties, disinfect tools, control vectors."
  },
  "Oranger haunglongbing (citrus greening)": {
    "culture": "Citrus (orange tree, lemon tree, mandarinier)",
    "Agent causal": "* Candidate Liberibacter asiaticns * Bactérie transmission par * Diaphorina citrus * (Psyllide Asiatique des fields)",
    "description": "Incurable bacterial disease causing a gradual decline of citrus fruits, with distorted and bitter fruits.",
    "symptoms": "Marbled, asymmetrical leaves, small fruits, mature green, bitter taste, aborted seeds, premature fall.",
    "evolution": "Transmitted by the shrink. The tree can remain asymptomatic for a long time but infect other trees.",
    "Name of active product material": "No curative treatment. Vector control: imidacloprid, horticultural oils.",
    "treatment": "Eliminate infected trees, monitor psyllides, use certified plants, preventive treatments."
  },
  "Bacterial fishing": {
    "culture": "Fishing, nectarinier, apricot tree",
    "Agent causal": "*Xanthomonas arboricola* pv. *pruni*",
    "description": "Bacterial disease causing foliar spots, chancres on branches and fruit lesions.",
    "symptoms": "Dark brown angular spots on leaves, sometimes perforated, chancres on branches, stained or deformed fruits.",
    "evolution": "Favored by humidity and injuries. Spreads by rain, tools or insects.",
    "Name of active product material": "Copper (oxychloride, hydroxide), kasugamycin (in some countries)",
    "treatment": "Pruning of affected parts, tool disinfection, preventive copper treatments, cultural rotation."
  },
  "Healthy fishing": {
    "culture": "Sin",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous tree, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Brilliant green foliage, abundant flowering, healthy fruits, absence of cannons or spots.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Bacterial pepper": {
    "culture": "Bell pepper",
    "Agent causal": "*Xanthomonas campestris* pv. *vesicatoria*",
    "description": "Bacterial disease causing lesions on leaves and fruits, reducing quality and yield.",
    "symptoms": "Dark, humid, then brown spots with yellow halo over leaves, liking lesions on fruits.",
    "evolution": "Favored by heat and humidity. Spreads by seeds, splashes, tools.",
    "Name of active product material": "Copper + Mancozèbe, Kasugamycin (in some countries)",
    "treatment": "Healthy seeds, disinfection of tools, preventive treatments, cultural rotation."
  },
  "Healthy pepper": {
    "culture": "Bell pepper",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green leaves, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Balanced fertilization, controlled irrigation, gentle size, preventive phytosanitary surveillance."
  },
  "Early burn potato": {
    "culture": "Potato, tomato",
    "Agent causal": "*Alternaria Solani*, Champignon Défoliat",
    "description": "Fungal disease causing concentric spots on the leaves, stems and fruits, reducing yield.",
    "symptoms": "Brown with black stains with concentric circles, yellowing, falling leaves, lesions on stems and tubers.",
    "evolution": "Favored by humidity and moderate temperatures. Spreads by infected splashes and debris.",
    "Name of active product material": "Chlorothalonil, mancozèbe, azoxystrobine, cuivre",
    "treatment": "Cultural rotation, elimination of debris, preventive fungicidal treatments, plant spacing."
  },
  "Healthy potato": {
    "culture": "Potato",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative development and normal tuberization.",
    "symptoms": "Green leaves, regular growth, well formed tubers, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Cultural rotation, balanced fertilization, buttage, controlled irrigation, phytosanitary surveillance."
  },
  "Late potato burn": {
    "culture": "Potato, tomato",
    "Agent causal": "*Phytophthora infestans*, pathogen",
    "description": "Devastating disease causing dark lesions on leaves, stems and tubers, causing rapid rot.",
    "symptoms": "Dark brown spots with fuzzy edges on leaves, blackened stems, rotten tubers, unpleasant odor.",
    "evolution": "Spreads quickly in fresh and humid weather. Spores move through wind and water.",
    "Name of active product material": "Cymoxanil, Mancozèbe, Fluopicolide, Copper",
    "treatment": "Elimination of infected plants, preventive fungicidal treatments, plant spacing, long cultural rotation."
  },
  "Healthy raspberry": {
    "culture": "Framboisier (Rubus idaeus)",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous shrub, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Dark green foliage, erect stems, abundant flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Annual size, balanced fertilization, mulching, controlled irrigation, preventive phytosanitary surveillance."
  },
  "Red rust": {
    "culture": "Anacardier, guava, mango, ornamental",
    "Agent causal": "*Cephaleuros Virescens*, pathogenic algae",
    "description": "Disease caused by a reddish algae, affecting the leaves, branches and sometimes fruits.",
    "symptoms": "Reddish or orange spots on the leaves, sometimes powder, blackened or deformed branches.",
    "evolution": "Develops in hot and humid conditions. The algae penetrates by stomates or injuries.",
    "Name of active product material": "Copper (oxychloride, hydroxide), Mancozèbe",
    "treatment": "Pruning of affected parts, fungicidal treatments based on copper, improvement in ventilation and drainage."
  },
  "Septoria Facing Leaf": {
    "culture": "Tomato, celery, parsley, sunflower, poplar",
    "Agent causal": "* Septoria spp. * (Out. * Septoria tomato *)",
    "description": "Mushroom causing brown to black foliar spots with light center, reducing photosynthesis.",
    "symptoms": "Small round spots at grayish center, dark edge, often with black pycnids in the center. Premature fall of the leaves.",
    "evolution": "Favored by high humidity and moderate temperatures. Spreads by splashes, wind and tools.",
    "Name of active product material": "Chlorothalonil, Mancozèbe, Copper, Thiophanate-Methyl",
    "treatment": "Elimination of affected leaves, preventive fungicidal treatments, plant spacing, cultural rotation."
  },
  "Healthy soybeans": {
    "culture": "Soja (Glycine max)",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous legume plant, without symptoms of diseases or stress, with good nodulation and optimal efficiency.",
    "symptoms": "Uniform green foliage, regular flowering, well formed pods, absence of stains or wilting.",
    "evolution": "Maintaining a good health condition by adapted cultural practices, balanced fertilization and a cultural rotation.",
    "Name of active product material": "No treatment required",
    "treatment": "Inoculation with rhizobium, balanced fertilization, regular weeding, phytosanitary surveillance."
  },
  "Courge powdery mildew": {
    "culture": "Zucchini, cucumber, melon, watermelon",
    "Agent causal": "* Podosphaera xanthii * * Erysiphe Cichoraceae *",
    "description": "Mushroom causing white felting on the leaves, reducing photosynthesis and yield.",
    "symptoms": "White powder spots on both sides of the leaves, yellowing, drying, premature fall.",
    "evolution": "Favored in hot and dry weather with high ambient humidity. Propagates by the wind.",
    "Name of active product material": "Soufre, bicarbonate de potassium, myclobutanil, neem",
    "treatment": "Eliminate the affected leaves, preventive treatments, plant spacing, resistant varieties."
  },
  "Healthy strawberry": {
    "culture": "Strawberry (Fragaria × Ananassa)",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green leaves, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Mulching, balanced fertilization, watering at the foot, cultural rotation, phytosanitary surveillance."
  },
  "Scorch leaf strawberry": {
    "culture": "Strawberry",
    "Agent causal": "*Diplocarpon earlianum*",
    "description": "Mushroom causing irregular brown spots on the leaves, which can cause their drying out.",
    "symptoms": "Dark brown spots with black, often irregular, merging into large necrotic areas. Dried and crisp leaves.",
    "evolution": "Favored by high humidity and moderate temperatures. Spreads by splashes and tools.",
    "Name of active product material": "Captane, copper, thiophanate-methyl",
    "treatment": "Elimination of affected leaves, preventive fungicidal treatments, plant spacing, ground irrigation."
  },
  "Streak virus": {
    "culture": "Corn, wild grasses",
    "Agent causal": "Maize streak virus (MSV), genre Mastrevirus",
    "description": "Viruses transmitted by cicadelles, causing chlorotic streaks on the leaves and severe navism.",
    "symptoms": "Parallel yellow streaks on the leaves, slowed growth, absent or poorly trained ears.",
    "evolution": "Transmitted by Cicadulina Mbila. Very stable virus, persists in wild hosts. Endemic in Africa.",
    "Name of active product material": "No antiviral. Fight against the vector.",
    "treatment": "Resistant varieties, fight against cicadelles, weeding of host grains, early sowing."
  },
  "Tomate bacterial tache": {
    "culture": "Tomato",
    "Agent causal": "*Xanthomonas vesicatoria* (anciennement *X. campestris* pv. *vesicatoria*)",
    "description": "Bacterial disease causing dark spots on leaves, stems and fruits, often confused with the speck.",
    "symptoms": "Wet stains becoming brown/black, sometimes surrounded by a yellow halo. Lesions on sunk and liégous fruits.",
    "evolution": "Develops in warm and humid weather. Propagates by the seeds, splashes and contaminated tools.",
    "Name of active product material": "Copper + Mancozèbe, Kasugamycin (in some countries)",
    "treatment": "Use healthy seeds, disinfect tools, apply copper -based preventive treatments, 2–3 year old cultural rotation."
  },
  "Tomate early brûlure": {
    "culture": "Tomato, potato",
    "Agent causal": "*Alternaria Solani*, Champignon Défoliat",
    "description": "Fungal disease causing concentric spots on the leaves, stems and fruits, reducing yield.",
    "symptoms": "Brown with black stains with concentric circles, yellowing, falling leaves, lesions on stems and fruits.",
    "evolution": "Spreads by infected splashes and debris. Favored by humidity and moderate temperatures.",
    "Name of active product material": "Chlorothalonil, mancozèbe, azoxystrobine, cuivre",
    "treatment": "Cultural rotation, elimination of debris, preventive fungicidal treatments, plant spacing."
  },
  "Healthy tomato": {
    "culture": "Tomato",
    "Agent causal": "No - normal physiological state",
    "description": "Vigorous plant, without symptoms of diseases or stress, with good vegetative and reproductive development.",
    "symptoms": "Green leaves, regular growth, normal flowering and fruiting, absence of stains or deformations.",
    "evolution": "Maintaining a good health condition by suitable cultural practices and regular monitoring.",
    "Name of active product material": "No treatment required",
    "treatment": "Balanced fertilization, controlled irrigation, gentle size, preventive phytosanitary surveillance."
  },
  "Late tomato burns": {
    "culture": "Tomato, potato",
    "Agent causal": "*Phytophthora infestans*, pathogen",
    "description": "Devastating disease causing dark lesions on leaves, stems and fruit, causing rapid rot.",
    "symptoms": "Dark brown spots with fuzzy edges on leaves, blackened stems, brown and soft fruits, smell of rot.",
    "evolution": "Spreads quickly in fresh and humid weather. Spores move through wind and water.",
    "Name of active product material": "Cymoxanil, Mancozèbe, Fluopicolide, Copper",
    "treatment": "Elimination of infected plants, preventive fungicidal treatments, plant spacing, long cultural rotation."
  },
  "Tomate feuille mold": {
    "culture": "Tomato (especially in greenhouse or tunnel)",
    "Agent causal": "* Passalora yellow (syn. * Cladosporium yellow *)",
    "description": "Mushroom causing fungal felting on the underside of the leaves, reducing photosynthesis.",
    "symptoms": "Yellow spots on the upper side, olive felt to brown on the underside, withered, fall of the leaves.",
    "evolution": "Favored by humidity> 85% and heat. Spreads by spores in the air, tools, seeds.",
    "Name of active product material": "Copper, chlorothalonil, Mancozèbe, MyClobutanil",
    "treatment": "Ventilation, disinfection, healthy seeds, preventive fungicide treatments, avoid sprinkling by sprinkling."
  },
  "Tomato Septoria Facing Leaf": {
    "culture": "Tomato",
    "Agent causal": "*Septoria lycopersici*, champignon ascomycète",
    "description": "Fungal disease causing many small spots on the leaves, causing their premature fall.",
    "symptoms": "Small round spots at grayish center, dark edge, often with black pycnids in the center. Fall of the leaves.",
    "evolution": "Spreads by splashes, wind, tools. Favored by high humidity and moderate temperatures.",
    "Name of active product material": "Chlorothalonil, mancozèbe, copper, thiophanate-methyl",
    "treatment": "Elimination of affected leaves, preventive fungicidal treatments, plant spacing, cultural rotation."
  },
  "Tomate spider mites two-tacheted spider mite": {
    "culture": "Tomato, eggplant, bean, strawberry",
    "Agent causal": "* Distribution nettle *, Acarien tétranyque",
    "description": "Very polyphagous devastating mite, causing discoloring, canvases and weakening of plants.",
    "symptoms": "White points (Stippling), yellow then brown leaves, fine paintings, falling leaves, slowed growth.",
    "evolution": "Develops quickly in hot and dry weather. Several generations per year. Infestation often at the base.",
    "Name of active product material": "Abamectine, spirototetramatis, horticultural oils, insecticide soap",
    "treatment": "Targeted spraying, introduction of predators (*phytoseiulus persimilis*), avoid water stress, regular monitoring."
  },
  "Tomate target tache": {
    "culture": "Tomato",
    "Agent causal": "*Corynespora Cassiicola*, necrotrophic mushroom",
    "description": "Fungal disease causing circular lesions with concentric rings on leaves and fruit.",
    "symptoms": "Brown spots with light center with concentric circles (target appearance), yellowed leaves, stained or deformed fruits.",
    "evolution": "Spreads by air spores. Favored by heat and humidity. Can cause significant losses.",
    "Name of active product material": "Difenoconazole, pyraclostrobine, mancozèbe, fluopyram",
    "treatment": "Cultural rotation, elimination of debris, preventive fungicidal treatments, tolerant varieties if available."
  },
  "Tomate Tomate mosaic virus": {
    "culture": "Tomato, pepper, eggplant, ornamental",
    "Agent causal": "Tomato mosaic virus (ToMV), genre *Tobamovirus*",
    "description": "Very stable virus transmitted mechanically, causing mosaics, deformations and loss of yield.",
    "symptoms": "Light/dark green mosaic, deformed or fern -shaped leaves, slowed growth, necrotic or striated fruits.",
    "evolution": "Seed transmission, tools, hands, tobacco. Very persistent in plant debris (several years).",
    "Name of active product material": "No antiviral. Disinfection: skim milk, soap, iodized solutions.",
    "treatment": "Healthy seeds, tool disinfection, avoid tobacco, eliminate infected plants, resistant varieties."
  },
  "Tomate Tomate yellow feuille curl virus": {
    "culture": "Tomato, pepper, tobacco, ornamental",
    "Agent causal": "Tomato yellow leaf curl virus (TYLCV), genre *Begomovirus*, famille *Geminiviridae*",
    "description": "Viruses transmitted by the Aleurodes, causing winding of leaves, naism and falling flowers.",
    "symptoms": "Leaves wrapped up, thickened, marginal chlorosis, slowed growth, aborted flowering.",
    "evolution": "Transmitted by *bemisia tobacaci *. Early infection = severe losses. No semen transmission.",
    "Name of active product material": "No antiviral. Verctors control: spinosad, pyrethrinoids, horticultural oils.",
    "treatment": "Resistant varieties (TYLCV), anti-insect nets, elimination of infected plants, weeding, monitoring of sunselerodes."
  },
  "Verticulium Want": {
    "culture": "Tomato, potato, eggplant, pepper, strawberry, cotton, maple, olivier",
    "Agent causal": "* Verticillium Dahliae * * Verticillium white-dark * Champignons vasculares du sun",
    "description": "Vascular fungal disease affecting many crops, causing gradual wilt and internal discoloration of tissues.",
    "symptoms": "Diurnal willing of the leaves (then night recovery), yellowing of the lower leaves, marginal necrosis, slowed growth, brown streaks in the vascular tissue with the cut.",
    "evolution": "The fungus penetrates through the roots and colonizes the Xylth, blocking the circulation of water. He can persist in the soil for more than 10 years in the form of microsclerotes.",
    "Name of active product material": "No curative fungicide. Prevention: Trichoderma spp., Biofumigation, Solarization",
    "treatment": "Use resistant varieties (eg ‘verticillium-Tolerant’), long cultural rotation (> 4 years), solarization of the soil, improvement in drainage, tool disinfection, supply of suppressive composts."
  },
  "Apple apple scab": {
    "culture": "Apple",
    "Agent causal": "Venturia unequal (Champignon)",
    "description": "Mushroom responsible for scabing, the main fungal disease of the apple tree in wetlands.",
    "symptoms": "Brown-olive stains on the leaves, fruits and young branches. Deformed, cracked fruits.",
    "evolution": "Keep on the dead leaves. Propagation favored by humidity and spring rains.",
    "Name of active product material": "Fungicides based on captane, dithianon, sulfur, or copper (AB).",
    "treatment": "Picking up dead leaves, preventive fungicidal treatments from the barely, tolerant varieties."
  },
  "Apple black rot": {
    "culture": "Apple",
    "Agent causal": "Botryosphaeria blunt (syn. Diplodia seriata)",
    "description": "Disease causing the black rot of fruits, cankers and stains on leaves.",
    "symptoms": "Blackish concentric spots on fruits, lesions leafy in 'frog eye', channies on branches.",
    "evolution": "The fungus winters in cannons and fruit mummies. Contamination by rain.",
    "Name of active product material": "Fungicides: Thiophanate-Methyl, Pyraclostrobin, Captania.",
    "treatment": "Pruning of affected branches, elimination of mummified fruits, preflores and postfloration treatments."
  },
  "Apple cedar apple rust": {
    "culture": "Apple (with alternating juniper)",
    "Agent causal": "Gymnosporangium juniperi-virginianae",
    "description": "Cryptogamic disease requiring two hosts for its cycle: apple and juniper.",
    "symptoms": "Yellow-orange spots on apple leaves, pustules under the leaves, lesions on fruit.",
    "evolution": "Two -year cycle with host alternation. Spores issued in the spring by juniper.",
    "Name of active product material": "MyClobutanil, Fenarimol, Copper (organic).",
    "treatment": "Avoid proximity to juniper. Preventive fungicide treatment in spring."
  },
  "Apple healthy": {
    "culture": "Apple",
    "Agent causal": "None (healthy plant)",
    "description": "Visually healthy exemplary used as a reference class in automatic learning.",
    "symptoms": "Green leaves, without stains or deformation. Smooth, well -trained fruits.",
    "evolution": "Absence of symptoms visible under the conditions of observation.",
    "Name of active product material": null,
    "treatment": null
  },
  "Bacterial blight": {
    "culture": "Soy, rice, bean, apple, pear",
    "Agent causal": "Xanthomonas spp. ou erwinia amylovora selon la culture",
    "description": "Bacterial disease causing humid lesions, leaf necrosis and channings on stems or branches.",
    "symptoms": "Dark brown angular spots with black, bachelor's oozing, wilting, defoliation.",
    "evolution": "Quick spread by water splashes, contaminated tools or infected seeds.",
    "Name of active product material": "Copper, kasugamycin, oxytetracycline (according to local regulation)",
    "treatment": "Cultural rotation, healthy seeds, disinfection of tools, preventive bactericidal treatments."
  },
  "Bacterial spot": {
    "culture": "Tomato, pepper, eggplant",
    "Agent causal": "Xanthomonas vesicatoria",
    "description": "Frequent bacterial disease in warm and humid climate, affecting leaves, stems and fruits.",
    "symptoms": "Small black spots on leaves, oval lesions on rods, crusts on fruit.",
    "evolution": "Transmission by seeds, water splashes, tools or handling of wet plants.",
    "Name of active product material": "Copper + Mancozèbe, Kasugamycin",
    "treatment": "Certified seeds, avoid irrigation with sprinkling, preventive copper treatments."
  },
  "Beetles and  leafhoppers": {
    "culture": "Corn, beet, vine, tomato, potato",
    "Agent causal": "Virus and phytoplasm vectors (eg Curly Top, Aster Yellows)",
    "description": "Insects-sucking insectors transmitting viral or bacterial diseases to plants.",
    "symptoms": "Yellowing, navism, foliar winding, mosaics, deformations.",
    "evolution": "Persistent or semi-persistent transmission depending on the pathogen. Active migration of insects.",
    "Name of active product material": "Spinosad, pyrethrinoids, acetamipride (attention to regulations)",
    "treatment": "Integrated struggle: nets, trap plants, targeted insecticides, population surveillance."
  },
  "Blueberry  healthy": {
    "culture": "Blueberry",
    "Agent causal": "None (healthy plant)",
    "description": "Healthy exemplary used as a reference for automatic learning or visual detection.",
    "symptoms": "Dark green foliage, firm blue fruits, no stain or deformation.",
    "evolution": "Normal growth without visible biotic stress.",
    "Name of active product material": null,
    "treatment": null
  },
  "Cherry (including sour)  healthy": {
    "culture": "Sweet and acid cherry",
    "Agent causal": "None (healthy plant)",
    "description": "Healthy foliage, fruits without spots or rot, balanced growth.",
    "symptoms": "Green leaves, shiny fruits, absence of fungal or bacterial symptoms.",
    "evolution": "Normal development without visible alteration.",
    "Name of active product material": null,
    "treatment": null
  },
  "Cherry (including sour)  powdery mildew": {
    "culture": "Cherry",
    "Agent causal": "Podosphara Clandestina",
    "description": "Cryptogamic disease affecting leaves, young shoots and fruits, especially in humid climate.",
    "symptoms": "White felting on young leaves, fruits covered with white powder, deformation of the shoots.",
    "evolution": "Propagation by spores in hot and humid conditions, winter survival in the cankers.",
    "Name of active product material": "Sulfur, myclobutanil, trifloxystrobin",
    "treatment": "Pruning of affected parts, preventive fungicide treatments after flowering."
  },
  "Northern leaf blight": {
    "culture": "But",
    "Agent causal": "Exserohilum turcicum",
    "description": "Major foliar disease of corn, causing significant yield losses.",
    "symptoms": "Lying lesions in the shape of cigar, gray with brown, on lower then upper leaves.",
    "evolution": "Spores scattered by the wind, favored by humidity and moderate temperatures (18–27 ° C).",
    "Name of active product material": "Azoxystrobine, pyraclostrobine, propiconazole",
    "treatment": "Resistant hybrids, cultural rotation, preventive fungicides as soon as symptoms appear."
  },
  "Corn earworm  tomato fruitworm": {
    "culture": "Corn, tomato, pepper, cotton",
    "Agent causal": "Helicverpa league (ravageur insect)",
    "description": "Polyphage lepidopter whose larvae dig the fruits and ears.",
    "symptoms": "Holes in fruits, galleries filled with excrement, rotten fruit or prematurely ripe.",
    "evolution": "3 generations/year, laying on leaves or bristles, larvae penetrate into the fruits.",
    "Name of active product material": "Spinosad, bacillus thuringiensis, méthoxyfénozide",
    "treatment": "Transageing adults, targeted treatments on eggs/young larvae, resistant varieties."
  },
  "Cucumber_mosaic_geminiviruses": {
    "culture": "Cucumber, melon, squash, tomato, spinach",
    "Agent causal": "Cucumber Mosaic Virus (CMV), sometimes associated with geminivirus",
    "description": "Very polyphagous virus transmitted by aphids, causing mosaics and deformations.",
    "symptoms": "Mosaic leaves, rabougreation, deformed or striated fruits, slowed growth.",
    "evolution": "Non -persistent transmission by more than 80 species of aphids, rapid spread.",
    "Name of active product material": "No antiviral. Mineral oils, insecticide soap.",
    "treatment": "Elimination of infected plants, fight against aphids, resistant varieties, reflective mulch."
  },
  "Grape  black rot": {
    "culture": "Vine",
    "Agent causal": "Guuvardy Bidwellii",
    "description": "Fungal disease causing the black rot of bays and leafy lesions.",
    "symptoms": "Brown spots on leaves, black mummified fruits, branches lesions.",
    "evolution": "Spores released by rain, infection favored by heat and humidity.",
    "Name of active product material": "Captane, mancozèbe, myclobutanil",
    "treatment": "Elimination of mummified fruits, fungicidal treatments as soon as baredown."
  },
  "Grape  esca (black measles)": {
    "culture": "Vine (often> 5 years)",
    "Agent causal": "Complexe fongique: Phaeomoniella chlamydospora, phaeoacremonium spp.",
    "description": "Chronic wood disease causing internal black streaks and leaf symptoms in 'tiger'.",
    "symptoms": "Tigerous leaves, stained fruits (Measles), sudden dryness (apoplexy), blackened wood.",
    "evolution": "Infection by size wounds, expression favored by water stress and heat.",
    "Name of active product material": "Topsin-M (Thiophanate-Methyl), MyClobutanil, Boron painting",
    "treatment": "Protection of size wounds, double size, wood elimination reached."
  },
  "Grape  healthy": {
    "culture": "Vine",
    "Agent causal": "None (healthy plant)",
    "description": "Vine foot without symptoms, used as a reference in detection models.",
    "symptoms": "Green leaves, intact clusters, absence of necrosis or spots.",
    "evolution": "Normal development without manifestation of known pathogens."
  },
  "Grape  leaf blight (isariopsis leaf spot)": {
    "culture": "Vine",
    "Agent causal": "Pseudochercospora vitis (Ancient isariopsis grantee)",
    "description": "Fungal disease mainly affecting vine leaves, causing necrotic spots and premature defoliation.",
    "symptoms": "Dark brown angular spots with black, often bordered by chlorotic halos. The lesions can meet and cause foliar drying out.",
    "evolution": "Spreads by spores in wet conditions. Survives in plant debris. Favored by rainy spring.",
    "Name of active product material": "Captane, mancozèbe, copper (in organic), trifloxyystrobin",
    "treatment": "Elimination of infected leaves, preventive fungicidal treatments, canopy ventilation."
  },
  "Leaf beetle": {
    "culture": "Potato, beet, corn, ornamental",
    "Agent causal": "Famille Chrysomelidae (out. Leptinotarsa ​​tallinoma, Oulema melanopus)",
    "description": "Phytophagous beetles whose larvae and adults consume the leaves, reducing photosynthesis.",
    "symptoms": "Perforated, skeletonized or partially devoured leaves. Presence of brilliant adults or black larvae.",
    "evolution": "Quick cycle in hot conditions. Lay on the underside of the leaves. Several generations per year.",
    "Name of active product material": "Spinosad, pyréthiness, azadirachtine (mear)",
    "treatment": "Manual pickup, anti-insect nets, targeted treatments at the start of infestation."
  },
  "Leaf spot": {
    "culture": "Many crops (tomato, soy, cereals, fruit trees)",
    "Agent causal": "Mushrooms (Cercle Cercle, Septoria, Alternaria) or bacteria (Xanthomonas, Pseudomonas)",
    "description": "Group of diseases causing necrotic leaflets, often circular or angular.",
    "symptoms": "Brown, black or red spots, sometimes concentric. Premature fall of the leaves so severe.",
    "evolution": "Favored by humidity, rain and splashes. Survival in plant debris.",
    "Name of active product material": "Copper, Mancozèbe, Chlorothalonil, Thiophanate-Methyl",
    "treatment": "Cultural rotation, ventilation, preventive treatments, elimination of affected leaves."
  },
  "Orange  haunglongbing (citrus greening)": {
    "culture": "Citrus (orange tree, lemon tree, mandarinier)",
    "Agent causal": "Application Liberibacter SPP. (bacteria transmitted by the Asian psylle)",
    "description": "Incurable bacterial disease causing the downside of citrus fruits. Also called HLB or 'yellow dragon'.",
    "symptoms": "Asymmetrical marbled leaves, green fruits, small and bitters, premature fall, tree decline.",
    "evolution": "Transmitted by Citri diaphorina. Infected tree remains a carrier for life. No curative treatment.",
    "Name of active product material": "None. Fight against the vector (Psylle) with systemic insecticides.",
    "treatment": "Elimination of infected trees, fight against the psylle, strict surveillance, varieties tolerant in development."
  },
  "Pepper_mottle_pepper": {
    "culture": "Poivron (capsicum spp.)",
    "Agent causal": "Pepper mild mottle virus (PMMoV), genre Tobamovirus",
    "description": "Very stable virus transmitted by seeds and contact, causing deformations and loss of yield.",
    "symptoms": "Mosaic, chlorosis, deformed leaves, bumpy or striated fruits, slowed growth.",
    "evolution": "Mechanical transmission (hands, tools), infected seeds. Very persistent on inert surfaces.",
    "Name of active product material": "No antiviral. Disinfection with skimmed milk, soap, iodophores.",
    "treatment": "Certified seeds, tool disinfection, elimination of infected plants, resistant varieties (L gene)."
  },
  "Phomopsis blight": {
    "culture": "Aubergine, pepper, tomato, juniper (depending on species)",
    "Agent causal": "Phomopsis Vexans (Aubergine) or Phomopsis juniperovora (juniper)",
    "description": "Fungal disease causing lesions on rods, leaves and fruits, causing willing and rot.",
    "symptoms": "Brown spots with black on leaves, cankers on rods, soft rot of fruit with black pycnids in circles.",
    "evolution": "Survives in plant debris and mummified fruits. Propagation by water splash, favored by heat and humidity.",
    "Name of active product material": "Captane, chlorothalonil, Thiophanate-Methyl",
    "treatment": "Cultural rotation, destruction of residues, healthy seeds, preventive fungicidal treatments."
  },
  "Potato early blight": {
    "culture": "Potato, tomato",
    "Agent causal": "Alternaria solani",
    "description": "Frequent fungal disease causing significant yield losses on leaves, stems and tubers.",
    "symptoms": "Concentric brown spots ('beef eye') on elderly leaves, lesions on stems, dry rot of tubers.",
    "evolution": "Favored by heat (20–30 ° C) and humidity. Survives the ground and debris. Quick infection in favorable conditions.",
    "Name of active product material": "Azoxystrobine, mancozèbe, chlorothalonil, difenoconazole",
    "treatment": "Rotation, elimination of debris, fungicidal treatments from the first symptoms."
  },
  "Early Blight": {
    "culture": "Tomato, potato, eggplant",
    "Agent causal": "Alternaria Solani OU A. Tomatophila",
    "description": "Fungal disease causing lesions lesions, stems and fruits, with rapid defoliation if uncontrolled.",
    "symptoms": "Brown in black spots with concentric rings, chlorosis, wilting, lesions on collar and fruit.",
    "evolution": "Spores scattered by wind and rain. Survival in debris. Quick development in warm and humid weather.",
    "Name of active product material": "Chlorothalonil, mancozèbe, boscalid, fluopyram",
    "treatment": "Rotation, disinfection, preventive fungicidal treatments, tolerant varieties."
  },
  "Raspberry healthy": {
    "culture": "Raspberry",
    "Agent causal": "None (healthy plant)",
    "description": "Healthy exemplary used as a reference in detection models or for automatic learning.",
    "symptoms": "Green leaves, firm red fruits, no visible stain or deformation.",
    "evolution": "Normal growth without apparent biotic or abiotic stress.",
    "Name of active product material": null,
    "treatment": null
  },
  "Septoria Leaf Spot": {
    "culture": "Tomato, eggplant, potato, soy",
    "Agent causal": "Septoria spp. (Ex. Septoria tomato, Septoria Glycines)",
    "description": "Very frequent fungal disease on solanaceae, causing leaf spots and premature defoliation.",
    "symptoms": "Small circular spots with gray center and brown edge, often on the lower leaves. Quick drop in foliage.",
    "evolution": "Spores scattered by rain, wind or tools. Survives in plant debris. Favored by humidity.",
    "Name of active product material": "Copper, chlorothalonil, Mancozèbe, Thiophanate-Methyl",
    "treatment": "Cultural rotation, elimination of infected leaves, preventive fungicidal treatments, plant ventilation."
  },
  "Soybean healthy": {
    "culture": "Military",
    "Agent causal": "None (healthy plant)",
    "description": "Healthy exemplary used as a reference in detection models or for automatic learning.",
    "symptoms": "Uniform green foliage, well -formed pods, regular growth.",
    "evolution": "Normal development without biotic or apparent abiotic stress.",
    "Name of active product material": null,
    "treatment": null
  },
  "Squash powdery mildew": {
    "culture": "Squash, zucchini, melon, cucumber",
    "Agent causal": "Podosphaera xanthii, Golovinomyces cichoracearum",
    "description": "Very common cryptogamic disease on cucurbit, causing white felting on the leaves.",
    "symptoms": "White powder spots on both sides of the leaves, yellowing, drying, fruits exposed to the sun.",
    "evolution": "Rapid propagation by the wind. Favored by heat and humidity. May appear even in dry weather.",
    "Name of active product material": "Soufre, trifloxystrobine, myclobutanil, bicarbonate de potassium",
    "treatment": "Resistant varieties, preventive treatments, plant spacing, removal of affected leaves."
  },
  "Strawberry healthy": {
    "culture": "Strawberry",
    "Agent causal": "None (healthy plant)",
    "description": "Plant healthy without symptoms of fungal, bacterial or viral diseases.",
    "symptoms": "Green leaves, shiny red fruits, no stain or deformation.",
    "evolution": "Normal growth, good yield, no visible stress.",
    "Name of active product material": null,
    "treatment": null
  },
  "Strawberry leaf scorch": {
    "culture": "Strawberry",
    "Agent causal": "Diplocarpon earlianum (syn. Marssonina fragariae)",
    "description": "Fungal disease causing dark spots on the leaves, leading to their drying up.",
    "symptoms": "Purp with black with black without a light center, leaves that brown, curl up and dry out.",
    "evolution": "Survives in plant debris. Propagation by water splashes. Favored by humidity and heat.",
    "Name of active product material": "Captane, myclobutanil, copper",
    "treatment": "Elimination of affected leaves, ventilation, preventive fungicidal treatments, resistant varieties."
  },
  "Tobacco mosaic virus & tomato mosaic virus": {
    "culture": "Tobacco, tomato, pepper, eggplant, ornamental",
    "Agent causal": "Tobacco mosaic virus (TMV), Tomato mosaic virus (ToMV), genre Tobamovirus",
    "description": "Very stable virus transmitted mechanically, causing mosaics, deformations and loss of yield.",
    "symptoms": "Light/dark green mosaic, deformed leaves, slowed growth, striated or necrotic fruits.",
    "evolution": "Seed transmission, tools, hands, tobacco. Long survival on inert surfaces (several years).",
    "Name of active product material": "No antiviral. Disinfection: skim milk, soap, iodized solutions.",
    "treatment": "Healthy seeds, tool disinfection, avoid tobacco, eliminate infected plants, resistant varieties."
  },
  "Tomato  spider mites two-spotted spider mite": {
    "culture": "Tomato, eggplant, pepper, bean",
    "Agent causal": "Tetranychus urticae (two -point tetranyque mite)",
    "description": "Microscopic mite sucking sap, causing discolorations, wilting and falling leaves.",
    "symptoms": "Leaves punctuated by yellow spots, marbled appearance, fine canvases under the leaves, progressive drying.",
    "evolution": "Develops quickly in hot and dry weather. Several generations per season. Frequent acaricidal resistance.",
    "Name of active product material": "Abamectine, bifenazate, Spirodiclofen, vegetable oils (mint, clove)",
    "treatment": "Spray on the lower side of the leaves, introduction of predatory mites (phytoseiulus persimilis), avoid water stress."
  },
  "Tomato  target spot": {
    "culture": "Tomato, papaya, soy, cotton, cucumber",
    "Agent causal": "Corynespora Cassiicola (Necrotrophic mushroom)",
    "description": "Fungal disease causing circular lesions at light center and concentric rings.",
    "symptoms": "Brown spots with grayish center with concentric circles ('target'), often on the lower leaves. Premature fall in foliage.",
    "evolution": "Survives in plant debris. Propagation by wind and rain. Favored by humidity and hot temperatures.",
    "Name of active product material": "Chlorothalonil, azoxystrobine, mancozèbe, cuivre",
    "treatment": "Cultural rotation, ventilation of plants, fungicidal treatments from the first symptoms."
  },
  "Mosaic virus": {
    "culture": "Tomato, potato, cucumber, melon, bean, tobacco",
    "Agent causal": "Famille des Potyvirus (Ex. TMV, CMV, Pvy)",
    "description": "Group of viruses causing mosaics, deformations and loss of yield. Transmitted by insects or contact.",
    "symptoms": "Light green/dark green leaves, deformations, slowed down growth, striated or bumpy fruits.",
    "evolution": "Transmission by aphids, seeds, tools or contact. Very stable, persistent virus on inert surfaces.",
    "Name of active product material": "No antiviral. Disinfection with soap, skim milk, iodophores.",
    "treatment": "Healthy seeds, disinfection of tools, elimination of infected plants, resistant varieties."
  },
  "Western striped and spotted cucumber beetle": {
    "culture": "Cucumber, melon, squash, corn, bean",
    "Agent causal": "Acalymma trivittattum (striped), Diabrotic undecided (stained)",
    "description": "Cecurbit pests of cucurbit, direct damage managers and virus vectors (mosaic, bacterial wilt).",
    "symptoms": "Perforated leaves, destroyed flowers, scars on fruit, wilting of young plants.",
    "evolution": "Winter in adult state. Active from spring. Laying at the foot of the plants. Larvae attack the roots.",
    "Name of active product material": "Spinosad, pyrethrinoids, acetamipride, vegetable oils",
    "treatment": "Anti-insect nets, trapping, targeted treatments, destruction of culture residues."
  },
  "Yellow_mosaic_potato x": {
    "culture": "Potato",
    "Agent causal": "Potato virus X (PVX), genre Potexvirus",
    "description": "Latent or weakly symptomatic viruses, but that can reduce yields. Amplified symptoms in co-infection.",
    "symptoms": "Light mosaic, slightly embossed leaves or without visible symptoms. Discrete Crénelles.",
    "evolution": "Contact transmission, tools, infected tubers. Very stable. No known vector.",
    "Name of active product material": "No antiviral. Prevention only.",
    "treatment": "Use of healthy certified plants, tool disinfection, elimination of infected plants."
  }
}