{
    "Pomme en bonne santé": {
        "culture": "Pomme",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Apple Alternaria_leaf Spot Disease": {
        "culture": "Apple",
        "description": "Maladie fongique causée par Alternaria alternata f. sp. mali, ciblant principalement les feuilles des pommiers. Elle est souvent observée dans les climats humides et tempérés, affectant notamment les variétés sensibles comme Fuji.",
        "symptômes": "Apparition de taches brunes à noires, souvent bordées d’un halo jaune sur les feuilles. Ces lésions peuvent coalescer, entraînant un jaunissement généralisé, une défoliation prématurée, et parfois des lésions superficielles sur les fruits.",
        "évolution": "La maladie se développe rapidement sous des conditions humides et chaudes. Le champignon libère une toxine (AM-toxine) qui affaiblit les cellules végétales. Des cycles d’infection peuvent survenir tout au long de la saison si les conditions sont favorables et si les débris infectés ne sont pas éliminés.",
        "traitement": "Éliminer les feuilles et débris contaminés après récolte. Utiliser des fongicides préventifs à base de captane, difenoconazole ou pyraclostrobine après la chute des pétales. Favoriser une bonne aération des arbres par la taille et assurer une nutrition équilibrée."
    },
    "Maladie du spot gris des pommes": {
        "Agent causal": "Alternaria mali ou Alternaria alternata",
        "culture": "Pommier",
        "description": "Maladie fongique affectant principalement les feuilles des pommiers, causée par des espèces du genre Alternaria. Elle est fréquente dans les vergers humides et peut entraîner une défoliation prématurée, réduisant la vigueur de l’arbre et la qualité des fruits.",
        "symptômes": "Taches irrégulières grisâtres à brun foncé sur les feuilles, souvent entourées d’un halo jaune. Les lésions peuvent fusionner, provoquant un dessèchement foliaire. Dans les cas graves, chute prématurée des feuilles.",
        "évolution": "La maladie se développe rapidement par temps chaud et humide. Les spores fongiques se propagent par le vent et la pluie, infectant les feuilles jeunes. Les infections répétées affaiblissent l’arbre au fil des saisons.",
        "traitement": "Éliminer les feuilles mortes et les débris végétaux. Favoriser une bonne aération par la taille. Appliquer des fongicides préventifs à base de captane, mancozèbe ou difénoconazole dès la chute des pétales. Surveiller les conditions climatiques propices à l’infection pour ajuster les traitements."
    },
    "Mildiou poudreux pomme": {
        "Agent causal": "Podosphaera leucotricha",
        "culture": "Pommier",
        "description": "Maladie cryptogamique causée par le champignon Podosphaera leucotricha, affectant les jeunes pousses, feuilles, fleurs et fruits du pommier. Elle est fréquente dans les vergers tempérés, surtout au printemps et en début d’été.",
        "symptômes": "Présence d’un feutrage blanc poudreux sur les jeunes feuilles, les bourgeons et parfois les fruits. Les feuilles atteintes se recroquevillent, deviennent cassantes et peuvent chuter prématurément. Les fruits peuvent présenter des déformations ou des craquelures superficielles.",
        "évolution": "Le champignon hiverne dans les bourgeons infectés. Au printemps, il se développe rapidement par temps sec et chaud avec une humidité ambiante élevée. Les spores se propagent par le vent, entraînant des infections secondaires tout au long de la saison.",
        "traitement": "Éliminer les pousses infectées lors de la taille hivernale. Favoriser l’aération de la canopée. Appliquer des fongicides spécifiques (soufre mouillable, trifloxystrobine, myclobutanil) dès le débourrement et renouveler selon les conditions climatiques. Surveiller les variétés sensibles comme Gala ou Jonathan."
    },
    "Maladie de la mosaïque de pomme": {
        "agent_causal": "Apple mosaic virus (ApMV)",
        "culture": "Pommier",
        "description": "Maladie virale causée par le virus de la mosaïque du pommier (ApMV), appartenant au groupe des Ilarvirus. Elle affecte principalement les feuilles, réduisant la vigueur de l’arbre et pouvant entraîner une baisse de rendement, sans altérer directement la qualité des fruits.",
        "symptômes": "Présence de taches en mosaïque jaune pâle à crème sur les feuilles, souvent bien délimitées et réparties de manière irrégulière. Les symptômes apparaissent surtout au printemps sur les variétés sensibles comme Golden Delicious, Gala ou Jonathan. Dans certains cas, des nécroses ou une jaunisse partielle peuvent être observées.",
        "évolution": "Le virus est transmis par greffage ou matériel végétal infecté. Il ne se propage pas par insectes. Les symptômes sont plus marqués au printemps et peuvent s’atténuer en été. Certaines souches sévères peuvent réduire la croissance et la production de 20 à 40 %, surtout lors de printemps frais.",
        "traitement": "Il n’existe pas de traitement curatif. Utiliser du matériel de greffe certifié indemne de virus. Éliminer les arbres fortement infectés. La sélection de variétés tolérantes et la surveillance en pépinière sont essentielles pour limiter la propagation."
    },
    "Maladie des yeux de la grenouille aux pommes": {
        "agent_causal": "Botryosphaeria obtusa (syn. Diplodia seriata)",
        "culture": "Pommier",
        "description": "Maladie fongique affectant principalement les feuilles, les rameaux et parfois les fruits du pommier. Elle est causée par Botryosphaeria obtusa, un champignon opportuniste qui peut aussi provoquer des chancres sur les branches.",
        "symptômes": "Taches circulaires brun foncé à noires sur les feuilles, avec un centre plus clair et une bordure sombre, évoquant un œil de grenouille. Les lésions peuvent fusionner, entraînant un dessèchement foliaire. Sur les rameaux, des chancres ovales peuvent apparaître, et les fruits peuvent présenter des taches sombres enfoncées.",
        "évolution": "Le champignon hiverne dans les tissus morts ou les chancres. Au printemps, il libère des spores qui infectent les jeunes feuilles et rameaux par temps humide. La maladie progresse lentement mais peut s’aggraver en cas de stress hydrique ou de blessures sur l’arbre.",
        "traitement": "Éliminer les rameaux morts ou chancres lors de la taille hivernale. Favoriser une bonne aération de la canopée. Appliquer des fongicides préventifs à base de captane ou thiophanate-méthyl au printemps. Éviter les blessures mécaniques et surveiller les arbres affaiblis."
    },
    "Maladie de la tavelure du pommier": {
        "agent_causal": "Venturia inaequalis",
        "culture": "Pommier",
        "description": "Maladie fongique majeure du pommier causée par Venturia inaequalis. Elle affecte les feuilles, les fruits et parfois les jeunes rameaux, entraînant des pertes économiques importantes en raison de la dépréciation des fruits et de la chute prématurée du feuillage.",
        "symptômes": "Taches brun-olive à noirâtres sur la face supérieure des feuilles, souvent veloutées. Sur les fruits, lésions sombres, rugueuses et parfois craquelées, pouvant entraîner des déformations. Les rameaux jeunes peuvent présenter des chancres dans les cas sévères.",
        "évolution": "Le champignon hiverne dans les feuilles mortes au sol. Au printemps, les ascospores sont libérées lors des pluies et infectent les jeunes tissus. Des infections secondaires se produisent tout au long de la saison via les conidies. Le développement est favorisé par un climat humide et doux (10–25 °C).",
        "traitement": "Ramasser et détruire les feuilles mortes. Tailler pour améliorer l’aération. Appliquer des fongicides préventifs (captane, dodine, difénoconazole) dès le stade du débourrement et renouveler selon les conditions climatiques. Utiliser des variétés résistantes si possible."
    },
    "Apple Gibberellia": {
        "agent_causal": "Gibberella avenacea",
        "culture": "Pommier",
        "description": "Maladie fongique interne du fruit, causée par Gibberella avenacea, identifiée comme responsable de la pourriture humide du cœur chez la pomme. Elle affecte la qualité post-récolte des fruits, en particulier dans les variétés à chair dense comme Golden Delicious.",
        "symptômes": "Décoloration brunâtre et ramollissement de la chair autour du cœur du fruit, souvent sans symptômes externes visibles. À un stade avancé, une odeur désagréable et une texture aqueuse peuvent apparaître. Les fruits infectés peuvent se décomposer rapidement en stockage.",
        "évolution": "L’infection se produit généralement par les lenticelles ou les microblessures pendant la croissance ou la récolte. Le champignon se développe lentement à température ambiante, mais peut progresser rapidement en conditions humides ou lors d’un stockage prolongé.",
        "traitement": "Utiliser des pratiques culturales limitant les blessures sur les fruits. Récolter avec précaution et éviter les chocs mécaniques. Stocker les pommes à basse température et surveiller l’humidité. Il n’existe pas de traitement curatif, mais une sélection rigoureuse des fruits avant stockage peut limiter les pertes."
    },
    "Rouille de pomme": {
        "agent_causal": "Gymnosporangium juniperi-virginianae",
        "culture": "Pommier",
        "description": "Maladie fongique causée par un champignon rouille hétéroïque, nécessitant deux hôtes pour compléter son cycle : le pommier et un genévrier (souvent Juniperus virginiana). Elle provoque des lésions ornementées sur les feuilles et parfois les fruits.",
        "symptômes": "Taches orange à rougeâtre sur les feuilles, souvent avec des points noirs au centre (spermogonies). Sur la face inférieure, apparition de tubes orangés (aecia). Les fruits peuvent présenter des taches déprimées et des déformations.",
        "évolution": "Le champignon hiverne sur les genévriers sous forme de galles. Au printemps, il libère des spores qui infectent les pommiers. En été, les spores produites sur le pommier réinfectent les genévriers. Le cycle se répète chaque année.",
        "traitement": "Éviter la proximité entre pommiers et genévriers. Supprimer les galles sur les genévriers. Appliquer des fongicides préventifs (trifloxystrobine, myclobutanil) au printemps. Utiliser des variétés de pommiers résistantes si disponibles."
    },
    "Mildiou à la citrouille": {
        "agent_causal": "Pseudoperonospora cubensis",
        "culture": "Citrouille",
        "description": "Maladie fongique agressive des cucurbitacées, causée par un oomycète qui attaque principalement le feuillage. Elle peut entraîner une défoliation rapide et compromettre la production de fruits.",
        "symptômes": "Taches jaunes anguleuses sur la face supérieure des feuilles, correspondant à des zones délimitées par les nervures. Sur la face inférieure, présence d’un duvet gris-violet. Les feuilles se dessèchent rapidement.",
        "évolution": "Le pathogène se propage par les spores transportées par le vent. Il se développe rapidement par temps frais et humide (17–22 °C). Les infections peuvent apparaître soudainement et se propager en quelques jours.",
        "traitement": "Utiliser des variétés résistantes si disponibles. Appliquer des fongicides systémiques (fosétyl-Al, mandipropamide) dès les premiers symptômes. Éviter l’arrosage par aspersion. Favoriser la rotation des cultures et l’aération des plants."
    },
    "Maladie d'agrumes Huanglong": {
        "agent_causal": "Candidatus Liberibacter spp.",
        "culture": "Agrumes",
        "description": "Maladie bactérienne systémique aussi appelée Huanglongbing (HLB) ou greening des agrumes. Elle est l’une des plus destructrices au monde pour les vergers d’agrumes, affectant la croissance, la production et la qualité des fruits.",
        "symptômes": "Feuilles marbrées avec des taches asymétriques, jaunissement des nervures, chute prématurée des feuilles et des fruits. Les fruits sont petits, déformés, mal colorés, avec des graines avortées et un goût amer.",
        "évolution": "Transmise par des psylles (Diaphorina citri ou Trioza erytreae) ou par greffage. Une fois infecté, l’arbre reste porteur à vie. La maladie progresse lentement mais irréversiblement, entraînant la mort de l’arbre en quelques années.",
        "traitement": "Il n’existe pas de traitement curatif. Utiliser des plants certifiés sains. Contrôler les populations de psylles avec des insecticides et des filets. Arracher les arbres infectés pour limiter la propagation. Surveillance rigoureuse en pépinière."
    },
    "Perforation bactérienne de pêche": {
        "agent_causal": "Xanthomonas arboricola pv. pruni",
        "culture": "Pêcher",
        "description": "Maladie bactérienne affectant les feuilles, les rameaux et les fruits du pêcher, causée par Xanthomonas arboricola pv. pruni. Elle est particulièrement problématique dans les vergers humides ou mal aérés.",
        "symptômes": "Petites taches anguleuses brun foncé sur les feuilles, souvent entourées d’un halo jaune. Les tissus nécrosés tombent, laissant des perforations caractéristiques. Sur les fruits, lésions sombres et enfoncées pouvant exsuder un liquide gommeux.",
        "évolution": "La bactérie hiverne dans les bourgeons et les chancres. Elle se propage par la pluie, le vent et les outils contaminés. Les infections sont favorisées par l’humidité et les blessures mécaniques.",
        "traitement": "Éliminer les rameaux infectés. Éviter les arrosages par aspersion. Appliquer des traitements à base de cuivre en période de dormance et au printemps. Utiliser du matériel végétal certifié sain."
    },
    "Mildiou à cerise": {
        "agent_causal": "Peronospora spp. (probablement Peronospora cerasi)",
        "culture": "Cerisier",
        "description": "Maladie fongique rare mais possible sur cerisier, causée par un oomycète du genre Peronospora. Elle affecte principalement le feuillage, réduisant la photosynthèse et la vigueur de l’arbre.",
        "symptômes": "Taches jaunes à brunes sur la face supérieure des feuilles, avec un duvet grisâtre à violacé sur la face inférieure. Les feuilles peuvent se recroqueviller et tomber prématurément.",
        "évolution": "Le pathogène se développe par temps frais et humide. Les spores se propagent par le vent et l’eau. La maladie peut apparaître sporadiquement dans les vergers mal drainés ou densément plantés.",
        "traitement": "Favoriser l’aération par la taille. Éviter l’arrosage du feuillage. Appliquer des fongicides spécifiques (fosétyl-Al, mandipropamide) en conditions favorables. Utiliser des variétés tolérantes si disponibles."
    },
    "Maladie du spot de feuille de maïs": {
        "agent_causal": "Cercospora zeae-maydis",
        "culture": "Maïs",
        "description": "Maladie fongique foliaire du maïs causée par Cercospora zeae-maydis, responsable de la cercosporiose. Elle réduit la surface photosynthétique et peut entraîner des pertes de rendement significatives.",
        "symptômes": "Taches allongées brun-gris à centre clair sur les feuilles, souvent bordées de rouge ou de violet. Les lésions peuvent fusionner et provoquer un dessèchement foliaire.",
        "évolution": "Le champignon survit dans les résidus de culture. Il se développe par temps chaud et humide. Les spores se propagent par le vent et les éclaboussures d’eau.",
        "traitement": "Utiliser des variétés résistantes. Réduire les résidus par enfouissement. Appliquer des fongicides (strobilurines, triazoles) en conditions favorables. Éviter les rotations courtes avec du maïs."
    },
    "Maladie du spot de maïs": {
        "agent_causal": "Helminthosporium maydis (syn. Exserohilum turcicum)",
        "culture": "Maïs",
        "description": "Maladie foliaire causée par Helminthosporium maydis, également connue sous le nom de tache foliaire nordique. Elle affecte les feuilles du maïs, réduisant la photosynthèse et le rendement.",
        "symptômes": "Taches allongées brun clair à brun foncé, souvent en forme de fuseau, apparaissant d’abord sur les feuilles inférieures. Les lésions peuvent s’étendre et fusionner.",
        "évolution": "Le champignon hiverne dans les résidus de culture. Il se développe par temps chaud et humide. Les spores se propagent par le vent et les éclaboussures.",
        "traitement": "Utiliser des variétés résistantes. Enfouir les résidus. Appliquer des fongicides (triazoles, strobilurines) si nécessaire. Éviter les rotations courtes avec du maïs."
    },
    "Rouille de maïs": {
        "agent_causal": "Puccinia sorghi",
        "culture": "Maïs",
        "description": "Maladie fongique causée par Puccinia sorghi, responsable de la rouille commune du maïs. Elle affecte principalement les feuilles, réduisant leur capacité photosynthétique.",
        "symptômes": "Pustules brun-rouge à noires sur les deux faces des feuilles, souvent alignées le long des nervures. Les tissus autour des pustules peuvent jaunir et se dessécher.",
        "évolution": "Le champignon se développe par temps chaud et humide. Les spores sont transportées par le vent sur de longues distances. Les infections précoces sont les plus dommageables.",
        "traitement": "Utiliser des variétés résistantes. Surveiller les conditions climatiques. Appliquer des fongicides (trifloxystrobine, azoxystrobine) en cas de forte pression. Éviter les densités de semis trop élevées."
    },
    "Maladie bactérienne du poivron": {
        "agent_causal": "Xanthomonas campestris pv. vesicatoria",
        "culture": "Poivron",
        "description": "Maladie bactérienne fréquente du poivron, causée par Xanthomonas campestris pv. vesicatoria. Elle affecte les feuilles, les tiges et les fruits, provoquant des pertes de qualité et de rendement.",
        "symptômes": "Petites taches hydrosées sur les feuilles, devenant brun foncé avec un halo jaune. Sur les fruits, lésions enfoncées, sombres, parfois exsudatives. Les tiges peuvent présenter des chancres.",
        "évolution": "La bactérie se propage par les semences, les éclaboussures d’eau et les outils contaminés. Elle se développe rapidement par temps chaud et humide. Les infections précoces sont les plus dommageables.",
        "traitement": "Utiliser des semences certifiées saines. Appliquer des traitements à base de cuivre en conditions favorables. Éviter les arrosages par aspersion. Désinfecter les outils et pratiquer la rotation des cultures."
    },
    "Acariens": {
        "agent_causal": "Tetranychus urticae (acarien à deux points) et autres espèces",
        "culture": "Plantes diverses (tomate, poivron, haricot, etc.)",
        "description": "Parasites microscopiques appartenant à la famille des arachnides. Ils se nourrissent de la sève des plantes, provoquant des dégâts sur les feuilles et réduisant la photosynthèse.",
        "symptômes": "Feuilles décolorées, ponctuées de minuscules taches jaunes. Présence de toiles fines sur la face inférieure des feuilles. Les feuilles peuvent se dessécher et tomber prématurément.",
        "évolution": "Les acariens se développent rapidement par temps chaud et sec. Leur population peut exploser en serre ou en conditions de stress hydrique. Ils se propagent par le vent ou le contact entre plantes.",
        "traitement": "Favoriser l’humidité ambiante. Introduire des auxiliaires (Phytoseiulus persimilis). Utiliser des acaricides spécifiques si nécessaire. Éviter les traitements insecticides non ciblés qui détruisent les prédateurs naturels."
    },
    "Maladie des moisissures de feuilles de tomate": {
        "agent_causal": "Fulvia fulva (syn. Cladosporium fulvum)",
        "culture": "Tomate",
        "description": "Maladie fongique foliaire de la tomate, aussi appelée cladosporiose. Elle affecte principalement les feuilles, réduisant la photosynthèse et affaiblissant la plante.",
        "symptômes": "Taches jaunes sur la face supérieure des feuilles, correspondant à un feutrage brun-olive sur la face inférieure. Les feuilles se dessèchent et tombent prématurément. Les fruits ne sont généralement pas atteints.",
        "évolution": "Le champignon se développe en conditions humides et chaudes, notamment en serre. Il se propage par les spores transportées par l’air ou l’eau.",
        "traitement": "Assurer une bonne aération. Éviter l’humidité excessive. Appliquer des fongicides spécifiques (cuivre, chlorothalonil). Utiliser des variétés résistantes si disponibles."
    },
    "Éjaculation des coquilles de tomate": {
        "agent_causal": "Erreur de traduction — probablement pourriture apicale (nécrose apicale)",
        "culture": "Tomate",
        "description": "Désordre physiologique non pathogène, souvent appelé 'cul noir'. Il est causé par une carence en calcium ou un stress hydrique, et non par un agent infectieux.",
        "symptômes": "Taches sombres et enfoncées à l’extrémité inférieure du fruit (opposée au pédoncule). La chair devient noire et aqueuse. Les feuilles restent saines.",
        "évolution": "Apparaît en cas d’arrosage irrégulier, de croissance rapide ou de sol pauvre en calcium. Les jeunes fruits sont les plus sensibles.",
        "traitement": "Maintenir une irrigation régulière. Éviter les excès d’azote. Apporter du calcium (nitrate de calcium ou coquilles d’œufs broyées). Pailler pour stabiliser l’humidité du sol."
    },
    "Blight prématuré de tomate": {
        "agent_causal": "Alternaria solani",
        "culture": "Tomate",
        "description": "Maladie fongique fréquente de la tomate, aussi appelée brûlure précoce. Elle affecte les feuilles, les tiges et les fruits, réduisant la photosynthèse et la qualité des récoltes.",
        "symptômes": "Taches brunes concentriques en forme de cible sur les feuilles inférieures, s’étendant vers le haut. Lésions sombres sur les tiges et les fruits, parfois avec un halo jaune.",
        "évolution": "Le champignon survit dans les résidus de culture. Il se développe rapidement par temps chaud et humide. Les spores se propagent par le vent, l’eau et les outils.",
        "traitement": "Éliminer les résidus de culture. Appliquer des fongicides préventifs (chlorothalonil, mancozèbe, azoxystrobine). Favoriser l’aération et éviter l’arrosage du feuillage."
    },
    "Brûlure tardive de la tomate": {
        "agent_causal": "Phytophthora infestans",
        "culture": "Tomate",
        "description": "Maladie fongique très destructrice de la tomate, responsable de la brûlure tardive. Elle peut anéantir une culture entière en quelques jours si les conditions sont favorables.",
        "symptômes": "Taches brun foncé imbibées d’eau sur les feuilles, souvent bordées d’un halo vert pâle. Lésions sombres sur les tiges et les fruits, avec pourriture rapide.",
        "évolution": "Le pathogène se développe par temps frais et humide. Les spores se propagent par le vent et l’eau. Les infections peuvent apparaître soudainement et se propager rapidement.",
        "traitement": "Utiliser des variétés résistantes. Appliquer des fongicides systémiques (cyazofamide, mandipropamide) dès les premiers signes. Éviter les arrosages par aspersion et éliminer les plantes infectées."
    },
    "Maladie bactérienne de tomate": {
        "agent_causal": "Clavibacter michiganensis subsp. michiganensis",
        "culture": "Tomate",
        "description": "Maladie bactérienne grave de la tomate, aussi appelée chancre bactérien. Elle affecte les feuilles, les tiges et les fruits, provoquant flétrissement et nécroses.",
        "symptômes": "Taches brunes bordées de jaune sur les feuilles. Fendillements et chancres sur les tiges. Petites lésions nécrotiques sur les fruits, parfois entourées d’un anneau blanchâtre.",
        "évolution": "La bactérie se propage par les semences, les outils et les éclaboussures d’eau. Elle pénètre par les blessures et se développe rapidement en conditions chaudes et humides.",
        "traitement": "Utiliser des semences certifiées saines. Désinfecter les outils. Éliminer les plantes infectées. Appliquer des traitements à base de cuivre en conditions favorables."
    },
    "Maladie du virus de la mosaïque de tomate": {
        "agent_causal": "Tomato mosaic virus (ToMV)",
        "culture": "Tomate",
        "description": "Maladie virale très stable et répandue, causée par le Tomato mosaic virus. Elle affecte les feuilles, les fleurs et les fruits, réduisant la croissance et la qualité des récoltes.",
        "symptômes": "Marbrures vert clair à foncé sur les feuilles, gaufrage, crispation et réduction de taille. Fruits déformés, avec décolorations jaunes ou anneaux. Chute de fleurs fréquente.",
        "évolution": "Le virus se transmet par contact, outils, semences ou résidus infectés. Il est très stable et peut persister longtemps dans l’environnement. Les symptômes varient selon la souche et les conditions.",
        "traitement": "Utiliser des variétés résistantes. Désinfecter les outils et les mains. Éliminer les plantes infectées. Éviter les semences non certifiées et les manipulations excessives."
    },
    "Maladie cible de tomate": {
        "agent_causal": "Corynespora cassiicola",
        "culture": "Tomate",
        "description": "Maladie fongique connue sous le nom de 'target spot' en anglais, causée par Corynespora cassiicola. Elle affecte principalement les feuilles, mais peut aussi toucher les tiges et les fruits, réduisant la photosynthèse et la qualité des récoltes.",
        "symptômes": "Taches circulaires brun foncé à centre clair sur les feuilles, souvent avec des anneaux concentriques rappelant une cible. Les lésions peuvent fusionner, entraînant un dessèchement foliaire. Sur les fruits, taches sombres et enfoncées.",
        "évolution": "Le champignon se développe par temps chaud et humide. Il se propage par les éclaboussures d’eau, le vent et les outils contaminés. Les résidus de culture sont une source importante d’inoculum.",
        "traitement": "Éliminer les résidus de culture. Appliquer des fongicides préventifs (chlorothalonil, azoxystrobine). Favoriser l’aération et éviter l’arrosage du feuillage. Pratiquer la rotation des cultures."
    },
    "Maladie du virus de la chrysanthèse jaune de tomates": {
        "agent_causal": "Tomato yellow leaf curl virus (TYLCV)",
        "culture": "Tomate",
        "description": "Maladie virale grave de la tomate, transmise par la mouche blanche (Bemisia tabaci). Elle provoque un enroulement et un jaunissement des feuilles, réduisant fortement la croissance et la production.",
        "symptômes": "Feuilles supérieures enroulées vers le haut, épaissies et jaunies. Plantes rabougries, floraison réduite, fruits peu nombreux ou absents. Symptômes plus marqués sur les jeunes plants.",
        "évolution": "Le virus est transmis de manière persistante par la mouche blanche. Il ne se transmet pas par les semences. Une fois infectée, la plante reste porteuse à vie. Les épidémies sont favorisées par des températures chaudes et une forte pression vectorielle.",
        "traitement": "Utiliser des variétés résistantes. Contrôler les populations de mouches blanches avec des filets, des insecticides ciblés ou des auxiliaires. Éviter les plantations successives sans rotation. Éliminer les plants infectés dès l’apparition des symptômes."
    },
    "Rouille de genévrier de pomme": {
        "agent_causal": "Gymnosporangium juniperi-virginianae",
        "culture": "Pommier",
        "description": "Maladie fongique hétéroïque nécessitant deux hôtes : le genévrier (Juniperus virginiana) et le pommier. Elle provoque des lésions ornementées sur les feuilles et parfois les fruits du pommier, et des galles gélatineuses sur le genévrier.",
        "symptômes": "Taches orange à rouge vif sur les feuilles du pommier, souvent avec des points noirs (spermogonies). Sur la face inférieure, apparition de tubes orangés (écidies). Sur le genévrier, galles brunes devenant gélatineuses au printemps.",
        "évolution": "Le champignon hiverne sur les genévriers. Au printemps, les spores infectent les pommiers. En été, les spores produites sur le pommier réinfectent les genévriers. Le cycle se répète chaque année.",
        "traitement": "Éviter la proximité entre pommiers et genévriers. Supprimer les galles sur les genévriers. Appliquer des fongicides préventifs (trifloxystrobine, myclobutanil) au printemps. Utiliser des variétés résistantes si disponibles."
    },
    "Maladie d'étoile noire de pomme": {
        "agent_causal": "Diplocarpon mali (syn. Marssonina coronaria)",
        "culture": "Pommier",
        "description": "Maladie fongique foliaire du pommier, aussi appelée Marssoninose. Elle provoque des taches sombres étoilées sur les feuilles, pouvant entraîner une défoliation prématurée et affaiblir l’arbre.",
        "symptômes": "Taches noires irrégulières à bords flous sur les feuilles, souvent en forme d’étoile. Les lésions peuvent fusionner. Chute prématurée des feuilles en cas d’infection sévère.",
        "évolution": "Le champignon hiverne dans les feuilles mortes. Il se développe par temps chaud et humide. Les spores se propagent par les éclaboussures d’eau.",
        "traitement": "Ramasser et détruire les feuilles mortes. Appliquer des fongicides préventifs (captane, mancozèbe) dès le printemps. Favoriser l’aération de la canopée. Utiliser des variétés tolérantes si disponibles."
    },
    "Pomme de pourriture noire": {
        "culture": "Pomme",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie de brûlure des feuilles de fraise": {
        "agent_causal": "Phomopsis obscurans",
        "culture": "Fraisier",
        "description": "Maladie fongique affectant principalement le feuillage du fraisier, causée par Phomopsis obscurans. Elle affaiblit la plante et réduit la production de fruits.",
        "symptômes": "Taches brun rougeâtre à centre clair sur les feuilles, souvent bordées de rouge. Les lésions s’étendent et provoquent un dessèchement foliaire. Les feuilles peuvent se perforer ou se nécroser.",
        "évolution": "Le champignon hiverne dans les débris végétaux. Il se développe par temps chaud et humide. Les spores se propagent par les éclaboussures d’eau.",
        "traitement": "Éliminer les feuilles infectées. Espacer les plants pour favoriser l’aération. Appliquer des fongicides préventifs (captane, thiophanate-méthyl). Éviter l’arrosage du feuillage."
    },
    "Brûlure de la feuille de raisin": {
        "agent_causal": "Elsinoë ampelina (anthracnose de la vigne)",
        "culture": "Vigne",
        "description": "Maladie fongique connue sous le nom d’anthracnose de la vigne, causée par Elsinoë ampelina. Elle provoque des lésions sur les feuilles, les rameaux et parfois les baies.",
        "symptômes": "Taches brunes à noires, anguleuses, parfois perforées, sur les feuilles. Les jeunes rameaux présentent des lésions allongées et creusées. Les baies peuvent se nécroser.",
        "évolution": "Le champignon hiverne dans les chancres. Il se développe par temps humide et doux. Les spores se propagent par la pluie et les éclaboussures.",
        "traitement": "Tailler les rameaux infectés. Appliquer des fongicides (cuivre, mancozèbe) dès le débourrement. Favoriser l’aération de la vigne. Éviter les blessures mécaniques."
    },
    "Rot noir de raisin": {
        "agent_causal": "Guignardia bidwellii",
        "culture": "Vigne",
        "description": "Maladie fongique grave de la vigne, aussi appelée black rot. Elle affecte les feuilles, les rameaux et surtout les baies, compromettant la récolte.",
        "symptômes": "Taches brun-rouge sur les feuilles, avec pycnides noires au centre. Sur les baies, lésions brunes qui se dessèchent et deviennent dures, noires et ridées.",
        "évolution": "Le champignon hiverne dans les baies momifiées. Il se développe par temps chaud et humide. Les spores se propagent par les éclaboussures d’eau.",
        "traitement": "Éliminer les baies et feuilles infectées. Appliquer des fongicides (trifloxystrobine, myclobutanil) dès le printemps. Pratiquer la rotation et éviter les zones humides."
    },
    "Maladie de la rougeole noire de raisin": {
        "agent_causal": "Probablement un complexe de champignons du sol (non identifié précisément)",
        "culture": "Vigne",
        "description": "Nom probablement erroné ou mal traduit. Il pourrait s’agir d’une confusion avec la pourriture noire ou une maladie racinaire fongique. Aucun agent pathogène officiellement reconnu sous ce nom.",
        "symptômes": "Affaiblissement général de la vigne, taches sombres sur les feuilles ou les racines, selon l’origine réelle de la pathologie.",
        "évolution": "Inconnue avec précision. Si racinaire, progression lente mais irréversible. Si foliaire, dépend des conditions climatiques.",
        "traitement": "Surveiller les symptômes. Améliorer le drainage. Éviter les blessures racinaires. Utiliser des porte-greffes résistants si la maladie est confirmée comme racinaire."
    },
    "Épidémie de pommes de terre prématurée": {
        "agent_causal": "Verticillium spp. (complexe de flétrissement prématuré)",
        "culture": "Pomme de terre",
        "description": "Syndrome complexe causé par Verticillium spp., souvent aggravé par les nématodes. Il entraîne un flétrissement prématuré des plants, réduisant le rendement.",
        "symptômes": "Jaunissement et flétrissement des feuilles pendant le remplissage des tubercules. Taches brunes dans les vaisseaux des tiges. Réduction de la taille des tubercules.",
        "évolution": "Le champignon persiste dans le sol. Il infecte les racines et bloque la circulation de la sève. Les symptômes apparaissent en fin de cycle.",
        "traitement": "Utiliser des variétés tolérantes. Allonger la rotation des cultures. Appliquer des fongicides de sol (ex. fluopyram). Contrôler les nématodes associés."
    },
    "Blight tardif de la pomme de terre": {
        "agent_causal": "Phytophthora infestans",
        "culture": "Pomme de terre",
        "description": "Maladie fongique très destructrice, aussi appelée mildiou de la pomme de terre. Elle peut anéantir une culture entière en quelques jours si non maîtrisée.",
        "symptômes": "Taches brun foncé à bord vert pâle sur les feuilles. Feutrage blanc sur la face inférieure. Pourriture des tiges et des tubercules.",
        "évolution": "Le champignon hiverne dans les tubercules infectés. Il se propage par le vent et l’eau. Les cycles d’infection sont rapides en conditions humides.",
        "traitement": "Utiliser des variétés résistantes. Appliquer des fongicides systémiques (cyazofamide, mandipropamide). Éliminer les repousses et les tubercules infectés."
    },
    "Pourriture des racines de soja": {
        "agent_causal": "Phytophthora sojae",
        "culture": "Soja",
        "description": "Maladie fongique grave du soja causée par l’oomycète Phytophthora sojae. Elle affecte les racines et la base de la tige, entraînant un flétrissement, une pourriture et parfois la mort des plants.",
        "symptômes": "Flétrissement des feuilles, jaunissement, pourriture brune des racines et de la base de la tige. Les feuilles flétries restent attachées à la plante. Les semis peuvent ne pas émerger ou mourir rapidement.",
        "évolution": "Le pathogène hiverne sous forme d’oospores dans le sol. Il se développe dans les sols saturés en eau, entre 15 et 27 °C. Les spores nagent vers les racines et infectent les tissus. Plusieurs cycles peuvent survenir en saison.",
        "traitement": "Utiliser des variétés résistantes. Semer dans des sols bien drainés. Appliquer des fongicides de semences (métalaxyl, éthaboxam). Pratiquer la rotation avec des cultures non hôtes (maïs, blé)."
    },
    "Maladie de la plaque bactérienne du soja": {
        "agent_causal": "Pseudomonas syringae pv. glycinea",
        "culture": "Soja",
        "description": "Maladie bactérienne fréquente du soja, aussi appelée brûlure bactérienne. Elle affecte principalement les feuilles, mais peut aussi toucher les gousses et les tiges.",
        "symptômes": "Taches anguleuses brun foncé à noires sur les feuilles, souvent bordées d’un halo jaune. Les lésions peuvent se dessécher et tomber, donnant un aspect criblé. Les gousses peuvent présenter des taches sombres.",
        "évolution": "La bactérie survit sur les semences et les résidus de culture. Elle se propage par les éclaboussures d’eau, le vent et les outils. Les infections sont favorisées par un temps frais et humide.",
        "traitement": "Utiliser des semences certifiées. Éviter de travailler dans les champs mouillés. Appliquer des traitements à base de cuivre en conditions favorables. Pratiquer la rotation des cultures."
    },
    "Maladie du virus de la mosaïque de soja": {
        "agent_causal": "Soybean mosaic virus (SMV)",
        "culture": "Soja",
        "description": "Maladie virale transmise par les pucerons et les semences infectées. Elle affecte la croissance, la qualité des graines et le rendement du soja.",
        "symptômes": "Mosaïque vert clair et foncé sur les jeunes feuilles, enroulement vers le bas, rabougrissement des plants. Réduction du nombre et de la taille des gousses. Marbrures sur les graines.",
        "évolution": "Le virus est transmis par les pucerons (ex. Aphis glycines) de manière non persistante. Il est aussi transmis par les semences. Les infections précoces sont les plus dommageables.",
        "traitement": "Utiliser des variétés résistantes. Semer des graines certifiées. Contrôler les pucerons. Éviter les rotations avec d’autres hôtes du virus (haricot, pois)."
    },
    "Blé sain": {
        "agent_causal": "Aucun — état physiologique sain",
        "culture": "Blé",
        "description": "Entrée probablement erronée ou générique. 'Blé sain' ne désigne pas une maladie, mais plutôt un état de santé de la culture. Aucun traitement requis.",
        "symptômes": "Aucun symptôme pathologique. Feuillage vert, croissance normale, épis bien formés.",
        "évolution": "Développement normal du blé en l’absence de stress biotique ou abiotique.",
        "traitement": "Aucun traitement nécessaire. Maintenir de bonnes pratiques culturales pour préserver la santé de la culture."
    },
    "Brûlure des feuilles de blé": {
        "agent_causal": "Bipolaris sorokiniana (syn. Helminthosporium sativum)",
        "culture": "Blé",
        "description": "Maladie fongique foliaire du blé, aussi appelée helminthosporiose. Elle affecte les feuilles, les gaines et parfois les racines, réduisant la photosynthèse et le rendement.",
        "symptômes": "Taches brunes allongées à centre clair sur les feuilles. Les lésions peuvent fusionner et provoquer un dessèchement foliaire. Sur les gaines, stries sombres et nécroses.",
        "évolution": "Le champignon survit dans les résidus de culture et les semences. Il se développe par temps chaud et humide. Les spores se propagent par le vent et l’eau.",
        "traitement": "Utiliser des semences saines. Appliquer des fongicides (triazoles, strobilurines) en conditions favorables. Pratiquer la rotation des cultures et enfouir les résidus."
    },
    "Rouille de bande de blé": {
        "agent_causal": "Puccinia striiformis f. sp. tritici",
        "culture": "Blé",
        "description": "Maladie fongique aussi appelée rouille jaune du blé. Elle provoque des stries de pustules jaunes sur les feuilles, réduisant fortement la photosynthèse et le rendement.",
        "symptômes": "Pustules jaune orangé alignées en bandes parallèles aux nervures des feuilles. Les feuilles jaunissent, se dessèchent et meurent prématurément.",
        "évolution": "Le champignon se développe par temps frais et humide. Les spores sont disséminées par le vent. Les infections précoces sont les plus dommageables.",
        "traitement": "Utiliser des variétés résistantes. Surveiller les parcelles sensibles. Appliquer des fongicides (triazoles, strobilurines) dès les premiers symptômes."
    },
    "Rouille de feuille de blé": {
        "culture": "Rouille",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie des expectorations noires en vrac dans le blé": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Root Corona Rot": {
        "culture": "Root",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Mède de blé poudre": {
        "culture": "Mède",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Gibberrellose de blé": {
        "culture": "Gibberrellose",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Rouille des feuilles": {
        "culture": "Rouille",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Rouille": {
        "culture": "",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie de Donggru": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Blast de riz": {
        "culture": "Blast",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Brûlure bactérienne": {
        "culture": "Brûlure",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie du spot brun": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Rice Blanc Leaf Blight": {
        "culture": "Rice",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Blight de la veine de riz": {
        "culture": "Blight",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie de la bande bactérienne dans le riz": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie du riz à la annulation": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie des vermicelles de riz": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Rizière": {
        "culture": "",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Bug de riz": {
        "culture": "Bug",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Ferme à feuilles de riz": {
        "culture": "Ferme",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Sauterelle de riz": {
        "culture": "Sauterelle",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Houle de riz": {
        "culture": "Houle",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Corn Southern Rust": {
        "culture": "Corn",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Betterave": {
        "culture": "",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Moth de lanterne à bord rouge": {
        "culture": "Moth",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie du virus de la mosaïque de raisin": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Mildiou de raisin": {
        "culture": "Mildiou",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Moule noir": {
        "culture": "Moule",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Anthrax de pastèque": {
        "culture": "Anthrax",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maladie du virus de la pastèque": {
        "culture": "Maladie",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Cowpea Brown Spot maladie": {
        "culture": "Cowpea",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Anthrax de concombre": {
        "culture": "Anthrax",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "CUCUBRIMBER MOULOE POWERS": {
        "culture": "CUCUBRIMBER",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Mouveau du coeur": {
        "culture": "Mouveau",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "CUCUMBUMER CIBLEAL": {
        "culture": "CUCUMBUMER",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "ip102_v1.1 (c)": {
        "culture": "ip102_v1.1",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "ip102_v1.1": {
        "culture": "",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "images": {
        "culture": "",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Blé sain (C)": {
        "culture": "Blé",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Soja sain": {
        "culture": "Soja",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Agrumes sains": {
        "culture": "Agrumes",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Framboise saine": {
        "culture": "Framboise",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Pêches saines": {
        "culture": "Pêches",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Cherries saines": {
        "culture": "Cherries",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Maïs sain": {
        "culture": "Maïs",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Poivron sain": {
        "culture": "Poivron",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Tomates saines": {
        "culture": "Tomates",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Fraises saines": {
        "culture": "Fraises",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Raisins sains": {
        "culture": "Raisins",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    },
    "Pommes de terre saines": {
        "culture": "Pommes",
        "description": "",
        "symptômes": "",
        "évolution": "",
        "traitement": ""
    }
}
