{
    "abiotic_stress": {
        "extreme_temperatures": {
            "name": "Stress thermique extrême",
            "symptoms": "Flétrissement, brûlure des feuilles, croissance ralentie, chute des fleurs ou fruits.",
            "effects": {
                "low_temperature": "Ralentissement du métabolisme, inhibition de la germination, dommages cellulaires.",
                "high_temperature": "Déséquilibre hydrique, dénaturation des protéines, réduction de la photosynthèse."
            },
            "impact_on_yield": "Réduction significative du rendement, mauvaise qualité des fruits, stress reproductif.",
            "correction": "Utiliser des variétés tolérantes, ajuster les dates de semis, ombrage ou irrigation pour atténuer les pics thermiques."
        },
        "light_stress": {
            "name": "Stress lumineux",
            "symptoms": "Feuilles pâles ou brûlées, chlorose, croissance déséquilibrée, étiolement.",
            "effects": {
                "deficiency": "Photosynthèse réduite, faible production de biomasse, allongement des tiges.",
                "excess": "Brûlure foliaire, stress oxydatif, inhibition enzymatique."
            },
            "impact_on_yield": "Réduction de la croissance végétative, floraison retardée, rendement limité.",
            "correction": "Optimiser la densité de plantation, utiliser des filets d’ombrage ou ajuster l’exposition selon les besoins du cultivar."
        },
        "salinity": {
            "name": "Stress salin",
            "symptoms": "Feuilles épaissies, bordures brûlées, chlorose, croissance ralentie.",
            "effects": {
                "deficiency": "Blocage de l’absorption des nutriments, toxicité ionique, stress hydrique induit.",
                "excess": "Accumulation de sels dans les tissus, inhibition enzymatique, nécrose."
            },
            "impact_on_yield": "Réduction du rendement, mauvaise qualité des grains ou fruits, sensibilité accrue aux maladies.",
            "correction": "Améliorer le drainage, utiliser des amendements comme le gypse, sélectionner des variétés tolérantes à la salinité."
        },
        "water_stress": {
            "name": "Stress hydrique",
            "symptoms": "Flétrissement, feuilles enroulées, chute prématurée, croissance ralentie.",
            "effects": {
                "deficiency": "Réduction de la photosynthèse, fermeture des stomates, inhibition de la division cellulaire.",
                "excess": "Asphyxie racinaire, développement de maladies fongiques, lixiviation des nutriments."
            },
            "impact_on_yield": "Baisse du rendement, qualité réduite, stress physiologique prolongé.",
            "correction": "Irrigation contrôlée, amélioration du drainage, paillage pour conserver l’humidité."
        }
    }
}
